{"doi": "https://doi.org/10.7764/rcia.v36i1.244", "year": 2009, "abstract": "In this study, adult Helix apersa land snails with previously established periodicity were observed at three densities in their fi nishing stage in order to contribute to the body of knowledge about spatial distribution and certain behavior patterns in an outdoor system. From November 8 to December 18, 2006, snails that were in their fi nal fattening phase were grouped at three densities (50 snail m-², 100 snail m-², 200 snail m-²) and randomly placed in nine cubicles, with three replicates of each density. Twelve observations of the snail behavior were made between 12 am and 1 pm. The categories selected as “discrete acts” include: observing the snails in the shelters, on Swiss chard leaves ( Beta vulgaris ), adhered to the netting, on the balanced feed, on the water supply tray, and on the ground. A statistical analysis employing marginal and partial frequency tests was completed on the density x category x time interactions. It was concluded that around midday, the majority of the snails remained in the artifi cial shelters and on the Swiss chard monoculture leaves. In addition, differences were not detected for the rest of the categories in regard to the spatial distribution of the individuals in the three densities analyzed. If lower densities than the ones most commonly employed in studies (200 snail m-²) are used in an open outdoor system in the fattening stage, the individuals will use the available space in a similar way, thereby exhibiting similar behavior patterns. Con el objeto de contribuir al conocimiento de la distribucion espacial y de ciertas pautas de comportamiento de caracoles de Helix aspersa en sistema abierto, se observaron con frecuencias previamente establecidas tres densidades de caracoles adultos en terminacion. Entre el 8 de noviembre y el 18 de diciembre del ano 2006, se alojaron en nueve cubiculos aleatoriamente con tres repeticiones, 50, 100 y 200 caracol m-2 en la fase fi nal de engorde. Se realizaron 12 observaciones entre las 12 a.m y las 13 a.m. Las categorias seleccionadas como actos discretos correspondieron a observar a los ejemplares en los refugios, sobre las hojas de acelga, adheridos a la red, sobre el alimento balanceado, en la bandeja de suministro de agua y en el suelo. Se realizo un analisis estadistico de las interacciones densidad x categoria x tiempo por medio de pruebas de frecuencias marginales y parciales. Se concluyo que en horas del mediodia la mayoria de los caracoles permanecian en los refugios artifi ciales y en las hojas de monocultivo de acelga y no se detectaron diferencias para el resto de las categorias respecto de la distribucion espacial de los individuos en las tres densidades analizadas. Si se emplean densidades menores a la mayormente utilizada en sistema abierto para la etapa de engorde (200 caracol m-2) los individuos utilizarian de manera semejante el espacio disponible expresando pautas comportamentales similares."}