{"doi": "https://doi.org/10.1016/s0006-3207(00)00181-6", "year": 2001, "abstract": "Native Pacific island biotas are disappearing rapidly. Among these native biotas the land snails are especially recognized not only for their high diversity and high levels of endemism but also for being under severe threat, with many species already extinct. Many non-indigenous snail species are being introduced, leading to a homogenization of land snail faunas across the Pacific. Field survey work in American Samoa in 1998 recorded 19 of the 42 previously known native land snail species, 11 of the 12 alien species, and three of the six cryptogenic (unknown origin) species previously known from American Samoa. Eight species were recorded from American Samoa for the first time: three described species that are presumed to be native, four non-indigenous species; and one cryptogenic species. Two undescribed and presumed endemic species were discovered, as was one unidentified and perhaps undescribed species. One species, previously thought to be extinct was rediscovered, although in very small numbers. The known island by island distributions of 11 species (five native, five alien, one cryptogenic) were extended. Comparisons with surveys undertaken predominantly in the 1920s and 1930s, 1975, and 1992 showed that: the majority of native species are declining; some native species may be stable or even increasing, with one species abundant; only seven of the non-indigenous and cryptogenic species are declining or probably declining, while six are increasing, and for others no trend was assessed; some non-indigenous species are extremely abundant. Threats to the fauna include: alien predators, predominantly rats and predatory snails introduced in attempts to control the giant African snail; possible competitors, including non-indigenous snail species; invasive plants and habitat modification; development, including recreational, agricultural, and domestic/urban development. A review should be undertaken of the IUCN and US Fish and Wildlife Service listings of endangered land snail species in American Samoa."}