{"doi": "https://doi.org/10.5451/unibas-004221945", "year": 2007, "abstract": "Nutrient-poor, dry calcareous grasslands in Central Europe harbour an extraordinary\r\nhigh diversity of plants and invertebrates. Consequently, they are of high\r\nconservation value. However, changes in agriculture (intensification or abandonment)\r\nhave resulted in a dramatic reduction of semi-natural grasslands in the twentieth\r\ncentury. Today, dry grasslands are among the most endangered habitats.\r\nFurthermore, these grasslands are frequently fragmented and surrounded by forest\r\nor intensively cultivated agricultural areas.\r\nSemi-natural grasslands are fragile because their maintenance depends on\r\ntraditional farming techniques. In order to avoid any loss of species by inappropriate\r\nland use, it is important to assess the responses of threatened species to particular\r\ntypes of grassland management. Although different types of present and past pasture\r\nmanagement are known to affect the species richness and composition of plant\r\ncommunities, knowledge of the effects on invertebrates is limited. In particular, no\r\nstudies exist on the influence of different types of pasture management on animals\r\nwith limited mobility, such as gastropods.\r\nIn the present thesis, I examined the effects of different pasture management\r\npractices on the snail community in dry, nutrient-poor grasslands of the Swiss Jura\r\nmountains, where extensive grazing with low stocking rate and without use of\r\nfertilizers is a traditional form of grassland management. I assessed the snail\r\ncommunities in extensive pastures grazed by horses, cattle or sheep, in cattle\r\npastures with different management intensity and in extensive pastures with different\r\nmanagement history in the last 55 years. Furthermore, gastropod species richness\r\nand abundance were examined in transects running from extensive pastures through\r\ngradual or abrupt forest edges into the forest interior.\r\nGrazing by different livestock species did not affect the species richness,\r\nabundance and species composition of land snails. However, independent of\r\nlivestock species, snail species richness, abundance and number of red-listed\r\nspecies decreased with increasing grazing intensity. Furthermore, cattle pastures\r\nwithout fertilizer application and with low grazing intensity harboured more snail\r\nspecies and more threatened snails than pastures with annual addition of fertilizer\r\nand higher grazing intensity. Management intensity had also a negative influence on\r\nindividual snail species (Cochlicopa lubricella, Truncatellina cylindrica, Vitrina\r\npellucida, Helicella itala and Helix pomatia). Former changes in pasture use for a\r\nperiod of 10–40 years altered the present-day snail fauna. Past shrub cover had a\r\n\r\nnegative effect on the total number of snail species and individuals, the number of\r\nopen-land species and individuals and the number of red-listed individuals. Former\r\nuse of fertilizer and higher grazing intensity reduced red-listed species and\r\nindividuals and altered the snail community. The grassland snail communities of the\r\npastures changed distinctly to forest communities at the first bushes or trees of\r\nedges towards forest interior irrespective of the type of forest edge. In pastures, at a\r\ndistance of 10 m from gradual forest edges, more open-land snail species were\r\nfound than at the corresponding distance from abrupt forest edges. Furthermore,\r\necotones of gradual forest edges harboured more open-land individuals than those of\r\nabrupt forest edges.\r\nFor the conservation of grassland land snail communities, it does not matter\r\nwhether pastures are stocked with horses, cattle or sheep, provided the grazing\r\nintensity is low. To preserve the threatened snail species in dry, nutrient-poor\r\ngrasslands, a network of pastures should be managed without fertilization and\r\ngrazing intensity should not exceed 180 LU.ha-1.d (product of livestock units per\r\nhectare and grazing days). Furthermore, to recover the typical grassland snail\r\ncommunity in shrub cleared pastures or former fertilized pastures, the connection\r\nbetween intact pastures and grasslands under restoration should be improved by\r\ncreating and maintaining new semi-natural areas and by exchanging livestock among\r\nthese areas during the grazing season. Since shadowing of trees and alterations of\r\nthe microclimate close to the forest edge may reduce the actual size of small\r\ngrassland fragments, encroaching shrubs should be regularly removed and gradual\r\nforest edges created and maintained."}