{"doi": "https://doi.org/10.1111/j.1095-8312.2010.01604.x", "year": 2011, "abstract": "Because land snails inhabiting the seashore are most likely to be carried by ocean currents or by attaching to seabirds, land snail fauna on oceanic islands include species derived from the mainland ancestors inhabiting the seashore. If habitat use of the island descendants is constrained by the ecology of the mainland ancestor, the island species that moved from the coastal habitat to the inland habitat may still be restricted to relatively exposed microhabitats with high pH, calcium carbonate-rich substrates, and poor litter cover. We tested this hypothesis by investigating the association between environmental conditions and species diversity of seashore-derived species of the endemic land snails on the oceanic Hahajima Island (Ogasawara Islands). Seashore-derived species showed higher species richness on limestone outcrops than non-limestone areas, whereas the other species showed no significant increase in species richness in limestone outcrops. There was a higher proportion of seashore-derived species on the limestone ridges than on the soil of dolines, even in the limestone area. Accordingly, the species derived from the seashore of the mainland are restricted to microhabitats with poor vegetation cover, poor litter cover, high pH, and calcium carbonate-rich substrates, which supports the hypothesis that the inland species on an island derived from the mainland seashore still prefer environments similar to the seashore. In addition, the seashore-derived species on the limestone outcrop include cave-dwellers lacking functional eyes. This suggests that the probability of colonizing a cave environment is restricted to seashore-derived species. The findings obtained in the present study suggest that habitat use of the ancestral lineages can constrain habitat use of the descendants, even in the oceanic islands with depauperate fauna. This bias in the species composition on the limestone outcrop constrains lineages that can colonize and adapt to the inside of caves, and therefore, habitat use of the ancestral lineages affects the ability of descendant lineages to colonize novel habitats."}