{"doi": "https://doi.org/10.1111/j.1523-1739.2005.00193.x", "year": 2005, "abstract": "Abstract: The preservation of biodiversity requires high‐quality data and efficient methods for prioritizing species and sites for conservation. We examined the distribution data of 121 Hungarian land snail species in a 10 × 10 km resolution grid system. The spatial consistency of the data set varied significantly among regions, so we excluded cells with &lt;5 species. Thus we used data from 512 out of 1052 grid cells. We prioritized Hungarian land snail species based on an additive scoring index ranging from 2 to 10 in which higher scores indicate rarer species. The index included global range size, local frequency, and a correction factor because of the biased frequency estimate or special importance of some species. We analyzed the relationship between protection status and rarity scores for each species. There were 15 unprotected species of land snails out of 30 considered rare, according to the quartile definition of rarity, and 16 protected species fell out of the score range of rare species. Four of these protected species are threatened by other than their restricted ranges (e.g., habitat loss and overexploitation). We prioritized areas by simple‐ranking and complementary‐areas methods based on species richness (SR), sum of rarity scores (RS), 25% rarest species richness (SQ), and a multiple‐criteria index (SSQ = SR ×[SQ + 1]). In the area‐selection procedures the indices based on the quartile definition of rarity (SQ and SSQ) were slightly more efficient in representing species than species richness and sum of rarity scores. We also made regional comparisons, identified hotspots at the national scale, and investigated the overlap between hotspots and existing reserve areas. The distribution of species richness and rarity among the main geographical regions of Hungary revealed differences between lowland and highland areas. Most of the hotspots were located in the mountain areas and isolated hotspots were identified in lowland areas. All species of Hungarian land snails occurred within current protected areas, but selected hotspots did not overlap with current protected areas in all cases. The location of protected areas in Hungary is adequate to preserve land snails, although we recommend that unprotected hotspots be considered for protection."}