{"doi": "https://doi.org/10.1242/jeb.159.1.525", "year": 1991, "abstract": "Given that respiratory acidosis occurs in land snails during entry into estivation (for a review, see Barnhart, 1989), it is of interest to know the extent of intracellular acidification during this transition. Efforts to measure intracellular pH (pHi) of estivating snails, however, have been complicated by the fact that manipulations inherent in some techniques (e.g. injection of radiolabeled tracers) may cause arousal of dormant snails (B. B. Rees, personal observations). In the present study, we report on the use of P-n.m.r. as a non-invasive technique for measuring pHi in the land snail Oreohelix strigosa (Gould) during entry into estivation. This approach has allowed us to obtain a continuous record of pHi during this transition without disturbance to the animal. We have found that pHi declines rapidly and that over 3 days of estivation pHi drops by 0.4-0.5 units. Since the metabolism of a variety of organisms and cell types is sensitive to pHi (Busa and Nuccitelli, 1984), alterations of pHi during estivation may contribute to the overall metabolic suppression observed in this quiescent state. O. strigosa were collected near Glenwood Springs, Colorado, in November 1990 and were maintained in the laboratory as previously described (Rees and Hand, 1990). The whole mass (soft tissue plus shell) of the snails ranged from 1.0 to 1.5 g. Following the n.m.r. experiments, species identification was confirmed electrophoretically (Rees, 1988). n.m.r. studies were performed on a 7.05-T 10-cm bore cryomagnet with an AM300 spectrometer (Bruker Instruments, Billerica, MA) using a home-built two-turn surface coil. The surface coil was made of insulated 2 mm copper wire and had a diameter of lcm. Fixed and variable capacitors (RS Laboratories, Oxford, UK) were placed for tuning and balanced matching. This coil had a loaded Q that exceeded 100. Approximately 30min prior to the start of an experiment, estivating snails were aroused by transferring them to dampened paper toweling. Snails were then"}