{"doi": "https://doi.org/10.1111/jbi.12549", "year": 2015, "abstract": "Abstract Aim We infer the evolutionary history of the land snail genus Allognathus from a molecular phylogeny. An approximate temporal framework for its colonization of the Balearic Islands and diversification within the archipelago is provided according to palaeogeographical events in the western Mediterranean Basin. Location The Balearic Islands, Western Mediterranean. Methods A 2461‐bp DNA sequence dataset was generated from one nuclear and two mitochondrial gene fragments in 87 specimens, covering all nominal taxa of the genus Allognathus . Through maximum‐likelihood and Bayesian phylogenetic methods along with a Bayesian molecular clock, we examined the evolutionary history of the group. Ancestral distribution ranges were estimated for divergence events across the tree using a Bayesian approach. We also used genetic species‐delimitation models to determine the taxonomy of Allognathus . Results We provided the first molecular phylogeny of Allognathus , a genus endemic to the Balearic Islands. The origin of the genus in the Balearic Islands was dated to the middle Miocene based on palaeogeographical events in the Western Mediterranean. During the late Miocene and Pliocene, several diversification events occurred within the archipelago. The ancestral range of Allognathus was reconstructed as the north‐eastern Tramuntana Mountains of Mallorca. Main conclusions Three species were delimited within the genus, one of which has at least five subspecies. The phylogenetic reconstruction showed a high degree of parallelism between the divergence of the main Allognathus lineages and the palaeogeography of the Balearic Islands. The genus appears to have colonized Mallorca from the south‐east of the Iberian Peninsula during the middle Miocene. Sea level fluctuations that took place in the Western Mediterranean from the Messinian to the present are consistent with the diversification and secondary contacts of the phylogroups of Allognathus , as well as their distribution ranges. The middle Miocene could have been a period for the colonization of the Balearic Islands by other terrestrial organisms."}