{"doi": "https://doi.org/10.5451/unibas-006194484", "year": 2013, "abstract": "Classical sexual selection theory assumes that the reproductive success of females is limited by the resources available for egg production, while the reproductive success of males is determined by the number of mates (Bateman’s principle). It has been suggested that the optimal mating rates should also diverge between gender functions within individuals of simultaneous hermaphrodites. This thesis investigates sex allocation and precopulatory sexual selection by considering the influence of environmental conditions and behaviour on the reproductive allocation to the female and male function in the simultaneous hermaphrodite land snail Arianta arbustorum (L.). Furthermore, sperm competition and cryptic female choice are assumed to be crucial in determining fertilization success in this species because of the presence of multiple mating and long-term sperm storage. This work studies postcopulatory sexual selection mechanisms by considering sperm traits.\r\n First, we investigated the effects of soil type and adult size (shell volume) on mating propensity and female and male reproductive output (number and mass of eggs, number of sperm delivered and spermatophore mass) in individuals from two populations kept both on calcium-(Ca-)rich and Ca-poor soil. Independent of population and shell size, the mating propensity was higher and the total number of eggs produced was larger in snails kept on Ca-poor soil than in individuals reared on Ca-rich soil. We supposed that the Ca-poor soil used in the experiment still contained enough Ca to allow reproduction. Moreover, the Ca-rich soil could contain minerals or (unknown) substances which discourage reproduction in A. arbustorum.\r\n\tIn individual A. arbustorum, we assessed determinants of mating success. We videorecorded the behaviour of individually tagged snails kept in groups of six animals over one reproductive period (58 days) and assigned the genotyped hatchlings to the female and male function of individual parents. We found considerable interindividual variation in the activity of snails, which is a combined measure of time spent crawling, feeding and digging. The snails mated between zero and three times. Mating success, which is equal to the female and male function in simultaneous hermaphrodites with reciprocal copulation, was mainly determined by the activity of an individual. We found that female reproductive success (number of hatchlings emerging from the eggs laid by the focal snail) was positively correlated with male reproductive success (number of hatchlings sired by the focal snail) and that both were determined by the individual’s activity. Our results challenge the trade-off assumption of sex allocation theory in simultaneous hermaphrodites.\r\n Sperm competition is one of the principal determinants of male fitness in species in which females mate promiscuously. The selective pressures it causes, though, are only partly understood, especially with respect to sperm characteristics favoured in sperm competition. We assessed among- and within-population variation in sperm length and number of sperm transferred in A. arbustorum from four natural populations. Sperm competition models on the evolution of sperm size assume associations with other sperm quality traits. Thus, we assessed variation in velocity, motility, and longevity of sperm in snails from two of the four populations. Independent of shell size, sperm length differed among populations and, to a minor extent, even among individuals within populations. Mean sperm length of a snail was not correlated with the number of sperm delivered in a spermatophore. The mean sperm velocity (=VCL) did not differ between snails from two populations. However, VCL varied among snails. Percentage motility and longevity of sperm differed between snails from the two populations. No correlations were found between length, velocity, percentage motility, and longevity of sperm. To conclude, individual snails differed in sperm quality, and this variation may partly explain the differential fertilization success between A. arbustorum snails. Moreover, our findings did not support the positive association between sperm length and longevity assumed by sperm competition models for internally fertilizing species.\r\n The adaptive significance of sperm length variation is still unknown in A. arbustorum. Sexual selection on sperm length requires a significant additive genetic variance. Here we present the first estimates of narrow sense heritability of sperm length in this land snail. Sperm delivered by the same individuals in 2–4 matings over two reproductive seasons did not differ in length, indicating a high repeatability of this trait. Offspring of 10 families were kept at three temperatures (11, 15 and 20 °C) to examine the influence of different environmental conditions on sperm length and adult shell size. Sperm length was affected by temperature but not by family of origin, while adult shell breadth was influenced by temperature and family of origin. Higher temperatures resulted in shorter sperm but larger shells. The heritability of sperm length derived from the two different approaches (one-parent–offspring regression: h2 (SE) = 0.52 (0.55); full-sibling split design: H2 (SE) = –0.19 (0.28)) suggests relatively little genetic variation in this trait in the studied population. In contrast, the heritability of adult shell breadth indicates a strong genetic effect (mother-offspring regression, h2 (SE) = 0.90 (0.33)). The heritability h2 (SE) of adult shell breadth obtained from the father–offspring regression was 0.18 (0.42), i.e. 5 times smaller than that of the mother–offspring regression, suggesting a maternal effect on shell size."}