{"doi": "https://doi.org/10.31357/fesympo.v17i0.679", "year": 2012, "abstract": "A majority (83%) of the 246 species of land snails in Sri Lanka is endemic. The reduction of forest cover affects the diversity of land snail species and therefore it is important to study the status of the existing species. In the preset study, the villages of Mahalakotuwa (Elevation-752m), Illukkumbura (616m), Atanwala (1256m) and Pitawala (787m) in the Northern part of the Knuckles mountain range were selected as the 4 study sites. (Average annual rain fall 3000-5000 mm, Temperature 5.5- 35oC). The project was carried out from December 2011 to April 2012. The objectives were to identify the land snail species present in the study area, calculate the species richness and the abundance of species, identify the pattern of distribution of the population of land snail species, recognize the effect of soil pH, soil temperature, air temperature, relative humidity and depth of leaf litter on the distribution of land snail species Four 30 х 2 m belt transects were used for each study site. Each transect was divided in to 5 х 1 m plots. Number of shells in one plot was calculated within 20 minutes. Likewise all the plots were covered by using Timed Direct Transect method. Soil pH, soil temperature, air temperature, relative humidity and depth of leaf litter were recorded. Data were compared by using Minitab 15 software. Shells were identified according to the morphology of the shell, using a key. Live snails were identified by visual observations. A shell collection was made from collected shells. SPECDIV version 1.3 was used to calculate the Evenness, Shannon diversity index, Simpson index and Margalef Diversity Index. Species Density was calculated A total of 45 species were found in the 4 study sites (Mahalakotuwa: 31, Illukkumbura: 20, Pitawala: 14 and Atanwala: 7). Twenty eight species were identified up to species level; 14 up to generic level and 3 species were not identified. Out of the species identified up to species level, 26 were endemic (92.8%). Highest percentage of species belonged to family Ariophantidae (53.57%). Diversity of land snail species was higher in lower elevations (Mean value of Margalef Diversity in Illukkumbura: 2.422, Mahalakotuwa: 2.099). Diversity was lower in higher elevations (Atanwala: 1.309, Pitawala: 1.018). There was a significant difference between soil temperatures (p = 0.038), air temperatures (p = 0) and relative humidities (p =0.035) among the four study sites. In the sites with highest diversity, soil temperature ranged between 220C -24 0C and air temperature between 210C-260C. But there was no significance difference in the soil pHs (p =0.282) which ranged between 6.1-7.9 and depth of leaf litter (p=0.103) which ranged between 1cm-3cm among the four study sites. There was no evident correlation between soil temperature/ air temperature/ relative humidity and the diversity of snails despite the presence of a significant difference of these three parameters among the four study sites. Information on the distribution of land snails is an important prerequisite for monitoring habitat quality."}