{"doi": "https://doi.org/10.1111/j.1365-2699.2011.02559.x", "year": 2011, "abstract": "Aim Predation is generally viewed as a factor that limits the distribution of animal prey species. However, in certain instances, such as seed dispersal, predation may enhance the dispersal capability of prey species. In a prior study, we found that land snails are preyed upon by the Japanese white-eye (Zosterops japonicus) and the brown-eared bulbul (Hypsipetes amaurotis) in the Ogasawara Islands. In this paper we provide experimental and field evidence indicating that land snails could potentially be dispersed through bird predation. Location Hahajima Island of the Ogasawara Islands in the western Pacific. Methods Experimentation was first performed to test whether the land snail Tornatellides boeningi could remain alive after being swallowed and passed through the bird digestive system. Next, in order to investigate the potential role of internal bird transport and dispersal of this snail, we investigated the relationship between the distribution of population genetic diversity in the snail and the regional geographical abundance of predatory birds. The population genetic structure of T. boeningi and isolation by distance were inferred with Arlequin. The association between nucleotide diversity in T. boeningi populations and population density of predators was examined using a generalized linear mixed model. We conducted a likelihood ratio test for the full model and for another model that removed the fixed effect. Results Of the 119 snails fed to Japanese white-eyes and 55 snails fed to brown-eared bulbuls, 14.3% and 16.4% of the snails, respectively, passed through the gut alive. Additionally, one snail gave birth to juveniles after emerging from a bird’s gut. Significant heterogeneity among the populations of T. boeningi on Hahajima was indicated using AMOVA; however, there was no evidence of isolation by distance. A positive correlation was found between levels of mitochondrial DNA variation among and within T. boeningi populations and the density of Japanese white-eyes in the wild. Main conclusions Bird predation appears to be a method of dispersal for T. boeningi, and our results suggest that bird-mediated dispersal plays a role in land snail population structure."}