{"doi": "https://doi.org/10.1002/aqc.2474", "year": 2014, "abstract": "Abstract The highest worldwide diversity of snails in the family Pleuroceridae (Caenogastropoda) is found in the Mobile River Basin, Alabama, USA. Here 76 species of pleurocerids have been described and 31 species are now considered extinct due primarily to impoundments in the Alabama River Basin. Of the major basins, only the mainstem of the Cahaba River remains free‐flowing and so provides a refuge for pleurocerid diversity. Using collections, descriptions, and museum vouchers, the impact of changing land‐use on pleurocerid diversity was explored in the Cahaba River Basin. Decadal scale (10 to 20 years) and century scale (70 to100 years) changes in snail diversity within the Cahaba River were determined using information on species distributions based on historical (1880–1940) collections and from 1992, and 2005–2006 surveys. Before 1940, 20 species of pleurocerid snails were reported from the basin, but in 1992 and 2005–2006, only 15 species were recovered. Conversion of the lower portion of the Cahaba River Basin from forest to agriculture before 1940, followed by silviculture and severe downcutting of the channel from headcutting, may have caused the loss of these species. However, two species historically recorded in the basin are thought to be erroneous identifications and reflect the necessity of a complete taxonomic revision of this group. No basin‐wide changes in species richness and composition were detected between 1992 and 2005. Declines in richness among several reaches, however, resulted in the population fragmentation of five species which were reflected in differences in mean richness at the catchment scale. A significant, negative relationship between richness and urban cover between surveys best explained species losses. Despite taxonomic difficulties, these results indicate that land‐use conversion during the last century has had significant, adverse effects on pleurocerid diversity. Continued threats are expected given the projections of increasing human population density for the south‐eastern USA which may lead to further land‐use alterations and instream modifications. Copyright © 2014 John Wiley &amp; Sons, Ltd."}