{"doi": "https://doi.org/10.1111/j.1365-2699.2010.02424.x", "year": 2010, "abstract": "Aim The term relict refers to a formerly widespread species currently occurring in refugia that provide a persistent combination of specific ecological conditions. In peatlands, direct palaeoecological evidence of relict status exists for some plant species and, in the case of calcareous sediments, for some snail species. We tested whether some species are significantly linked to old calcareous fens at the millennial scale independent of the effect of recent fen area. We focused on three organism groups – vascular plants, bryophytes and land snails – that differ in the degree of preservation of their remains in calcareous fen sediments and in their dispersal ability. Location Western Carpathians (Slovakia and the Czech Republic). Methods The sample sites comprised 47 well-preserved calcareous fens, from which we compiled complete recent species lists, measured the area and analysed radiocarbon-dated samples from the deepest sediment and from the beginning of complete deforestation, as indicated by plant and snail fossils. Using the species co-occurrences in large data sets, we identified calcareous fen specialists and compared their recent distribution patterns against a null model that controlled for the effect of fen area. Results Two land snail species, eleven vascular plant species and no bryophyte species have statistically significant affinities with old fens, independent of the effect of recent fen area. For one bryophyte and one snail, the effects of age and area are not distinguishable. Main conclusions The results for land snails, being abundantly preserved and easily determinable in calcareous fen deposits, are in full accordance with the direct macrofossil evidence. This suggests that our approach indirectly revealed a relict distribution of the species. Identification of species that are significantly linked to ancient localities at the millennial scale has great potential in palaeoecology for the detection of stands with old sediments, and in nature conservation as a tool for the identification of long-term-persisting rare species that infrequently colonize young sites and thus deserve priority in the protection of their habitats. From a theoretical perspective, limited dispersal from old to new localities of the same habitat can contribute to spatial effects in biotic assemblages, even at relatively fine scales."}