{"doi": "https://doi.org/10.1111/j.1365-2699.2005.01275.x", "year": 2005, "abstract": "Abstract Aim Species richness is an important feature of communities that varies along elevational gradients. Different patterns of distribution have been described in the literature for various taxonomic groups. This study aims to distinguish between species density and species richness and to describe, for land snails in south‐eastern France, the altitudinal patterns of both at different spatial scales. Location The study was conducted on five calcareous mountains in south‐eastern France (Etoile, Sainte Baume, Sainte Victoire, Ventoux and Queyras). Methods Stratified sampling according to vegetation and altitude was undertaken on five mountains, forming a composite altitudinal gradient ranging from 100 to 3100 m. Visual searching and analysis of turf samples were undertaken to collect land snail species. Species density is defined as the number of species found within quadrats of 25 m 2 . Species richness is defined as the number of species found within an elevation zone. Different methods involving accumulation curves are used to describe the patterns in species richness. Elevation zones of different sizes are studied. Results Eighty‐seven species of land snails were recovered from 209 samples analysed during this study. Land snail species density, which can vary between 29 and 1 species per 25 m 2 , decreases logarithmically with increasing altitude along the full gradient. However, on each mountain separately, only a linear decrease is observable. The climatic altitudinal gradient can explain a large part of this pattern, but the great variability suggests that other factors, such as heterogeneity of ground cover, also exert an influence on species density. The altitudinal pattern of species richness varies depending on the spatial resolution of the study. At fine resolution (altitudinal zones of 100 m) land snail species richness forms a plateau at altitudes below 1000 m, before decreasing with increasing altitude. At coarse resolution (altitudinal zones of 500 and 1000 m) the relationship becomes linear. Main conclusions This study reveals that land snail species density and land snail species richness form two different altitudinal patterns. Species density exhibits strong variability between sites of comparable altitude. A large number of samples seem necessary to study altitudinal patterns of species density. Species density decreases logarithmically with increasing altitude. Above a critical altitudinal threshold, this decrease lessens below the rate seen in the first 1500 m. Different methods exist to scale‐up species density to species richness but these often produce different patterns. In this study, the use of accumulation curves has yielded a pattern of species richness showing a plateau at low altitude, whereas simple plotting of known altitudinal ranges from single mountains would have produced stronger mid‐altitudinal peaks. This study shows that not only factors such as temperatures and habitat heterogeneity, but also an ecotone effect, are responsible for the observed patterns."}