{"doi": "https://doi.org/10.1046/j.1365-2699.2001.00606.x", "year": 2008, "abstract": "Aims\r\nTo (1) describe the distribution patterns of land-snails occurring in afromontane forest habitats on Mount Kenya, in relation to elevation and aspect; (2) explore the relations between the land-snail faunas and environmental conditions within the forests.\r\n\r\nLocation\r\nMount Kenya, Kenya.\r\n\r\nMethods\r\nMolluscs were sampled using standardized direct search and litter sieving methods in a total of sixty-four replicated plots along four elevational transects spanning an altitudinal range from 1782 to 2851 m on the east, west, south and north-northwest sides of Mount Kenya. Elevation, vegetation type, forest structure, soil calcium, soil pH, mean annual rainfall and other environmental variables were measured on each plot. Correlation and joint regression analysis, and canonical correspondence analysis (CCA) were used to relate snail diversity and abundance, and faunal composition, to site elevation and other environmental variables.\r\n\r\nResults\r\nSixty-eight mollusc species were recorded during the study with transect totals between thirty-four and fifty-three species. Mean number of species and mean snail abundance ranged from 6.75 to 23.0 and 19 to 348 per plot, respectively. Overall, species richness and Shannon diversity index declined with increasing elevation. Snail abundance declined with increasing altitude along three transects and was positively related to soil pH and soil calcium, but species richness was not. Several species exhibited clear altitudinal distribution patterns. Mean annual rainfall varies greatly around the mountain and tends to decrease with altitude over the elevational range studied. Soil calcium and pH were negatively related to annual rainfall. Estimated mean annual rainfall accounted for the greatest variation in the mollusc fauna around the mountain. Faunas in forests on the drier, western side of Mount Kenya contained higher numbers of species in families that are characteristic of temperate latitudes, whereas tropical families were more prevalent on the wetter, south and east sides.\r\n\r\nMain conclusions\r\nLand-snail diversity in Mount Kenya’s forests declines with elevation and thus follows the widespread pattern shown by most groups of organism. However, faunal variation appears to be more closely related to rainfall levels, than to altitude per se or the other environmental variables examined. The effects of rainfall on snails could either be direct, or indirect via its effects on soils or vegetation, but the study suggests that direct effects are more important. Indirect effects mediated by changes in soil chemistry appear to be less important because lower altitude sites with more strongly leached and acidic soils tend to have richer and more abundant snail faunas. The reason for the association of temperate latitude mollusc families with forests on the drier, western sides of the mountain is not clear. The number of mollusc species present in Mount Kenya’s forests is broadly comparable with that reported elsewhere in East African forests. However, overall, the data from this study and elsewhere in East Africa may provide tentative evidence for a maximum level of land-snail richness at intermediate elevations of about 1000–1500 m."}