{"doi": "https://doi.org/10.1046/j.1365-2699.2003.01005.x", "year": 2004, "abstract": "Abstract Aim The objectives were to (1) analyse the combined effects of soil pH, Ca content and soil moisture on total density and species richness of land snails in forest ecosystems, (2) explore relationships between the quantitative composition of snail assemblages and habitat characteristics, (3) investigate the relationships between soil pH and density of some of the most frequent species, and (4) compare the data with those from studies conducted in other temperate‐humid regions of Europe. Location Study sites were selected from 15 landscape types including different lithologies within the area of Baden‐Württemberg (35,000 km 2 ), SW Germany. Methods Snails were recorded quantitatively from 83 study sites, with four plots representing a total of 0.25 m 2 per site. Topsoil samples from each site were analysed for pH, exchangeable Ca, and Ca content of carbonates. Three categories of soil moisture (dry, intermediate and wet) were established and defined according to the (climatic) water balance. Numbers of individuals and species were brought in relation to soil moisture and soil pH. Cluster analyses were conducted to identify groups of quantitatively similar snail species assemblages. Results Topsoil pH (2.7–7.5) and soil Ca contents were closely correlated. On dry soils, total snail density and species richness are generally low and do not change with pH, but clearly increase with increasing pH on intermediate moisture soils and on wet soils. On the latter, numbers of individuals and species are generally much higher compared with intermediate moisture sites at the same value of soil pH. Changes of density in relation to soil pH vary between species. Depending on the species, density increases only in the lower or only in the higher range of pH, is not related to pH, or decreases with increasing pH. Furthermore, these patterns vary within the same species depending on the region. This became evident from comparisons with other studies, particularly between sites in SW Germany and southern Scandinavia. From cluster analyses, subgroups of snail assemblages of high quantitative similarity were identified. Group formation is explained by soil pH to some extent, and one subgroup showed a connection with coniferous woodland sites on acidic soils. No further environmental factors available from our data could explain the clustering of snail assemblages more detailed. Main conclusions Soil moisture is the strongest determinant of snail density and species richness at undisturbed woodland sites, but effects of soil moisture and soil pH on these patterns are closely interrelated on intermediate moisture soils and wet soils. However, the quantitative species composition of the land snail assemblages is related to soil properties to a lower degree than snail density and species richness, and other habitat characteristics such as vegetation or litter quality, can be important for species dominance in addition."}