{"doi": "https://doi.org/10.1111/j.1523-1739.2010.01457.x", "year": 2010, "abstract": "Abstract: The influence of non‐native species on native ecosystems is not predicted easily when interspecific interactions are complex. Species removal can result in unexpected and undesired changes to other ecosystem components. I examined whether invasive non‐native species may both harm and provide refugia for endangered native species. The invasive non‐native plant Casuarina stricta has damaged the native flora and caused decline of the snail fauna on the Ogasawara Islands, Japan. On Anijima in 2006 and 2009, I examined endemic land snails in the genus Ogasawarana. I compared the density of live specimens and frequency of predation scars (from black rats [Rattus rattus] ) on empty shells in native vegetation and Casuarina forests. The density of land snails was greater in native vegetation than in Casuarina forests in 2006. Nevertheless, radical declines in the density of land snails occurred in native vegetation since 2006 in association with increasing predation by black rats. In contrast, abundance of Ogasawarana did not decline in the Casuarina forest, where shells with predation scars from rats were rare. As a result, the density of snails was greater in the Casuarina forest than in native vegetation. Removal of Casuarina was associated with an increased proportion of shells with predation scars from rats and a decrease in the density of Ogasawarana. The thick and dense litter of Casuarina appears to provide refugia for native land snails by protecting them from predation by rats; thus, eradication of rats should precede eradication of Casuarina. Adaptive strategies, particularly those that consider the removal order of non‐native species, are crucial to minimizing the unintended effects of eradication on native species. In addition, my results suggested that in some cases a given non‐native species can be used to mitigate the impacts of other non‐native species on native species."}