{"doi": "https://doi.org/10.1111/bor.12133", "year": 2015, "abstract": "Knowledge of present‐day communities and ecosystems resembling those reconstructed from the fossil record can help improve our understanding of historical distribution patterns and species composition of past communities. Here, we use a unique data set of 570 plots explored for vascular plant and 315 for land‐snail assemblages located along a 650‐km‐long transect running across a steep climatic gradient in the Russian Altai Mountains and their foothills in southern Siberia. We analysed climatic and habitat requirements of modern populations for eight land‐snail and 16 vascular plant species that are considered characteristic of the full‐glacial environment of central Europe based on (i) fossil evidence from loess deposits (snails) or (ii) refugial patterns of their modern distributions (plants). The analysis yielded consistent predictions of the full‐glacial central European climate derived from both snail and plant populations. We found that the distribution of these 24 species was limited to the areas with mean annual temperature varying from −6.7 to 3.4 °C (median −2.5 °C) and with total annual precipitation varying from 137 to 593 mm (median 283 mm). In both groups there were species limited to areas with colder and drier macroclimates (e.g. snails Columella columella and Pupilla loessica , and plants Kobresia myosuroides and Krascheninnikovia ceratoides ), whereas other species preferred areas with relatively warmer and/or moister macroclimates (e.g. snails Pupilla turcmenica and P. alpicola , and plants Artemisia laciniata and Carex capillaris ). Analysis of climatic conditions also indicated that distributional shifts of the studied species during the Pleistocene/Holocene transition were closely related to their climatic tolerances. Our results suggest that the habitat requirements of southern Siberian populations can provide realistic insights into the reconstruction of Eurasian, especially central European, glacial environments. Data obtained from modern populations also highlight the importance of wet habitats as refugia in the generally dry full‐glacial landscape."}