{"doi": "https://doi.org/10.1046/j.0305-0270.2003.01011.x", "year": 2003, "abstract": "Abstract Aims To assess the impact of various fire regimes over the past 30 years on land snail communities and to analyse the role of recent landscape history and the influence of biogeography in shaping the response patterns of gastropod communities following disturbances by fire. Location South‐eastern France (Provence) and Mediterranean region. Methods Stratified sampling within 12 sites was undertaken with regard to fire regime (i.e. number of fires, fire intervals and age of the last fire) occurring over the past 30 years. The study was complemented by a historical analysis using aerial photographs, old maps of vegetation cover and an analysis of the biogeographical composition of malacofaunas. Data were investigated using Correspondence Analysis and Sørensen coefficient of similarity. Results When a disturbance regime (land use or fire disturbances) has been maintained over decades or centuries, land snail communities appear highly modified and tend to be composed of only Mediterranean and xerophilous species. However, low fire regimes, since the 1970s, do not seem to greatly affect the composition of gastropod communities. Indeed, shade‐loving, mesophilous and European range species persist even after successive fires within some sites. In addition, the malacofaunas have a higher component of European range species with increasing distance from the Mediterranean sea. Main conclusions Analysis of the response patterns of gastropod communities to fire shows a response to numerous different factors. The composition of current land snail communities is not only the result of (more or less) recent patterns of fire regimes but also of anthropogenic disturbances, of landscape changes over the last centuries and of subsequent structure of the pre‐fire habitat, as well as of the influence of a biogeographical gradient. However, the response patterns observed and the persistence of pre‐fire communities imply the presence of cryptic refuges located within burned areas."}