{"doi": "https://doi.org/10.1242/jeb.154.1.321", "year": 1990, "abstract": "ABSTRACT Pyruvate kinase (PK) from tissues of the desert snail Otala lactea (Müller) undergoes a stable modification of its kinetic properties during estivation or in response to anoxia stress. In foot muscle and mantle, the kinetic changes induced by either state were virtually identical and were consistent with a less active enzyme form in estivation or anoxia: S0.5 PEP increased, and I50 values for Mg-ATP and L-alanine decreased, compared to the enzyme in control (aroused) snails. Estivation and anoxia also changed the properties of PK from hepatopancreas; some changes were consistent with a more active enzyme form (S0.5 PEP decreased, I50 values for Mg-ATP and L-alanine increased) but the enzyme lost all sensitivity to the potent activator fructose-l,6-bisphosphate. A time course of changes in I50 Mg-ATP for foot PK and S0.5 PEP for hepatopancreas PK revealed that estivation-induced changes in enzyme properties occurred between 12 and 48 h after snails were deprived of access to food and water, whereas the reversal of these changes occurred within as little as 10 min in foot muscle after arousal was initiated. The molecular basis of the stable modification of PK kinetics appears to be reversible protein phoshorylation. The action of added cyclic-AMP-dependent protein kinase on foot or hepatopancreas PK from control (aroused) snails changed PK kinetic parameters to those characteristic of the enzyme form in estivating animals; the addition of stimulators of endogenous cyclic-GMP-dependent protein kinase or protein kinase C had the same effect. Conversely, treatment with added phosphatases reconverted the properties of foot muscle PK from estivating snails to those characteristic of the control enzyme. The data suggest that reversible phosphorylation control over the activity state of regulatory enzymes of glycolysis is one mechanism contributing to the overall metabolic rate depression of the estivating state."}