{"doi": "https://doi.org/10.1371/journal.pone.0070662", "year": 2013, "abstract": "The ability of organisms to perform at different temperatures could be described by a continuous nonlinear reaction norm (i.e., thermal performance curve, TPC), in which the phenotypic trait value varies as a function of temperature. Almost any shift in the parameters of this performance curve could highlight the direct effect of temperature on organism fitness, providing a powerful framework for testing thermal adaptation hypotheses. Inter-and intraspecific differences in this performance curve are also reflected in thermal tolerances limits (e.g., critical and lethal limits), influencing the biogeographic patterns of species’ distribution. Within this context, here we investigated the intraspecific variation in thermal sensitivities and thermal tolerances in three populations of the invasive snail Cornu aspersum across a geographical gradient, characterized by different climatic conditions. Thus, we examined population differentiation in the TPCs, thermal-coma recovery times, expression of heat-shock proteins and standard metabolic rate (i.e., energetic costs of physiological differentiation). We tested two competing hypotheses regarding thermal adaptation (the “hotter is better” and the generalist-specialist trade-offs). Our results show that the differences in thermal sensitivity among populations of C. aspersum follow a latitudinal pattern, which is likely the result of a combination of thermodynamic constraints (“hotter is better”) and thermal adaptations to their local environments (generalist-specialist trade-offs). This finding is also consistent with some thermal tolerance indices such as the Heat-Shock Protein Response and the recovery time from chill-coma. However, mixed responses in the evaluated traits suggest that thermal adaptation in this species is not complete, as we were not able to detect any differences in neither energetic costs of physiological differentiation among populations, nor in the heat-coma recovery."}