{"doi": "https://doi.org/10.1016/s0016-7037(02)00824-4", "year": 2002, "abstract": "Variations of stable isotopic ratios of carbon (13C/12C) and oxygen (18O/16O) were investigated in modern shells of two species of Rabdotus land snails (R. dealbatus and R. alternatus) in the southern Great Plains. Geographic variation in relation to climate and vegetation, microgeographic variation, variability among individuals, and detailed records of seasonal variations within individual shells were studied. Stable carbon isotopic ratios in shell carbonate are primarily a function of the isotopic composition of the diet of the snails, as represented by the isotopic composition of shell organic matter. This in turn reflects the presence or absence of CAM (Crassulacean Acid Metabolism) or C4 plants. Vegetation density may have a small effect on the carbon isotope ratios. Microgeographic variation (samples within 25 to 300 m) is greater than that seen across different climatic regions and points to very local control of isotopic variations, predominantly related to vegetation. Seasonal variations, as assessed through serial analysis of individual shells (up to 35 samples per shell), may provide a means for distinguishing between isotopic influences of perennial CAM vs. annual C4 plants. Carbon isotopic variations in time-series of shells from a site provide a means of reconstructing temporal changes in environment and climate. Oxygen isotopic values of shell carbonate are uniform across the region and also show no significant microgeographic variation. The oxygen isotopic composition appears to be mainly a function of the rainwater isotopic composition, with no direct influence of rainfall amount or evaporative effects. The δ18O values are only 2‰ enriched relative to estimated equilibrium with rainwater. Variability is low (SD of 0.8‰ among sites), so the isotopic composition of fossil Rabdotus shells can provide a precise record of changes in the isotopic composition of rain over time."}