{"doi": "https://doi.org/10.1016/s1040-6182(00)00008-2", "year": 2000, "abstract": "Stable carbon isotope ratios of shell carbonate and shell organic matter from land snails (Rabdotus alternatus) from Hinds Cave, Texas, are used to reconstruct the climate history of the drier western part of the southern Great Plains (present mean annual rainfall of 400 mm) over the last ca. 5000 yr. AMS radiocarbon analyses of four individual shells from each of two strata indicate that there are no problems of reworking or age mixtures within strata. However, burning is evident in many shells. Amino acid composition and racemization were used to identify shells that had been significantly heated and these were rejected for isotopic analysis because of possible alteration of the isotopic signal. Fourteen samples of snails from Hinds Cave, each consisting of 2–6 individual shells from the same provenience, were radiocarbon dated by AMS and analyzed for stable carbon isotopes. In addition, a sample collected alive ca. AD 1890 from a nearby site, was analyzed to represent modern conditions. The shells show no decrease in organic content with age, indicating good preservation of shell organic matter. Both the organic and carbonate isotope values show similar temporal trends. The oldest samples (4100–4600 cal yr BP) are relatively depleted in 13C. Maximum δ13C values are reached at ca. 3500 cal yr BP. Thereafter there is a regular depletion in 13C, with the recent sample showing the lowest δ13C value. The change in the isotopic values over time is quite large (range of 4.5‰ for organic matter) and indicates substantial climatic changes. The variations in isotopic values are interpreted as resulting primarily from changes in moisture conditions, affecting the abundance of drought-adapted CAM (Crassulacean acid metabolism) plant species (enriched in 13C). Thus relatively moist mid-Holocene conditions are indicated, with increasingly dry conditions reaching a maximum at ca. 3500 cal yr BP, followed by progressively moister conditions through the late Holocene."}