{"doi": "https://doi.org/10.1163/156853986x00351", "year": 1986, "abstract": "[The crawling behaviour of individual Arianta arbustorum (L.) from a midland and an alpine site was compared on an increasingly inclined surface at two temperatures in the laboratory. Due to a negative geotactic response, A. arbustorum tends to move upward when placed on inclined surfaces. At 24째C, snails from the midlands showed a better accuracy of upward orientation than snails from the mountains, while at 16째C no difference was detectable. Snails from the midlands moved larger distances in three minutes than did those from the mountains. This might be due to the larger size of the midland snails. The distances covered in three minutes depended on the temperature and on the inclination of the surface and varied between individual snails. In repeated trials, individual snails showed consistent differences in dispersal behaviour, ranging from sedentariness to strong dispersal tendency. Such behaviour patterns are strengthened in alpine snails: individuals from the mountains-where the environment varies relatively more in time and space-were more variable in terms of movement patterns than snails from the midlands, where the environment is more homogeneous and stable., The crawling behaviour of individual Arianta arbustorum (L.) from a midland and an alpine site was compared on an increasingly inclined surface at two temperatures in the laboratory. Due to a negative geotactic response, A. arbustorum tends to move upward when placed on inclined surfaces. At 24째C, snails from the midlands showed a better accuracy of upward orientation than snails from the mountains, while at 16째C no difference was detectable. Snails from the midlands moved larger distances in three minutes than did those from the mountains. This might be due to the larger size of the midland snails. The distances covered in three minutes depended on the temperature and on the inclination of the surface and varied between individual snails. In repeated trials, individual snails showed consistent differences in dispersal behaviour, ranging from sedentariness to strong dispersal tendency. Such behaviour patterns are strengthened in alpine snails: individuals from the mountains-where the environment varies relatively more in time and space-were more variable in terms of movement patterns than snails from the midlands, where the environment is more homogeneous and stable.]"}