{"doi": "https://doi.org/10.1080/03014223.1981.10427971", "year": 1981, "abstract": "Abstract Surveys for land snails of several bush patches on or near the Manukau Peninsula, southwest of Auckland, resulted in finding up to 60 species (only 3 introduced) in a single 4 ha patch of bush. Analysis of records from all bush patches suggests that an essentially sympatric community of about 72 native species is a probable reality, whereas in most areas of the world the sympatric existence of more than 15 land snail species is highly unusual. A first attempt at indicating the moisture, space, and foraging preferences of the 89 land snail species recorded from the Manukau Peninsula is presented, and an attempt is made to indicate broad categories of species association or habitat preference within this area. Many species occur throughout litter types (40–75% of all species in one bush patch would be in a 20 × 30 cm bag of litter from one spot), and it is hypothesised that the qualities of moisture retention and air space are more significant to the snails than the species of plant that provided the litter. This sympatric land snail diversity is normal from the central North Island up into Northland, but diversity levels drop sharply in the far north and southward from Mt Egmont/East Cape. Most of the South Island has 15–20 sympatric land snail species, with even greater reduction on Stewart Island and the subantarctic islands. It is hypothesised that the high sympatric diversity level reached in the Manukau area results from equability of the moisture regime. This diversity is based in accumulation of phyletically unrelated taxa, not localised speciation. The land snail population here has the aspect of a mature community. Even few-hectare patches of bush can hold near maximum land snail communities, if they are protected against burning, clearing, and trampling of the litter by stock. The preservation of such patches is urged, for the conservation not only of the land snails but of the other soil micro-organisms that coexist. Keywords: Gastropodaland snailsspecies diversitysympatrynative bushrelictual habitatManukau Peninsulaspecies listspopulation structure"}