{"doi": "https://doi.org/10.5733/afin.051.0101", "year": 2010, "abstract": "Natalina sensu lato includes some of the largest carnivorous snails in the world and represents an important African radiation of the Gondwanan land snail family Rhytididae. It comprises the taxa Natalina, Afrorhytida and Capitina, all three of which we treat as full genera. We provide a comprehensive revision of each genus, and update the species-level taxonomy extensively in the light of new molecular and morphological data. Detailed comparative morphological observations are provided for the distal reproductive tract (including spermatophores for the first time in this family), pulmonary cavity, mantle edge, radula and suprapedal gland. In addition, we present a summary of biological and ecological data including information on habitat preferences, feeding, prey and mating behaviour. Although the genera are well circumscribed in terms of both morphological and molecular data, morphology is usually highly conserved within genera. Yet surprising cryptic diversity is evident within the described species and restricted-range endemism is more frequent than was previously thought, with significant implications for conservation. The widespread common cannibal snail, Natalina cafra (Férussac, 1821), is shown to comprise four cryptic, allopatric lineages. For the most part, we recognise this cryptic diversity at the level of subspecies. In some cases where populations from disjunct, lime-rich habitats exhibit a significantly different shell morphology, it is difficult to evaluate whether and to what extent this is genetically or environmentally determined. Spermatophores exhibit considerable phylogenetically consistent morphological variation and may eventually prove to be an important source of new taxonomic characters. The geographic distributions of the respective lineages are interpreted in the light of phylogenetic data, current regional vegetation patterns, and historical environmental phenomena, so as to identify biogeographic trends. Some lineages are clearly forest-associated specialists and have fragmented, narrowly-endemic distributions resulting from cyclical changes in forest cover during the Plio-Pleistocene, but there is also strong evidence for regional endemism associated with other vegetation types, notably Albany Thicket. Observations on the conservation status of all taxa are provided.New subgenus: Natalina (Tongalina). New species: Afrorhytida burseyae, Capitina calcicola. New subspecies: Afrorhytida kraussi oraria, Natalina cafra amathole, Natalina cafra natalensis, Natalina quekettiana dracomontana, Natalina quekettiana lucaris, Natalina quekettiana montistempli. New synonyms: Natalina compacta Connolly, 1939 = Natalina cafra cafra (Férussac, 1821); Natalina coerneyensis Melvill & Ponsonby, 1894 and Natalina insignis Melvill & Ponsonby, 1907 = Afrorhytida knysnaensis (Pfeiffer, 1846); Natalina liliacea Preston, 1912 = Afrorhytida kraussi kraussi (Pfeiffer, 1846); Natalina arguta Melvill & Ponsonby, 1907 = Afrorhytida trimeni Melvill & Ponsonby, 1892. Revised status: Helix (Aerope) eumacta Melvill & Ponsonby, 1892 is considered a subspecies of Natalina cafra (Férussac, 1821). Lectotypes designated for Aerope beyrichi Martens, 1890 [= Natalina] and Helix schärfiae Pfeiffer, 1861 [= Capitina schaerfiae]."}