{"doi": "https://doi.org/10.1111/j.1365-2656.2008.01478.x", "year": 2008, "abstract": "1. The fragmentation of natural habitats is generally considered to be a major threat to biodiversity. Different species may respond differently to habitat fragmentation, depending on species-specific traits such as body size, dispersal ability, mating system, and habitat requirement. 2. The population sizes, extinction and recolonization frequencies of six naturally occurring land snail species (Cochlicopa lubrica, Vertigo pygmaea, Pupilla muscorum, Punctum pygmaeum, Helicella itala, and Trichia plebeia) were examined over 3 years in an experimentally fragmented nutrient-poor, calcareous grassland in the northern Swiss Jura mountains using a mark-recapture technique. Fragments of different size (0.25 m(2), 2.25 m(2), and 20.25 m(2)) were isolated by a 5-m wide strip of frequently mown vegetation. Control plots of corresponding size were situated in adjacent undisturbed grassland. 3. Experimental grassland fragmentation influenced the population size in all snail species except H. itala, which is the species with the biggest shell and it is also active under mild conditions in winter. However, fragmentation affected different species to a different extent. 4. Extinction (= disappearance from a plot) frequency increased with time, decreasing population size and decreasing plot size in all species. Large populations had a lower extinction probability than small populations. Fragmentation increased the probability of extinction, which also differed among snail species. The effect of plot size on extinction probability was still significant even after the effect of population size had been taken into account. 5. Fragments and control plots did not differ in recolonization frequencies when all six species were considered. However, fragmentation influenced recolonization frequency when the two species with large shells (H. itala and T. plebeia) were excluded from the analysis. 6. Our study shows that small-scale grassland fragmentation affects different land snail species to a different extent. This finding strengthens the claim for multi-species approaches to obtain general predictions of fragmentation impact."}