{"doi": "https://doi.org/10.1093/sysbio/23.4.518", "year": 1974, "abstract": "Cerion displays an extraordinary range of phenetic diversity. This has led to the naming of several hundred species, though only a mere fraction of these are valid if, as we believe, morphological diversity does not reflect reproductive isolation in this genus. The taxonomic morass has precluded fruitful evolutionary study of these extremely plastic animals. We apply techniques of multivariate morphometrics and biochemical genetics to a local situation on the northeastern coast of Great Abaco, Bahamas. Here, a local population is semi-isolated along a strip of coastline near the settlement of Pongo Carpet; it is in contact with other populations only to the north. Its morphology is highly distinct and, on all previous criteria, it merits recognition as a separate species. We find, however, that its patterns of covariation (as revealed by factor analysis) cannot be distinguished from those of the only recognized taxon of northern Abaco, C. bendalli(while patterns in the southern Abaconian species, C. abacoense, are entirely different). Canonical analysis displays a cline towards standard morphology from the region of maximum isolation at Pongo Carpet to the northern area of potential contact with standard C. bendalli. Levels of morphological variation do not differ among samples; those of intermediate morphology show no increase in variability or other signs of hybridization. Starch-gel electrophoresis showed the pongo carpet samples to be genetically indistinguishable from standard bendalli at the 18 structural gene loci surveyed. No evidence for selfing or inbreeding was detected. The proportion of polymorphic loci in each population ranged between 16.6–22.2%; genie heterozygosity per individual was 5.25–6.79%. The only genetic “anomaly” within the area contrasts some standard and pongo carpet samples with C. bendalli from elsewhere on Abaco and Grand Bahama Island. We conclude that the pongo carpet population is a well-marked geographic variant within Cerion bendalli. The coordinated application of biochemical genetics and multivariate morphometrics can resolve many issues in the systematics of highly variable organisms."}