{"doi": "https://doi.org/10.1016/j.chemgeo.2008.01.008", "year": 2008, "abstract": "Stable isotopes of oxygen and carbon extracted from fossil land snail shells have been used increasingly to interpret past environments. To evaluate the utility of this approach for low-latitude oceanic islands, populations of the modern helicid land snail Theba geminata – a species also abundant in the Quaternary fossil record of the region – were sampled at ten low altitude (< 300 m) sites from coastal areas of the eastern Canary Islands. The results include stable isotopes of (1) 17 aragonite shells of live-collected adult snails; (2) 17 body tissue samples from the same snail individuals; (3) 10 samples of carbonate sediments; (4) 69 plant tissue samples representing all 24 identified species; and (5) 7 rain water samples. The mean isotopic composition of the rain water is − 5‰ (V-SMOW) for δD and − 2‰ (V-SMOW) for δ18O, ranging from − 11‰ to + 2‰ (V-SMOW) and from − 2.6‰ to − 0.7‰ (V-SMOW), respectively. The local vegetation is heterogeneous, including C3, C4, and CAM plants. δ13C values vary from − 13.0‰ to − 29.0‰ (V-PDB) across plant species. Of the 24 species, five are C4, 15 are C3, and four are CAM plants. The δ18O values for shells represent a narrow range of values (from − 0.3‰ to + 2.5‰ [V-PDB]), which is consistent with the low climate seasonality typifying low-latitude oceanic settings. Hypothetical model of the expected δ18O value for shell aragonite precipitated in equilibrium suggests that the most negative δ18Oshell represent the closest estimate for δ18Orain water. The δ13C values of shells range from − 9.4‰ to + 1.7‰ (V-PDB). The most positive δ13C values are attributed to a diet based on C4 plants. The comparison of δ13C values of soft tissues and shells suggests that snails ingested notable amounts (from ~ 20% up to ~ 40%) of foreign carbonates. Consequently, fossil shells with the most negative δ13C values should be selected for radiocarbon dating in future geochronological studies of the region. The δ13C values of body tissues vary from − 12.0‰ to − 27.2‰ (V-PDB), indicating that land snails consumed C3 and C4 plants indiscriminately. The mean carbon isotopic composition, averaged across multiple fossil specimens, may thus provide a useful tool for reconstructing paleoclimates and paleoenvironments throughout the Quaternary history of the Canary Islands and other comparable low-latitude oceanic settings."}