{"doi": "https://doi.org/10.1111/j.1096-3642.1986.tb01341.x", "year": 1986, "abstract": "The radiation of the endemic Jamaican land snail genus Sagda is examined through analysis of the comparative shell morphology, anatomy, ecology and biogeography of the four species inhabiting north-central Jamaica: S. centralissp. nov., S. spei, S. bondi and S. montegoensis. The species are all rather similar in their morphology and ecology. The shells show some differences in the presence or absence of internal lamellae, the position of the lamellae, the form of the depression in the centre of the base, the regularity of sculpture (low ribs) and the pattern of microsculpture. Slight differences in the form of the radular teeth are found between some species. The structure of the secondary ureter is peculiar: in all species it is open shortly behind the mantle collar, then branches into two closed tubes which open separately on the outside of the mantle collar. Despite its great complexity, the reproductive system is rather uniform among species; differences are seen in the number of pockets that form spines on the spermatophore. The complex, three-branched spermatophore is formed within the entire epiphallar branch of the penis, whereas the appendicular branch apparently assumes the copulatory function.\r\n\r\n\r\n\r\nWhen inactive, all species are found associated with rocks or, less commonly, among leaf litter. Activity occurs primarily at night and mostly on leaf litter rather than rocks. The snails eat dead plant material, including a variety of plant species. All species (with the possible exception of S. montegoensis) are ovoviviparous. They overlap broadly in the range of climates occupied. The geographic ranges of the four species are overlapping, although Sagda bondi has a parapatric distribution in relation to the western species S. grandis. Fossil and subfossil evidence shows that shifts in the ranges of the species have occurred in the late Quaternary; Pleistocene-Holocene environmental changes, habitat destruction by man, and possibly other environmental changes during historical times are probably involved. Radiations of other land snail groups on tropical islands have generally produced greater morphological and ecological differentiation than in Sagda. Allopatric or parapatric species distributions appear to be more common in other land snail radiations."}