{"doi": "https://doi.org/10.1111/j.1439-0469.2008.00488.x", "year": 2009, "abstract": "Based on a sequence fragment of mtDNA we analysed the genetic differentiation of the land snail Arianta arbustorum in the Alpine massif Gesäuse, where four morphotypes occur in close vicinity. We aimed at understanding actual and historical evolutionary processes among the morphotypes. With 135 haplotypes diverging up to 12.5%, genetic diversity was extremely high. Phylogenetic analyses indicated that A. arbustorum has colonized the Gesäuse several times in consecutive waves and that introgression of neutral markers across morphotypes and selection on shell shape have played an important role. Gene flow was more likely between locally close, different morphotypes than among distant populations of the same morphotype again indicating that cohesion of morphotypes was mainly due to selection. The actual distribution of morphotypes and haplotypes as well as the high genetic diversity also suggested that the area provided refugia during the Pleistocene glaciations. Wir analysierten die gentische Differenzierung der Landschnecke A. arbustorum in den Gesäusebergen der Alpen, wo vier Morphotypen in unmittelbarer Nachbarschaft vorkommen, basierend auf einem Fragment mitochondrieller DNS. Ziel war die Aufklärung der aktuellen und historischen evolutiven Prozesse zwischen den Morphotypen. Mit 135 Haplotypen, die um bis zu 12.5% divergierten, war die genetische Diversität extrem hoch. Phylogenetische Analysen zeigten, dass A. arbustorum das Gesäuse mehrfach in aufeinanderfolgenden Wellen besiedelt hat und dass Introgression neutraler Marker in andere Morphotypen und Selektion der Schalenform eine wichtige Rolle gespielt haben. Genfluss zwischen verschiedenen aber benachbarten Morphotypen war wahrscheinlicher als zwischen entfernten Populationen des selben Morphotyps, was ebenfalls auf die wichtige Rolle von Selektion für die Kohäsion der Morphotypen hinwies. Die aktuelle Verbreitung der Morphotypen und Haplotypen sowie die hohe genetische Diversität legten nahe, dass sich in dieser Region Eiszeitrefugien befunden haben. Figure S1. Thin-plate splines comparing mean landmarks of a pair of morphotypes. A, flat against intermediate shells; B, flat against globular shells; C, flat shells against A. a. picea; D, intermediate against globular shells; E, intermediate shells against A. a. picea; F, globular shells against A. a. picea. For clarity, vectors are depicted with an exaggeration of 2.0. Figure S2. Haplotype networks reconstructed using statistical parsimony with 95% connection limit. Numbers identify haplotypes. Rectangles represent inferred ancestral haplotypes, circles non-sampled haplotypes, and branches one mutational step each, regardless of length. Table S1. Localities of Arianta arbustorum and, below bold line, outgroup taxa. Ng, number of genetically analysed specimens (includes juveniles; sequenced/microsatellite if different); Ns, number of measured adult shells (includes empty shells). Two-letter acronyms with upper case initial indicate samples from Haase et al. (2003) included in the phylogenetic analysis; corresponding sample sizes are given in parentheses. Outgroup taxa are from Austria if not otherwise noted. Sequences of Helicigona lapicida were taken from Haase et al. (2003). For the population genetic analyses the following populations were pooled: gsp + gss = gse; hkg + hkh = hdk; hsl + hsu = hsg; hul + huu = hum; lbm + lhb + lth +ltr = leo; lgk + lgl = lng; pgl + pgu = peg. Samples with 3 or less specimens that were not pooled with other samples were omitted from these analyses (gsa, hke, kab, kig, rrs, scg, wbw). Hybrid populations were excluded, because they could not be attributed to a single morphotype (fes, gsi, kal, rsh). Please note: wiley-Blackwell are not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing material) should be directed to the corresponding author for the article. Please note: The publisher is not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing content) should be directed to the corresponding author for the article."}