{"doi": "https://doi.org/10.4002/040.053.0105", "year": 2010, "abstract": "We examine variation in species richness, species composition and distance decay in similarity in forest snail faunas from Poland and a small part of Transcarpathian Ukraine, and their connection with geographical position in relation to Pleistocene refugia. Forest faunas were sampled from sites of standard size in each of ten regions. Data were analysed using DCA and partial CCA, extracting the geographical, climatic and ecological correlates with the major axes. Relationships among site and regional faunas were further examined through the Simpson Index of Similarity. Site species richness shows no significant variation with geographical position or climate, but relates to soil and vegetation characteristics. Composition varies with location; southern highland faunas differ from one another far more than do northern lowland faunas, showing a clear east-to-west pattern of change. The aggregate highland fauna is richer than that of the lowlands, which is a subset of the former. Two intermediate upland regions show different associations, one with the highlands the other with the lowlands. Lowland faunas, even over large distances, are very similar, and all relate more closely to the western end of the highlands than to the east. Disaggregating the fauna into large and small species shows that the former show a stronger geographical pattern than the latter; most universally distributed species are small. Latitudinal variation in regional richness, and longitudinal differentiation among highland faunas relate to distance from glacial refugia. This is not reflected in site species richness, raising questions about the assembly rules for local faunas. The western bias in the relationships of lowland faunas to those of the highlands, the differences between large and small species and the varying rates of faunal turnover within the area studied suggest that patterns of post-glacial dispersal are complex and incompletely understood."}