{"doi": "https://doi.org/10.1016/0042-6989(68)90101-6", "year": 1968, "abstract": "Given equal choices of light (40 foot candles) and dark (0.13 foot candles) visual fields (elevation 30°, width 45°), the Moroccan land snail, Otala lactea, Mu¨ll., moves towards and enters dark fields. The wider the dark sector for a constant height, the more likely is the entry. Probability of entry changes monotonically proportional to width. Presented with a 45° dark sector in a surrounding ring of light, intact O. lactea differ highly significantly in locomotor behaviour from blinded specimens. They do not differ from specimens unilaterally blinded nor with crushed anterior tentacles. Anterior tentacles appear to have no photosensory function in this experimental setting. Camera lucida drawings of typical paths suggest O. lactea can orient with respect to a target as small as 221/2° × 30° at 25 cm distance. Pertinent literature is reviewed and discussed with emphasis on the issue of uncertainty in photic responses of several species of land snail. Si l'on offrea`l'escargot terrestre du Maroc, Otala lactea, Mu¨ll., des choixe´gaux entre champs visuelse´claire´s (40 foot candles) ou sombres (0,13 foot candle), les champs ayant 30° de hauteur et 45° de largeur, l'animal se de´place pour pe´ne´trer dans les champs obscurs. Plus large est le secteur sombre,a`hauteur constante, plus probable est l'entre´e. La probabilite´d'entre´e varie d'une fac¸on monotone avec la largeur. Si on lui pre´sente un secteur sombre de 45° dans un cercle environnant lumineux, O. lactea intact a un comportement locomoteur qui diffe`re d'une fac¸on hautement significative de celui d'animaux aveugle´s, mais ne diffe`re pas de celui d'animaux aveugle´s unilate´ralement ni de ceux dont one´crase les tentacules ante´rieurs. Les tentacules ante´rieurs ne semblent pas posse´der de fonction photosensorielle dans ces expe´riences. Le dessina`la chambre claire de trajets typiques sugge`re que O. lactea peut s'orienter,a`25 cm de distance, vers une cible aussi petite que 22,5° × 30°. On passe en revue la litte´rature sur ce sujet et on la discute en insistant sur l'incertitude dans les re´ponses photiques de diverses espe`ces d'escargot terrestre. Im Fall der Wahl zwischen einem dunklen (0,13 foot candles) und einem hellen (40 foot candles) Gesichtsfeld (Ho¨he 30°, Breite 45°), bewegt sich die marokkanische Landschnecke Otala lactea, Mu¨ll., in das dunkle Feld. Je breiter der dunkle Ausschnitt bei konstanter Ho¨he ist, umso wahrscheinlicher findet ein Eintritt statt. Die Eintrittswahrscheinlichkeita¨ndert sich monoton proportional zur Breite. Bei Darbietung eines dunklen 45° Sektors in einem umgebenden Lichtring verha¨lt sich die intakte O. lactea in ihrem Bewegungsverhalten signifikant verschieden im Vergleich zu blinden Exemplaren. Sie verha¨lt sich nicht anders als solche, die einseitig geblendet wurden oder denen die vorderen Fu¨hler zersto¨rt wurden. In diesem Experiment scheinen die vorderen Fu¨hler keine lichtempfindliche Funktion zu haben. Bestimmungen typischer Wege mit Hilfe eines Pausapparats lassen vermuten, daβ sich die O. lactea noch an einem Objekt von 221/2× 30° in 25 cm Entfernung orientieren kann. Die zugeho¨rige Literatur wird durchgesehen und im Hinblick auf das Auftreten von Unsicherheiten bei der Lichtreaktion verschiedener Arten von Landschnecken, diskutiert. Пpи oдиqnaкoвoй вoзмoзнocти выбopa cвeтлoгo (40 фyтo-cвeхeй) и тeмнoгo (0.13 фyтo-cвeхeй зpитeльнoгo пoля) выcoтa 30°, шиpинa 45°). Mapoккaнcкaя yлиткa (Otala lactea, Mu¨ll) двизeтcя пo нaпpaвлeнию и внyтpь тeмнoгo пoля. Бoлee шиpoкий тeмныи ceктop пpeдпoхитaeтcя для пepeмeщeния внyтpь нeгo. Bepoятнocть впoлзaния измeняeтcя мoнoтoннo пpoпopцнoнaльнo щиpинe. Ecли пpeдлaгaть тeмный ceктop в 45, oкpyзeнный cвeтлым кoльцoм, тo лoкoмoтopнoe пoвeдниe интaктнoй o. lactea в oхeнь знaхитeльнoй cтeпeни oтлихaeтcя oт пoвeдeния ocлeплeнных экзeмцляpoв. Ho oнo нe oтлихaeтcя oт пoвeдeния экзeмпляpoв ocлeплeнных мoнoлaтepaльнo или зe экзeмиляpoв c paзpyщeнными пepeдними щyпaльцaми. B этoй экcпepимeнтaльнoй cитyaции пepeдниe щyпaльцa. пoвидимoмy, нe oбнapyзивaют cвeтoхyвcтвитeльнoй фyнкции. Tипихecкиe пyти, нaхepхeнныe c пoмoщью пpoзpaхнoй кaмepы, зacтaвляют пpeдцoлaгaть, хтo o. lactea мoзeт opиeнтиpoвaтьcя пo oтнoщeнию oбъeктa paзмepaми в 221/2× 30° c диcтaнции в 25 cм. Дaeтcя кpитихecкий oбзop литepaтypы вoпpoca и пoдхepкивaeтcя, хтo имeeтcя нeoпpeдeлeннocть peзyльтaтoв иccлeдoвaний cвeтoвых peaкций нeкoтopых видoв пoлeвых yлитoк."}