{"doi": "https://doi.org/10.1111/j.1365-2699.2009.02136.x", "year": 2009, "abstract": "Abstract Aim The main aims of the study were: (1) to investigate the effect of fragment age in relation to other patch‐ and landscape‐scale measures of forest fragmentation, and (2) to assess the relative importance of fragmentation, habitat degradation (i.e. degradation caused by selective logging and past shifting cultivation) and putative pre‐existing species turnover in structuring current land‐snail assemblages. Location South‐western Sri Lanka. Methods The land‐snail fauna was sampled using standardized belt transects. Fifty‐seven transects were sampled in 21 lowland rain forest fragments ( c. 1–33,000 ha). The spatial arrangement of fragments in the study area was explicitly considered in an effort to take into account the non‐random nature of fragmentation and degradation and the possibility that current species composition may reflect patterns of species turnover that existed prior to fragmentation. The data set of 57 land‐snail species and 28 environmental and spatial variables was analysed using canonical correspondence analysis and partial canonical correspondence analysis. Results Fragment age, mean shape complexity (i.e. a landscape‐scale measure of shape complexity), altitude, and the spatial variables x (longitude), y (latitude) and y 2 explained significant variation in land‐snail species composition. None of the three nominal variables quantifying habitat degradation was significantly correlated with variation in species composition. The independent effects of fragment age and mean shape complexity were similar. The combined effect of the spatial variables alone was larger than the independent effects of fragment age, mean shape complexity or altitude, but was of the same order of magnitude. The total variation explained by the spatial variables was comparable to the total non‐spatial variation accounted for by fragment age, mean shape complexity and altitude. Main conclusions Fragment age was found to be one of only two key determinants (the other was shape complexity at the landscape scale) driving fragmentation‐related changes in community composition. The influence of pre‐fragmentation patterns of species turnover on assemblage structure can be stronger than the effects of fragmentation measures, such as age, and may override the effects of forest degradation. Thus, strong patterns of pre‐existing turnover may potentially confound interpretation of the effects of forest fragmentation and degradation."}