{"doi": "https://doi.org/10.1098/rstb.1996.0025", "year": 1996, "abstract": "A survey has been made of the land snail fauna of Porto Santo, Madeiran archipelago. Porto Santo is an isolated island about 12 km long by 5 km wide. The fauna is exceptionally species-rich and characterisied by radiations of species in several families, especially the Helicidae. Sixty-five samples from the mainland and five offshore islets yielded 56 species, 84% of them endemic, with a mean of 11.5 species per site, and marked regional differentiation in faunal composition. A given site produces on average only approximately one fifth of the number of species possible, equivalent to a value for Whittaker’s index of diversity of 4.5. Patterns of localization occur on the peaks to the east and west of the island, with numerous cases of replacement by congeneric and morphologically similar species. Local areas have assemblages of species differing in shell size and shape, which probably exploit different niches, the pattern in one area paralleling that in others. The low-lying sandy areas which separate these areas are now unfavourable to many endemic species; those which do occur in them tend to have island-wide distributions. Morphological variation in such species appears to have ecological rather than geographical correlates. We conclude that adaptive responses have occurred, but that much of the species richness can be interpreted as non-adaptive, that is, due to allopatric divergence in isolation by species which retain similar niches. Even on so small a land mass the topography is such that for many land molluscs it represents a cluster of refuges intermittantly connected through impermanent and often unfavourable sandy environments, on each of which evolution proceeds independently. Differences in distribution patterns between families probably arise because they evolved at different times in the island’s history. These results are compared with those from snail faunas in other parts of the world, some of which are similar to them."}