{"doi": "https://doi.org/10.1371/journal.pone.0075962", "year": 2013, "abstract": "Predation is often difficult to observe or quantify for species that are rare, very small, aquatic or nocturnal. The assessment of such species’ diet can be conducted using molecular methods that target prey DNA remaining in predators’ guts and faeces. These techniques do not require high taxonomic expertise, are applicable to soft-bodied prey and allow for identification at the species level. However, for generalist predators, the presence of mixed prey DNA in guts and faeces can be a major impediment as it requires development of specific primers for each potential prey species for standard (Sanger) sequencing. Therefore, next generation sequencing methods have recently been applied to such situations. In this study, we used 454-pyrosequencing to analyse the diet of Powelliphanta augusta, a carnivorous landsnail endemic to New Zealand and critically endangered after most of its natural habitat has been lost to opencast mining. This species was suspected to feed mainly on earthworms. Although earthworm tissue was not detectable in snail faeces, earthworm DNA was still present in sufficient quantity to conduct molecular analyses. Based on faecal samples collected from 46 landsnails, our analysis provided a complete map of the earthworm-based diet of P. augusta. Predated species appear to be earthworms that live in the leaf litter or earthworms that come to the soil surface at night to feed on the leaf litter. This indicates that P. augusta may not be selective and probably predates any earthworm encountered in the leaf litter. These findings are crucial for selecting future translocation areas for this highly endangered species. The molecular diet analysis protocol used here is particularly appropriate to study the diet of generalist predators that feed on liquid or soft-bodied prey. Because it is non-harmful and non-disturbing for the studied animals, it is also applicable to any species of conservation interest."}