{"doi": "https://doi.org/10.1098/rspb.1970.0039", "year": 1970, "abstract": "A study on the relative distributions of Cepaea nemoralis (L.), C. hortensis (M端ll) and Arianta arbustorum (L,), has been made in three areas on the Carboniferous Limestone of Derbyshire, the Wye valley, Matlock and Dovedale. Samples were made by collecting these species at a large number of sites in different habitats, and also by transects through selected areas. In all the areas studied, the proportion of A. arbustorum in the samples increases with in足creasing plant cover, and is greater on north- than on south-facing slopes. A . arbustorum is commonest, and occupies the widest range of habitats, in the western parts of the Wye valley, which has heavy rainfall. It becomes rarer and more restricted in drier areas farther east. Varia足tions in humidity rather than temperature appear to be the main factor affecting the distribu足tion of this species relative to Cepaea , with A.arbustorum preferring the wetter habitats. Other studies on distribution, survival and behaviour tend to support this conclusion. The proportion of C. nemoralis in Cepaea tends to increase with decreasing plant cover in all areas, but there are important exceptions. Short rough herbage has less C. nemoralis than would be expected from the plant cover, and open woodland has more. These two habitats, with the highest heterogeneity of plant cover within sampling sites, also have the highest proportion of samples containing both species of Cepaea , while the most uniform habitats have the least. This, and other differences of distribution between the three areas, suggest that some of the differences in the distributions of C. nemoralis and C. hortensis are due to competition between them. Although aspect and rainfall have little effect on species composition in Cepaea, C. hortensis predominates in wetter habitats, suggesting that humidity is also an important factor affecting distribution. The transects show that changes in species composition with habitat and aspect occur over short distances."}