{"doi": "https://doi.org/10.1590/s1984-46702011000200001", "year": 2011, "abstract": "Bradybaena similaris (Férussac, 1821), commonly known as the Asian trampsnail, is a terrestrial snail native to Asia, introduced in other regions of the world. In Brazil, populations of this land snail are distributed from the state of Amapá in the North to Rio Grande do Sul in the South. This species acts as an intermediate host for parasites and is a difficult-to-control agricultural pest as well, causing great losses to crops and ornamental plant cultivation. This land snail is easily reared in the laboratory and has been successfully used as a biological model in studies that aim at verifying molluscicidal effects of plant extracts. Several studies have demonstrated that B. similaris, like many other species of land and freshwater snails, is physiologically adapted to survival over transitory unfavorable environmental conditions. Moreover, this species seems to have a life history strategy characterized by a short life span and a maximal opportunistic reproductive effort during transient favorable periods. Such biological features may potentially lead to the inefficacy of control attempts and, simultaneously, make this species able to repopulate sites previously treated with biocides. For this reason, studies that aim at verifying the effect of molluscicides on the reproduction, growth and survival of molluscs are greatly required. Molluscicides of plant origin may represent a safe and effective way of controlling these animals. Thymol is a substance of plant origin which has bactericidal, fungicidal and anti-inflammatory properties and has been presented as a promissory biocide of mollusc species. The aim of this work was to assess the molluscicidal property of thymol in combination with DMSO against eggs and adults of B. similaris. During 120 days, we evaluated the effect of thymol+DMSO at different concentrations (2.5 g/L and 5 g/L) on the hatching success, hatchling survival, growth and reproduction of B. similaris under laboratory conditions. We tested thymol+DMSO on 160 eggs, 160 10-day-old and 160 30-day-old juveniles. The results showed that thymol+DMSO (5 g/L and 2.5 g/L) affected hatching success, acting as an ovicide. The tests with 10-day-old juveniles showed that thymol+DMSO at 2.5 g/L and 5 g/L caused 90 and 100% of mortality, respectively. For the 30-day-old juveniles, thymol+DMSO caused 87.5% of mortality at 5 g/L, and 75% at 2.5 g/L. With regard to growth, the results were not significant. The 10-day-old individuals treated with thymol+DMSO showed only one reproductive event during the 120 days of the experiment. Thymol+DMSO showed molluscicidal and residual activity, which makes evident its potential for controlling snails, and consequently, snail-borne diseases."}