{"doi": "https://doi.org/10.1002/jqs.812", "year": 2004, "abstract": "Abstract A detailed molluscan succession from a 10 m thick deposit of Holocene tufa at St Germain‐le‐Vasson, Normandy, provides the most complete record from northern France and has shed new light on the historical biogeography of several species of land snail. The succession has been reconstructed from four profiles and a chronology provided by accelerator mass spectrometry radiocarbon dating of charcoal, wood and shell. The onset of tufa formation occurred after 9700±90 yr BP and persisted until 4213±77 yr BP. The tufa appears to have accumulated at a remarkably constant rate (14.4–16.5 cm 100 yr −1 ), except for the upper levels, where the rate increases fourfold. The succession has been divided into six local molluscan zones. An early assemblage consisting of ecologically tolerant species and those indicative of marshy grassland is replaced by a sequence of shade‐demanding taxa, reflecting the encroachment of woodland. Shaded conditions persist until the end of the sequence but the most hygrophilous elements decline after 5422±60 yr BP (zone 5), a change also reflected in the tufa lithology by the development of silty grey horizons. Notable species recovered from the tufa include Acicula fusca, Vertigo substriata, V. alpestris, V. moulinsiana (all rare or unknown living in northern France). Hygromia limbata , a twentieth century introduction to Britain, was previously thought to be a relatively recent arrival in northern France, but its record at St Germain shows that it has been present in Normandy since 6500 yr BP. Azeca goodalli , another shade‐demanding species, appeared at St Germain much later, just after 4420±65 yr BP. Several other species present in the tufa, such as Pomatias elegans , no longer live on the site, adding to the evidence for a distributional decline in Normandy and elsewhere. Perhaps the most noteworthy record is that of Leiostyla anglica , between about 8500 yr BP and 5000 yr BP, because this constitutes its only Holocene occurrence from mainland Europe. Following this discovery it seems likely that further Holocene sites with L. anglica may be found along the western seaboard of Europe connecting populations in Iberia with those of the British Isles. Copyright © 2004 John Wiley &amp; Sons, Ltd."}