{"doi": "https://doi.org/10.1016/j.scitotenv.2013.02.003", "year": 2013, "abstract": "In order to evaluate the usefulness of terrestrial gastropods as bioindicators there is a need for studies that simultaneously compare (1) concentrations of metals in reference and polluted plots, (2) species within the same polluted habitat, (3) metal accumulation patterns in different organs and (4) metal accumulation patterns in relation to soil physicochemical properties. This study aims to assess metal accumulation patterns in two land snail species. Instead of analyzing an organism as a whole, investigating the partitioning of metals in different organs can provide information on the actual toxicological relevant fractions. Therefore, concentrations of Ag, Cd, Cr, Cu, Ni and Zn were examined in five different organs of Cepaea nemoralis, as well as in the foot and the body of Succinea putris. Snails were sampled at four polluted dredged sediment disposal localities and three adjacent less polluted reference plots situated along waterways in Flanders, Belgium. Due to the small size and problematic dissection of S. putris only the concentrations in the foot of both species could be compared. For this reason only, C. nemoralis can be described as a better bioindicator species that allows a far more detailed analysis of organ metal accumulation. This study showed that organs other than the digestive gland may be involved in the immobilization and detoxification of metals. Furthermore, pH, soil fractionation (clay %, silt %, sand %) and organic matter, correlate with metal accumulation in organs. However, most often the soil metal concentrations did not correlate with the concentrations found in snail organs. Metal concentrations in organs of both species (1) differed among polluted plots but rarely between polluted and reference plots within a locality, (2) were organ-specific (digestive gland > foot > albumen gland = spermoviduct = ovotestis), (3) were species-specific and (4) depended on the metal type (high Cd and Cu concentrations were observed in the digestive gland and foot respectively). Our study emphasizes that background metal levels should be taken into account when using invertebrates as bioindicators of metal contamination and that bioindicators may show substantial differences in accumulation patterns even if they have a highly comparable ecology."}