{"doi": "https://doi.org/10.1371/journal.pone.0096012", "year": 2014, "abstract": "Harboring a large number of endemic species, the Alps and the Western Carpathians are considered as major centers of biodiversity. Nonetheless, the general opinion until the turn of the millennium was that both Central European mountain regions did not provide suitable habitat during the Last Glacial Maximum, but were colonized later from southern refuges. However, recent molecular genetic studies provide new evidence for peripheral Alpine refuges. We studied the phylogeography of the calciphilous land snail O. dolium across its distribution in the Alps and the Western Carpathians to assess the amount of intraspecific differentiation and to detect potential glacial refuges. A partial sequence of the mitochondrial COI was analyzed in 373 specimens from 135 sampling sites, and for a subset of individuals, partial sequences of the mitochondrial 16S and the nuclear histone H3 and H4 were sequenced. A molecular clock analysis was combined with a reconstruction of the species' geographic range history to estimate how its lineages spread in the course of time. In order to obtain further information on the species' past distribution, we also screened its extensive Pleistocene fossil record. The reconstruction of geographic range history suggests that O. dolium is of Western Carpathian origin and diversified already around the Miocene-Pliocene boundary. The fossil record supports the species' presence at more than 40 sites during the last glacial and earlier cold periods, most of them in the Western Carpathians and the Pannonian Basin. The populations of O. dolium display a high genetic diversity with maximum intraspecific p-distances of 18.4% (COI) and 14.4% (16S). The existence of various diverged clades suggests the survival in several geographically separated refuges. Moreover, the sequence patterns provide evidence of multiple migrations between the Alps and the Western Carpathians. The results indicate that the Southern Calcareous Alps were probably colonized only during the Holocene."}