{"doi": "https://doi.org/10.1093/sysbio/35.2.204", "year": 1986, "abstract": "Variation in land-snail shell form has been extensively documented, but its causes are poorly understood. For no character are there general rules relating shell form to environmental characteristics, although certain correlations are common. Size variation generally has a large genetic component. Larger snails are often associated with moister conditions; the effect may be inductive (direct) or selective, but the mechanism is not documented. Snails may attain smaller adult sizes at higher population densities, apparently through the effects of pheromones on growth rate. Relative aperture area tends to be smaller under drier conditions, probably because of selection for smaller whorl cross-sectional area to reduce water loss. Larger snails tend to have higher whorl expansion rates. This pattern is variously interpreted as relating to the maintenance of constant attachment area/weight, whether of foot surface area when the snail is active or when attached to a substrate or of aperture perimeter when attached. Apertural denticles are generally thought to represent adaptations to reduce predation. Relative shell height of snail species relates to the angle of the substrate on which activity occurs; this could be related to the mechanics of shell balance. For unknown reasons, helicid species in the Mediterranean area frequently have forms with keeled and with rounded shell peripheries. Snails living on calcareous substrates sometimes have thicker shells; the effect is not necessarily direct. Surprisingly, only a weak relationship exists between shell thickness and moisture conditions. Shell coiling sometimes occurs in the opposite direction between sympatric species, probably as a result of selection for reproductive isolation. A recurring problem in the explanation of shell form is the interpretation of covarying shell characters. Identification of nonadaptive variation which results from developmental dependence on another character is dependent on the study of the selective and direct-environmental causes of variation in land snail shell form."}