{"doi": "https://doi.org/10.1111/j.1439-0469.2008.00468.x", "year": 2008, "abstract": "Partial DNA sequences of two mitochondrial genes [cytochrome oxidase subunit I (COI) and 16S rRNA] from 59 specimens of Iberus were used to test the validity of the described morphospecies of this genus, and examine genetic divergences within and between main phylogenetic groups. Both gene fragments showed phylogenetic concordance. The COI gene was found to be faster evolving than the 16S gene and was fully protein-coding with no insertions or deletions. 16S rRNA was more informative than COI for resolving basal nodes. Both individual and combined analyses of the two gene fragments revealed five main phylogroups. These five groups are genetically unique lineages that are allopatrically distributed and considered to have full species status. Further subdivisions were also considered. Shell morphology was suitable for delimiting species boundaries, but several incongruences between morphology and mtDNA phylogeny were observed. These incongruences were considered consequence of hybridization between Iberus cobosi and Iberus marmoratus, and the result of shell shape polymorphism in Iberus rositai. According to spatial patterns of sequence divergence, life habits and shell morphology may be concluded that the keeled-flat shelled snails independently originated several times within Iberus and they could represent cases of similar shell adaptation to a karstic arid environment. Se han analizado dos fragmentos del ADN mitocondrial (COI y 16S rRNA) de 59 ejemplares de Iberus con el fin de determinar la validez de las morfoespecies de tamaño medio descritas para este género, así como para analizar las divergencias genéticas existentes entre los principales grupos filogenéticos identificados. Los resultados obtenidos para ambos genes fueron similares. La tasa evolutiva fue más rápida en el COI, fragmento codificante, no presentando inserciones ni deleciones. Por otra parte, el fragmento del 16S fue más informativo en la resolución de los nodos basales. Tanto los análisis individuales de ambos fragmentos como el análisis combinado permitieron identificar cinco linajes genéticos únicos que presentan una distribución alopátrica y son considerados como cinco especies diferentes. Además, se contemplan otras subdivisiones adicionales. Se ha observado que existe concordancia entre las morfoespecies y los filogrupos obtenidos, indicando que la concha es un criterio taxonómico válido para la delimitación de especies en este grupo. No obstante, se han observado varias incongruencias entre la morfología y la filogenia obtenida mediante secuenciación del ADNmt. Estas incongruencias parecen ser consecuencia de procesos de hibridación entre I. cobosi e I. marmoratus, pero parecen ser resultado del polimorfismo de la concha en I. rositai. Teniendo en consideración los filogramas obtenidos, el modo de vida y la morfología de la concha, se puede concluir que las conchas aquilladas y aplanadas se originaron varias veces independientemente en Iberus y que parecen constituir ejemplos de adaptación de la concha a ambientes kársticos áridos. Table S1. Species abbreviations, geographical coordinates (using Spanish grid references) and GenBank accession numbers for all the sequences of Iberus Table S2. Molecular diversity indices for the different basal clades of Iberus. Values of number of haplotypes (H), haplotype diversity (Hd), nucleotide diversity (π) and number of nucleotide differences (k) are reported Table S3. pGenetic distances (16S rRNA above diagonal, COI below diagonal) for all pairwise comparisons among basal clades. Maximum p genetic distances within clades are also indicated Please note: Blackwell Publishing are not responsible for the content or functionality of any supplementary materials supplied by the authors. Any queries (other than missing material) should be directed to the corresponding author for the article. Please note: The publisher is not responsible for the content or functionality of any supporting information supplied by the authors. Any queries (other than missing content) should be directed to the corresponding author for the article."}