{"doi": "https://doi.org/10.1016/0899-5362(95)94397-r", "year": 1995, "abstract": "This study deals with the Neogene and extant land snails of tropical East Africa and their implications for interpreting the paleoenvironments of the numerous localities at which they have been found. Of major significance to the study is the intimate association between the terrestrial molluscs and the rich mammalian faunas, hominoids included, of East Africa. Thus, palaeoecological reconstructions based on land snails are directly applicable to the mammalian faunas. Palaeoecological reconstructions are proposed for most of the Lower and Middle Miocene hominoids, including Proconsul, Rangwapithecus, Limnopithecus, Micropithecus, Nyanzapithecus, Kenyapithecus and others, and for the mid-Pliocene Australopithecus from Laetoli, Tanzania. The departure point for the palaeoecological reconstructions is a comprehensive study of extant terrestrial molluscs of East Africa, the habitat preferences of which are well documented. All the fossil gastropods studied comprise extant genera and even species, so the usual problems regarding the application of actualism to fossil assemblages is avoided. Furthermore, the fossil gastropod assemblages resemble extant ones, confirming their utility for such reconstructions. Among the parameters examined are rainfall, altitude, vegetation cover and type and zoogeography. A further point of interest is that the samples are more than adequate for the purposes of the study, many of the fossil localities having yielded several thousand specimens. Finally, more than 40% of the extant genera of East Africa have now been recognized in the fossil state. The molluscs are thus, by far, the best represented biological group known in the fossil record of Africa and as such hold great potential for understanding the past. This study ends with reconstructions of the palaeoecology of numerous fossiliferous localities in East Africa which have yielded molluscs and mammals. Changes through the geological column are documented and the habitat preferences of hominoid taxa are proposed. The study suggests, for example, that Proconsul major lived in humid tropical forest, Proconsul nyanzae inhabited dry tropical forest or closed woodland, Kenyapithecus africanus occurredin semi-arid steppe to woodland, and Australopithecus afarensis at Laetoli lived in savannah/steppe in which there were watercourses fringed by riparian forest. This paper is illustrated with distribution maps and drawings of the more than 40 snail taxa represented in the collections. The distribution maps illustrate the extant distribution of taxa, as well as the fossil localities at which they have been recovered. It represents a major advance in the study of tropical African Neogene palaeoecology, and will undoubtedly have many applications in future studies of African palaeoeforas and palaeofaunas. Cette étude des escargots terrestres néogènes et actuels de l'Afrique orientale tropicale montre l'intér^et de ces mollusques dans les reconstitutions paléoenvironnementales des nombreuses localités où ils ont été récoltés. Un des résultâts importants est la mise en évidence de l'association étroite entre les mollusques terrestres et les riches faunes mammaliennes, y compris les hominoïdes, de l'Afrique orientale. Ainsi, les reconstitutions paléoécologiques établies à partir des escargots terrestres sont directement applicables aux faunes mammaliennes. Des reconstitutions paléoécologiques sont proposées pour la plupart des sites à hominoïdes miocènes contenant notamment Proconsul, Rangwapithecus, Limnopithecus, Micropithecus, Nyanzapithecus, Kenyapithecus et pour le gisement àAustralopithecus de Laetoli en Tanzanie daté du Pliocène moyen. Les reconstitutions paléoécologiques sont basées sur une étude détaillée des mollusques actuels de l'Afrique orientale dont on connaît bien les habitats préférentiels. Tous les gastropods fossiles étudiés comprennent des genres actuels, voire les espèces, si bien que les problèmes classiques liés à l'application du principe de l'actualisme aux assemblages fossiles est évités. De plus, les assemblages de gastropodes fossiles ressemblent aux actuels, confirmant ainsi leur utilité pour de telles reconstructions. Pour determiner le milieu, des paramètres tels que la pluviométrie, l'altitude, la couverture végétale et sa composition, ainsique la zoogéographie ont été retenus. Un autre intérêt des ensembles est que les échantillons sont excellents, plusiers des localités fossilifères ont livré des milliers de spécimens. Enfin, plus de 40% des genres actuels de l'Afrique orientale ont été maintenant reconnus à l'état fossile. Les mollusques constituent ainsi le groupe biologique fossile de loin le mieux représenté en Afrique, et en tant que tel reste une source d'information primordiale pour comprendre le passé. La dernière partie de l'étude est consacrée aux reconstitutions paléoécologiques des nombreuses localitées fossilifères d'Afrique orientale ayant livré des mollusques et des mammifères. Les changements observés au cours des temps géologiques sont documentés et les habitats préférentiels des primates hominoïdes sont proposés. Ainsi, l'étude suggère que Proconsul major vivait dans une forêt tropicale humide, Proconsul nyanzae dans une forêt tropicale sèche ou une forêt claire, Kenyapithecus africanus dans une steppe semi-aride ou une forêt claire et Australopithecus afarensis à Laetoli habitait dans une mosaïque de savane et de steppe dans lesquels des cours d'eau bordés par une forêt-galerie. La monographie est illustrées de dessins de plus de 40 taxons d'escargots fossiles représentés en collection et des cartes de leur répartition. Ces dernières représentent les distributions actuelles des taxons ainsi que les localités fossilifères où ils ont été récoltés. C'est la première monographie de ce type pour la paléoécologie du Néogène africain dont les applications seront probablement nombreuses dans les études ultérieures de paléoflores et paléofaunes."}