{"doi": "https://doi.org/10.1007/s11434-011-4931-z", "year": 2011, "abstract": "Knowledge of seasonal climate change is one of the key issues facing Quaternary paleoclimatic studies and estimating seasonal climate change is difficult, especially changes such as seasonal length on glacial-interglacial timescales. The stable isotope composition from seasonal land snail shells provides the potential to reveal seasonal climatic features. Two modern land snail species, cold-aridiphilous Pupilla aeoli and thermo-humidiphilous Punctum orphana, were collected from different climatic zones in 18 localities across the Chinese Loess Plateau, spanning 11 degrees of longitude and covering a range of 1000 km2. The duration of the snail growing season (temperature ⩾10°C) was shorter (202 ± 6 d) in the eastern Loess Plateau compared with in the western Loess Plateau (162 ±7 d). The δ 13C of P. aeoli shells was −9.1‰ to −4.7‰ and −5.0‰ to 0.3‰ for δ 18O. For P. orphana, the δ 13C ranged from −9.1‰ to −1.9‰ and −8.9‰ to −2.9‰ for δ 18O. Both the δ 13C and δ 18O differences between the two snail species were reduced from the east to the western Loess Plateau (2.8‰ to 0.2 ± 1.1‰ for δ 13C and 4.7‰ to 2.9 ± 1.3‰ for δ 18O). These isotopic differences roughly reflect the difference in the growing season lengths between the east and west Loess Plateau indicating that the duration of the snail growing season shortens by 15 d or 19 d if the difference decreases by 1‰ in δ 13C or δ 18O, respectively. Thus, the difference in δ 13C and δ 18O between both snail species can be used to reveal the length of the snail growing season in the past. Based on our investigation, the length of the snail growing seasons from the Xifeng region during the last 75 ka was reconstructed. During the mid-Holocene (8–3 ka), the mean isotopic difference from both snail species reached maximum values of 2.6 ± 0.7‰ and 2.1 ± 1.4‰ for δ 13C and δ 18O, respectively. This was followed by MIS 3 that ranged from 2.5 ± 0.4‰ for δ 13C and 1.6 ± 0.8‰ for δ 18O. The Last Glacial Maximum changed by only 0.2‰ and 0.4‰ for δ 13C and δ 18O, respectively. Therefore, we estimate that the duration of the snail growing seasons to be ∼200 ± 10 d during the mid-Holocene, 190 ± 6 d in MIS 3 and 160 ± 3 d during the last glacial period."}