{"doi": "https://doi.org/10.1111/j.1365-2664.2008.01470.x", "year": 2008, "abstract": "1 Modified habitats have a profound impact on the biota of fragmented tropical forests. We investigated the structure of land-snail assemblages in Sri Lankan lowland rainforest and village home gardens, a habitat of the surrounding matrix of modified habitats. We focused on four questions, (i) How do the land-snail faunas of lowland rainforest and home gardens differ and can forest species persist in gardens? (ii) Can environmental variables such as altitude, canopy density and soil pH explain significant variation in species composition independent of the effects of habitat type? (iii) What is the extent of geographical species turnover? (iv) How valuable are the two habitats for the conservation of native land snails? 2 Sixty-nine standardized belt transects were sampled in 21 rainforest fragments and 12 gardens. Data were analysed using canonical and partial canonical correspondence analysis. 3 Land-snail species composition varied significantly between gardens and forest. Lowland rainforest was dominated by native snails, many of which were restricted to forest. Gardens contained a distinct component of exotic and native synanthropic snails, as well as many native forest species. Altitude, canopy density and soil pH explained significant variation in species composition independent of the effects of habitat type but were closely correlated with variation in species composition between gardens and forest. Longitude and latitude explained significant variation in species composition across both gardens and forest. 4 Synthesis and applications. Most rainforest snails were restricted to forest. This, together with the high level of geographical turnover and the scale of forest fragmentation, emphasizes the need to conserve all remaining rainforest cover. A substantial number of widespread and localized forest land-snail species can survive in gardens. Home gardens therefore offer great potential for restoring and increasing forest cover and connectivity."}