{"doi": "https://doi.org/10.1046/j.1365-2699.1999.00276.x", "year": 1999, "abstract": "Summary Aim We examined the species‐area relation of Aegean land snails, comparing different models to describe the relation. By examining those factors other than area that may also affect species richness, we tested whether the Aegean land snail fauna was more influenced by equilibrial migration and colonization processes, or rather is conservative and relictual. Location The Aegean archipelago (Greece). Methods Sixty‐five islands were examined. Data were taken from own collections and from literature sources. Multiple regression analysis was used to test the null hypothesis of no relationship between species richness and island area, elevation, distance to the next larger island, and the presence and extent of calcareous substrate. Results The single most important factor determining land snail species number was area. While colonization‐extinction dynamics have frequently been cited to explain this result, this conclusion was not tenable in this study as it was contradicted by species number not being related to the islands’ distances to neighbouring larger islands, after accounting for other factors affecting species number. We also found that habitat diversity affected species richness even after accounting for the effects of area: both increased elevation and greater extent of calcareous substrate on islands resulted in higher species number. This effect was most likely due to the fact that particular ecological conditions increased the probability that particular species could survive on an island. We compared the utility of the power and extreme‐value function models of the species‐area relation and found that both gave substantially the same results. However, fitting the power function model using nonlinear regression was of questionable utility. Main conclusions We conclude that the snail fauna of the Aegean is relictual, not equilibrial. The unusually high number of land snail species found on Crete is consistent with this conclusion. Crete is a currently united island which was separated into at least six smaller islands for 7–9 million years during the Neogene. Our results are consistent with the hypothesis that Crete still hosts a large number of endemic species of these paleoislands, resulting in a total number of species in excess of what would be expected based on area alone."}