{"doi": "https://doi.org/10.1111/j.1095-8312.1987.tb01992.x", "year": 1987, "abstract": "The bimodal distribution of shell shape (height: diameter), that is found in various geographically widely separate and taxonomically distinct land snail faunas of many different regions of the world, occurs also in a Mediterranean fauna and in a desert fauna that is derived from it. The desert fauna is, however, closer to the bisector than the Mediterranean one. High-spired snails are mainly rock-dwellers, and equidimensional to low-spired snails are bush-dwellers or soil-diggers, with a few rock-dwellers; litter-dwellers are small-sized species that may have either high- or low-spired shells. These results are discussed in adaptive terms. Litter is probably the more primitive of these micro-environments. Many of the small, litter-dwelling snails are ovo-viviparous rather than oviparous, perhaps so as to avoid attacks on the eggs by saprophytic fungi. The shift away from the litter environment is accompanied by a trend to abandon the ovo-viviparous strategy, in favour of oviparity, the snail using its foot to dig into the soil and lay eggs. The conchometric differences between bush-, ground- and rock-dwelling snails may perhaps reflect selective pressure to increase the size of the foot; and constraints of a habitat that consists of narrow interspaces between rocky boulders. Snails that habitually dig into the ground during periods of inactivity, and roam over the ground when active, requires a very large foot and, consequently, a very large-mouthed shell to accommodate it; the result is an equidimensional shell, globose or turbiniform in shape. Snails that climb up vertical vegetation would also require a large foot, and consequently a large-mouthed shell to contain it. A fully globose shell would however be disadvantageous, since it might cause undesired torque. Hence, bush-dwellers tend to be flatter than soil-diggers. Snails that habitually live in rock crevices, and on hard substrata, would not require a very large foot; they would need a narrow shell, both to enable easy manoeuvring through crevices and to reduce torque, the result being a small-mouthed, usually high-spired shell. The classification of land snails into bush-, soil- or rock-dwellers closely follows the taxonomic classification. In those species that depart from the habitat that is typical of their taxonomic group towards another habitat, the shell alters its shape accordingly."}