{"doi": "https://doi.org/10.1111/j.1523-1739.2005.00237.x", "year": 2005, "abstract": "Abstract: In a review of recent challenges in conservation planning, Ferrier (2002) proposed the incorporation of models of similarity in species composition as a means for prioritizing areas for biodiversity conservation. A key assumption of this approach is that estimates of compositional similarity derived from models of similarity in species composition can be used as effective surrogates for real similarity data. We used data on snail distribution in Israel to test this assumption. We used two types of models to analyze patterns of similarity in species composition: one based on presence/absence data and the second based on abundance data. Both models accounted for large amounts of the observed variation in compositional similarity. Variation‐partitioning analysis indicated that a considerable amount of the variation in compositional similarity could be separated into “pure” geographical versus “pure” environmental components, indicating that reserve selection procedures should take into account spatial considerations in determining priorities for conservation. The relative effects of geographical versus environmental factors varied between the two types of models, indicating that different indices of similarity should be used if one wishes to represent species composition per se or ecological communities including their relative species abundances. A comparison of distribution patterns of land snails and land birds in a subset of the study sites revealed a high degree of congruence in compositional similarity between the two groups. Moreover, compositional similarity in snails was a better predictor of compositional similarity in birds compared with all environmental and geographical distances taken together. Models calibrated based on data collected in small plots explained a considerable amount of the variation observed at larger scales, suggesting that sampling efforts required for conservation planning might be lower (and thus, more feasible) than assumed previously. Models of similarity in species composition may serve as an important tool for conservation planning."}