{"doi": "https://doi.org/10.1016/j.quaint.2011.04.035", "year": 2011, "abstract": "This paper presents stable isotopic results (oxygen and carbon) from both modern and Late Pleistocene-Holocene shells of the land snail Eobania vermiculata (Müller, 1774) from Favignana Island (Sicily). It aims to contribute to the understanding of climate and vegetation history of this region during formation of Upper Palaeolithic, Mesolithic and Meso-Neolithic deposits of Grotta d’Oriente (ORT). Results from both an evaporative model (FBM) and an empirical regional isotopic model (i.e. linear relation between oxygen isotopic composition of shells (δ18Os) and those of local precipitation (δ18Op)) indicate that the δ18Os values of modern specimens are mainly controlled by local temperature, relative humidity and δ18Op at the time of snail activity. Data also suggest that the modern snails are nocturnally active almost all-year round in the study area. The carbon isotopic compositions of shells (δ13Cs) of the same specimens indicate a diet prevalently (or exclusively) composed of C3 vegetation. The δ18Os values of Late Pleistocene specimens suggest that climate conditions at ∼14.2 ka cal BP were similar to the present day, in agreement with additional δ18Os records from southern Italy. By contrast, early-middle Holocene shells are notably 18O-depleted and suggest wetter conditions, possibly combined with a decrease in isotopic composition of precipitation source, compared to the present day. When compared with regional palaeoclimatic records a large-scale isotopic response to millennial-scale changes in atmospheric and hydrological conditions (e.g. enhanced rainfall) in the central-eastern Mediterranean is observed during the early-middle Holocene. The δ13Cs of Late Pleistocene and Holocene specimens are consistently higher than those of modern ones. For the Late Pleistocene, this could be reasonably explained in terms of water-stressed vegetation. On the other hand, this seems to be less valid for Holocene counterparts when the climate was wetter. Probably δ13Cs values result from the combination of distinct competing factors, involving atmospheric CO2 concentration, seasonal water budget, vegetation type-cover and other carbon sources. Results reveal coherent relationships between regional δ18Os and δ13Cs, demonstrating that Late Pleistocene-Holocene land snail shell remains from archaeological sites may provide useful snapshots of past seasonal climate conditions."}