{"doi": "https://doi.org/10.1086/283098", "year": 1976, "abstract": "The pulmonate land snail Rumina decollata of the Mediterranean region is a complex of monogenic strains maintained, at least in part, by a breeding system of faculative self-fertilization. The ecogenetic relationships of two strains differing in body color (dark and light), microhabitat distribution, and allelic representation at 13 of 26 structural gene loci assayed electrophoretically were studied in the Montpellier region of southern France. Colonies may consist of one monogenic strain or a variable combination of the two. Interstrain hybridization was detected in a study of the composition of 24 colonies in a 2.5-acre area in Montpellier; the proportion of individuals having mixed genomes varied from 0% to 36.8% with a mean of 8.6%. The mean value of Wright's fixation index for the colonies was 0.7748, and the frequency of outcrossing was crudely estimated at 0.150. The rate of outcrossing was frequency dependent, being highest in colonies in which the dark-bodied strain was decidedly in the minority. Hybrid individuals produce viable and fertile young, and they are normally fecund under laboratory conditions. However, the fact that the strains remain monogenic despite the potential for introgression suggests strong coadaptation of their respective genomes. In developing a theory to account for the loss of recombinational flexibility and the evolution of phenotypically tolerant \"general purpose genotypes\" in Rumina, it is postulated that significant predisposing conditions include a severe reduction in genetic variability in small founder populations, highly restricted gene flow among colonies, and the exploitation of microhabitats that are relatively free of genetically adaptable competitors, predators, and parasites. The present study confirms the conclusion, reached earlier by plant geneticists, that strongly inbred species retain much genetic variability, distributed largely among monomorphic lines and occasionally released through outcrossing. The genetic structure of Rumina is remarkably similar to that of the wild oat Avena barbata and certain other autogamous plants. Comparative studies of plants and sessile or semisessile animals are expected to provide further evidence of important convergent similarities in strategies of adaptation involving regulation of genetic structure through control of the breeding system."}