{"doi": "https://doi.org/10.1590/1676-0603000414", "year": 2014, "abstract": "The risks following introduction of invasive species are enormous and incalculable. Achatina fulica is considered one of the 100 species of greatest invasive potential, stands out among the land pulmonate snails, mostly for its high reproductive potential that accelerates the process of dispersion, increasing the damages related to health (disease transmission), to economy (crops destruction) and to environment (biodiversity loss). In order to investigate the relationship of the African snail with the environment, trying to relate sexual activity with climatic variables (temperature, rainfall and humidity), a study was conducted on aspects of population dynamics and reproductive biology in Salvador city. The snails were collected by hand, monthly. Morphometric data were obtained in the field and dissections to analyze the reproductive system at laboratory. To test if there was a greater sexual activity in wet periods was performed first a Principal Component Analysis (PCA) with climatic variables, followed by a regression between precipitation (the most influential environmental variable) and the variable of interest (sexual activity). The results showed that there is an apparent annual cycle forA. fulica, with a recruitment period covering the end of rainy season and the dry season (August to December 2006 and February 2007). Increase of shell size (height) and of sexual activity were observed during the rainy season, although snails were found in full sexual activity during the whole period of study. The von Bertalanffy curve showed that the oldest specimen collected would have three years and eleven months. The regression between precipitation and sexual activity was significant (P = 0.002) showing that the higher rainfall increased sexual activity. In addition, it was observed that there is an increase in the thickness of peristome as the specimens reaches sexual maturity however this relationship isn’t precise (it were found individuals with sexual structures not consistent with the reproductive stage given by the thickness of peristome) and should be set for each region studied. As the eradication becomes impossible because of high level of invasion found in Salvador, it is recommended to control the population of African snails by continuously removing specimens, especially in the rainy periods."}