{"doi": "https://doi.org/10.1016/j.baae.2007.09.006", "year": 2008, "abstract": "Changes in agriculture (intensification or abandonment) have resulted in a dramatical reduction of semi-natural grasslands in Central Europe in the 20th century. Recent management actions aim to restore overgrown and formerly fertilized nutrient-poor grasslands. Former land use is known to influence the present-day vegetation. Similar information is not available for animals with low dispersal ability. We investigated the effect of pasture management history over a period of 55 years on the present-day land snail diversity in 20 dry, nutrient-poor grasslands in the Swiss Jura mountains. Snails were recorded in pastures left unmanaged for 10–40 years but recently cleared from overgrowing shrubs, in pastures fertilized for 15–25 years but recently managed extensively (no fertilizer), and in pastures which have been extensively managed throughout (=control). Past shrub cover had a negative effect on the total number of snail species and the number of red-listed individuals. Former use of fertilizer reduced red-listed species and individuals and changed the snail community. Three species (Vitrina pellucida, Helicella itala and Abida secale) were found less frequently in formerly fertilized pastures than in extensive pastures. Our results show that changes in pasture use for a period of 10–40 years caused long-term alterations of the land snail fauna. Im Laufe des zwanzigsten Jahrhunderts haben Veränderungen in der Bewirtschaftung der Wiesen und Weiden (Intensivierung oder Brachlegung) zu einem dramatischen Rückgang der halbnatürlichen Grasländer in Zentraleuropa geführt. Seit einigen Jahren wird versucht, verbuschte und ehemals gedüngte Trockenweiden mit geeigneten Massnahmen in ihren ursprünglichen Zustand zurückzuführen. Verschiedene Studien zeigen, dass die heutige Vegetation durch die frühere Landnutzung beeinflusst wird. Ähnliche Kenntnisse über Tiere mit geringem Ausbreitungsvermögen fehlen. Wir untersuchten den Einfluss unterschiedlicher Bewirtschaftungsformen während 55 Jahren auf die heutige Schneckenfauna in 20 nährstoffarmen Trockenweiden im Schweizer Jura-Gebirge. Die Schneckenfauna wurde in Weiden untersucht, die während 10–40 Jahren nicht mehr gepflegt, vor kurzer Zeit aber von den dabei entstandenen Büschen befreit wurden und in Weiden, die während 15–25 Jahren gedüngt, aber seit mindestens vier Jahre wieder extensiv (ohne Düngereinsatz) bewirtschaftet wurden. Als Kontrolle dienten Weiden, die immer extensiv bewirtschaftet wurden. Die zwischenzeitliche Verbuschung reduzierte die Anzahl Schneckenarten und die Anzahl Rote Liste-Individuen. Die zwischenzeitlich intensivere Weidebewirtschaftung reduzierte die Anzahl Rote Liste-Arten und Individuen, und veränderte die Artenzusammensetzung der Schneckengesellschaft. Drei Arten (Vitrina pellucida, Helicella itala and Abida secale) wurden weniger häufig in den ehemals gedüngten Weiden als in den extensiven Weiden gefunden. Unsere Ergebnisse zeigen, dass Änderungen in der Weidenbewirtschaftung während 10–40 Jahren die Schneckenfauna langfristig verändern."}