{"doi": "https://doi.org/10.4314/joafss.v4i1.33766", "year": 2008, "abstract": "The potential of integrating wildlife husbandry management in the fadama farms of five states within Southeatern Nigeria was carried out based on the multiple-utilization principles. Fadama land is described as area dominated by specific herbaceous plants and predominantly in an environment above water level.The plants are supplied with amount of water that would be excessive for most animals and higher plants bearing aerial shoots. The five selected states are Abia, Cross River, Anambra, Akwa Ibom and Eboyi States. Combination of structured questionnaire and on-field examination of the farms were carried out during the survey. The results showed that wild species are abundant and can provide a significant portion of animal protein to the people in the area. Among the species of wild animals at the Fadama farm sites are the rodents: cane rat Thryonomys Swinderianus, giant rat: Cricetomys gambianus, squirrel: Protoxerus, stangeri; Artiodactyla such as bushbuck: Tragelaphus scriptus, blue duiker: Cephalophus monticola; Reptilia such as black cobra, crocodile: Crocodilus niloticus; Mollusca; African giant snail: Achachatina marginata and a number of terrestrial water birds that have high economic and aesthetic values. The fadama farms in the states mainly specialized in three varieties of produce viz:grains (40.0%), vegetables (40.0%) and tubers (20.0%). Thus, species of animals found in them were those associated with their utilization. Multiple utilization principles indicated that the wild species that are compatible (35.0%), those that are residual population (60.0%) and those that require specialized habitat (5.0%). These revealed that for wildlife to survive in this country at large, integrating their management with existing farming practices must be identified along with specific species in fadama farms. It can be concluded that fadama farms rehabilitation in the country can offer feasible operational strategy for sustainable wildlife species development. Thus, such wildlife species should not be treated as pests at all categories, but integrated as potential products to ensure a sustained yield. Keywords: Fadama, Wildlife, Sustainable, South-East, Potential.JOAFSS Vol. 4 (1) 2006: pp. 183-193"}