{"doi": "https://doi.org/10.1111/j.1095-8312.1973.tb00703.x", "year": 1973, "abstract": "The land snail Arianta arbustorum is polymorphic for colour and banding of the shell. This paper reports the results of a survey of natural populations of the species in the valley of the River Dove in Derbyshire and Staffordshire. There is some evidence of climatic selection in non-woodland populations such as has been observed elsewhere in Britain. The woodland sites can be divided into several classes depending upon the tree species present. The morph-frequencies are significantly different between class, but homogeneous within. It is argued that the greenness of the ground cover depends upon the trees growing overhead, and that the morph-frequency is related to this. It is suggested that visually discriminating predators may be partially responsible for this correlation. SUMMARYArianta arbustorum (L.) is a terrestrial land snail which is polymorphic for colour and banding. Brown shell colour is dominant to yellow, and banded is dominant to unhanded. The two loci are closely linked. Communities of larger helicid snails were sampled along the valley of the River Dove in Derbyshire and Staffordshire. The samples were scored for species composition, and the proportions of the various morphs of A. arbustorum were determined. Outside the woodland areas, A. arbustorum shows slight evidence of micro-climatic selection similar to that found elsewhere in Britain. There is little evidence of differences in the ecological genetics of A. arbustorum between woodland and non-woodland habitats despite fairly heavy predation. It is argued that predation may be lower outside the woods allowing climatic effects to become detectable. The woodland samples are heterogeneous with respect to morph frequency. The heterogeneity can be partitioned between three classes of woodland which are internally homogeneous. It is argued that birch woodland may be lighter in background than hazel, with the elm-ash-beech woods being darker than either. The proportion of unhanded yellow A. arbustorum is highest in the first of the classes, and lowest in the last. It is argued that this result could be due to the actions of visually discriminating predators upon these populations of A. arbustorum."}