{"doi": "https://doi.org/10.1130/0091-7613(1983)11<575:latpor>2.0.co;2", "year": 1983, "abstract": "Research Article| October 01, 1983 Limestone and the problem of radiocarbon dating of land-snail shell carbonate Glenn A. Goodfriend; Glenn A. Goodfriend 1Department of Zoology, University of Florida, Gainesville, Florida 32611 Search for other works by this author on: GSW Google Scholar Jerry J. Stipp Jerry J. Stipp 2Radiocarbon Dating Laboratory, University of Miami, Miami, Florida 33124 Search for other works by this author on: GSW Google Scholar Geology (1983) 11 (10): 575–577. https://doi.org/10.1130/0091-7613(1983)11<575:LATPOR>2.0.CO;2 Article history first online: 01 Jun 2017 Cite View This Citation Add to Citation Manager Share Icon Share Facebook Twitter LinkedIn MailTo Tools Icon Tools Get Permissions Search Site Citation Glenn A. Goodfriend, Jerry J. Stipp; Limestone and the problem of radiocarbon dating of land-snail shell carbonate. Geology 1983;; 11 (10): 575–577. doi: https://doi.org/10.1130/0091-7613(1983)11<575:LATPOR>2.0.CO;2 Download citation file: Ris (Zotero) Refmanager EasyBib Bookends Mendeley Papers EndNote RefWorks BibTex toolbar search Search Dropdown Menu toolbar search search input Search input auto suggest filter your search All ContentBy SocietyGeology Search Advanced Search Abstract In order to test the role of limestone in producing anomalously old radiocarbon ages in land-snail shells, 14C analyses were performed on shell carbonate of modern land snails from limestone and nonlimestone areas of Jamaica. No anomaly was found in snails from the nonlimestone area, implying that such material is suitable for radiocarbon dating. Snails from limestone areas produced variable anomalies of as much as 3,120 yr due to incorporation of 14C-free limestone into shell carbonate. All rock-scraping snails and most leaf-litter–feeding snails from limestone areas showed anomalous 14C contents. Because of the variability in 14C content even within species, no standard correction factor for limestone anomaly can be applied. However, dating error can be minimized by selecting ecologically appropriate species or by comparison of analyses of several fossil species, within a stratum, to their modern counterparts. This content is PDF only. Please click on the PDF icon to access. First Page Preview Close Modal You do not have access to this content, please speak to your institutional administrator if you feel you should have access."}