{"doi": "https://doi.org/10.1016/j.baae.2006.02.003", "year": 2007, "abstract": "Livestock grazing is a common management practise in semi-natural grasslands in Central Europe. Different types of livestock (horses, cattle, sheep) and grazing intensity are known to affect the richness and composition of plant species. However, knowledge of grazing-dependent effects on invertebrates is limited. We examined the influence of horse, cattle and sheep grazing on the richness, abundance and composition of land snail species in 21 calcareous nutrient-poor grassland areas in the northwestern Jura Mountains, Switzerland. Grazing by different livestock species did not affect the species richness, abundance and species composition of land snails. Furthermore, the number of open-land species and the ratio of large- to small-sized snail species or individuals did not differ among the three pasture types. However, independent of livestock species, grazing intensity negatively influenced the snail fauna. Snail species richness, abundance and number of Red list species decreased with increasing grazing intensity. Grazing intensity also affected the occurrence of individual snail species (Truncatellina cylindrica, Cecilioides acicula, Candidula unifasciata and Trichia plebeia). To preserve the snail fauna in nutrient-poor grasslands, pastures can be stocked with horses, cattle or sheep. However, both maximum stocking rate (number of livestock units per hectare) and grazing duration (number of grazing days per year) must be carefully defined for the proper management of the pastures. Die Viehbeweidung ist eine gängige Bewirtschaftungsform in halbnatürlichen Graslandschaften in Zentraleuropa. Verschiedene Nutztierarten (Pferde, Rinder, Schafe) und die Beweidungsintensität beeinflussen die Vielfalt und Zusammensetzung der Pflanzenarten auf unterschiedliche Art und Weise. Unsere Kenntnisse über mögliche Effekte der verschiedenartigen Beweidung auf verschiedene Gruppen von Invertebraten sind aber beschränkt. Wir untersuchten den Einfluss der Pferde-, Rinder- und Schafbeweidung auf die Vielfalt, Abundanz und Zusammensetzung der Landschneckenarten in 21 Trockenrasengebiete auf nährstoffarmen, kalkreichem Boden im nordwestschweizer Jura-Gebirge. Die unterschiedlichen Beweidungsformen beeinflussten weder die Artenvielfalt, noch die Abundanz und Artenzusammensetzung der Schnecken. Auch die Anzahl Offenlandarten und die Verhältnisse der grossen zu den kleinen Schneckenarten oder -individuen unterschieden sich nicht zwischen den drei Weidetypen. Unabhängig von der Nutztierart wurde aber ein negativer Einfluss der Beweidungsintensität auf die Schneckenfauna festgestellt. Die Artenvielfalt der Schnecken, Abundanz und Anzahl Rote Liste-Arten nahmen mit zunehmender Beweidungsintensität ab. Die Beweidungsintensität beeinträchtigte auch das Vorkommen von einzelnen Schneckenarten (Truncatellina cylindrica, Cecilioides acicula, Candidula unifasciata und Trichia plebeia). Die vorliegende Studie zeigt, dass für die Erhaltung und Förderung der Schneckenfauna von Trockenrasen diese mit Pferden, Rindern oder Schafe beweidet werden können. Allerdings müssen der maximale Viehbesatz (Anzahl Grossvieheinheiten pro ha) und die Beweidungsdauer (Anzahl Tage Beweidung pro Jahr) der Weiden klar festgelegt werden."}