{"doi": "https://doi.org/10.1890/11-0050.1", "year": 2011, "abstract": "In multiply invaded ecosystems, introduced species should interact with each other as well as with native species. Invader-invader interactions may affect the success of further invaders by altering attributes of recipient communities and propagule pressure. The invasional meltdown hypothesis (IMH) posits that positive interactions among invaders initiate positive population-level feedback that intensifies impacts and promotes secondary invasions. IMH remains controversial: few studies show feedback between invaders that amplifies their effects, and none yet demonstrate facilitation of entry and spread of secondary invaders. Our results show that supercolonies of an alien ant, promoted by mutualism with introduced honeydew-secreting scale insects, permitted invasion by an exotic land snail on Christmas Island, Indian Ocean. Modeling of land snail spread over 750 sites across 135 km2 over seven years showed that the probability of land snail invasion was facilitated 253-fold in ant supercolonies but impeded in intact forest where predaceous native land crabs remained abundant. Land snail occurrence at neighboring sites, a measure of propagule pressure, also promoted land snail spread. Site comparisons and experiments revealed that ant supercolonies, by killing land crabs but not land snails, disrupted biotic resistance and provided enemy-free space. Predation pressure on land snails was lower (28.6%), survival 115 times longer, and abundance 20-fold greater in supercolonies than in intact forest. Whole-ecosystem suppression of supercolonies reversed the probability of land snail invasion by allowing recolonization of land crabs; land snails were much less likely (0.79%) to invade sites where supercolonies were suppressed than where they remained intact. Our results provide strong empirical evidence for IMH by demonstrating that mutualism between invaders reconfigures key interactions in the recipient community. This facilitates entry of secondary invaders and elevates propagule pressure, propagating their spread at the whole-ecosystem level. We show that identification and management of key facilitative interactions in invaded ecosystems can be used to reverse impacts and restore resistance to further invasions."}