{"doi": "https://doi.org/10.1016/j.quageo.2011.03.009", "year": 2011, "abstract": "In the Chinese Loess Plateau, land snail shells are often the only material available for dating in paleoenvironmental and archaeological research. However, the geochronological suitability of land snail shells is limited because of poor knowledge about their deposition dynamics, particularly with regards to the incorporation of inorganic carbonate and the resulting age anomalies. To evaluate the factors controlling these age anomalies, radiocarbon and stable carbon analyses were carried out on surface soils, as well as the shells and organic bodies of different modern snail species from different ecological habitats. The results showed that all specimens were depleted in 14C, indicating the influence of inorganic, radiocarbon-free carbonate on the 14C-activity of the snail shells. The apparent 14C-deficiencies and the resultant age anomalies of both the Cathaica and the Bradybaena snail shells were within close ranges across the Chinese Loess Plateau, indicating that the shells of these species could, after corrections for radiocarbon anomalies, provide reliable age estimates. The apparent 14C-deficiencies were closely associated with the ecological habitats of the snails. The shells of the ground-dwelling Bradybaena had the smallest age offsets (533 ± 150 a), followed grass-dwelling Cathaica (1107 ± 138 a) and Cathaica living on trees (1550 ± 345 a). These results suggest that the availability of calcium in the respective ecological habitats is an important factor in explaining the apparent 14C-deficiencies. The influence of carbonate on the stable carbon isotope composition of shells is overwhelmed by the organic diets of snails, making δ13C unsuitable for identifying and correcting shell age anomalies. The radiocarbon activities of surface soils (Acalc) increase with weathering intensity. Thus, a significant uncertainty could be caused by assuming that Acalc is zero when estimating the proportions of different carbon sources in shells, as has been the case in most previous studies."}