{"doi": "https://doi.org/10.4028/www.scientific.net/kem.493-494.287", "year": 2011, "abstract": "There are thousands of land snail species, ranging in size from 1 mm to the Giant African Snail growing up to a foot long. Two species, known as escargot, helix aspersa and helix pomatia , are commercially important. Helix pomatia is abundant in Turkey. Those snails are exported usually without shells. Shells are damped to trash sites or used as substitute food for animals. The shell is rich in calcium carbonate and some other minor minerals. Thus, snails’ shells can be used as a source for bioceramic production. So far, in the literature there are lot of papers about converting calcite and aragonite structures to hydroxyapatite (HA), like corals, sea shells, sea urchin and other sea creatures. However, there is very limited information about converting land snail shells to HA and other bioceramic phases. The aim of this work was to produce various phases of bioceramic materials from land snails’ shells which are left as a residue waste after their export procedures. Empty local land snails’ shells ( helix pomatia ) were collected in Istanbul. They were washed, dried, crushed and ball milled until a powder of 100 µm particles size was obtained. Raw powders were stirred at 80°C for 15 min on a hotplate. A second part of the raw powder was stirred with an ultrasonic stirrer at 80°C for 15 min in an ultrasonic equipment. Equivalent amount of H 3 PO 4 was added drop by drop into the solution. The reaction lasted for 8h. Then, to evaporate the liquid part, the mixtures were put into an incubator at 100°C for 24 h and the resultant dried sediments were collected. The produced powders were analyzed with X-ray diffraction, IR and scanning electron microscope (SEM). The experimental results confirmed the formation of various Ca-phosphates, specifically monetite, fluorapatite and some other minor calcium phosphate phases. Bioceramic production from land snail is a reliable and economic way comparing to other tedious methods of producing synthetic HA and other various bioceramics phases."}