{"doi": "https://doi.org/10.1016/j.cryobiol.2004.10.003", "year": 2005, "abstract": "The land snail Helix pomatia (Gastropoda: Helicidae) is widely distributed in Northern and Central Europe where it may experience subzero temperatures during winter months. Its supercooling ability was studied in two populations of H. pomatia. One population originated from Southern Sweden (Götaland) and the other from Central France (Auvergne). In the experimental design, they were acclimated, over 2 weeks, to artificial winter conditions (hibernation, T = 5 °C). The Swedish snails showed a rather limited supercooling ability (temperature of crystallization, Tc = −6.4 ± 0.8 °C), significantly greater, however, than the supercooling capacity of the population from France (Tc = −4.6 ± 1.4 °C). In artificial spring conditions (3 months of hibernation followed by a progressive acclimation, over 2 weeks, to activity at T = 20 °C), both populations exhibited a similar high Tc (−2.0 ± 1.0 °C). The lower Tc of hibernating Swedish snails could be due to a greater loss of body water, accompanied by a higher concentration of solutes in the hemolymph. In both populations, the variation in hemolymph osmolality measured between hibernating (250–270 mOsm kg−1) and active (165–215 mOsm kg−1) snails may be explained by the variation in body water mass and did not suggest the production of colligative cryoprotectants. Moreover, the three bacterial strains, Buttiauxella sp., Kluyvera sp., and Tatumella sp. (Enterobacteriaceae) which were isolated from fed snails, but absent in starved snails, did not show any ice-nucleating activity at temperatures higher than −9 °C. Only the strain Kluyvera sp. initiated nucleation at −9 °C. This strain, therefore, is a weak, also termed a Type III or Class C ice-nucleating active bacterium, but with no influence on the supercooling ability of individual snails. In summary, fluctuations in body water mass of hibernating snail populations, triggering changes in osmolyte concentration, rather than the presence of endogenous ice-nucleating-active bacteria, accounts for fluctuations in their Tc."}