{"doi": "https://doi.org/10.1098/rstb.1998.0214", "year": 1998, "abstract": "Henderson Island, an uninhabited raised coral atoll in the Pitcairn group, has recently been designated a World Heritage Site because of its unique and relatively undisturbed ecosystem. The island is believed to have been uplifted and subaerially exposed during the last 275 kyr. This therefore provides the maximum age for the terrestrial biota that includes several endemic taxa. Henderson today supports 16 strictly terrestrial species of snails, about half of which are endemic. Analyses of sediments beneath Polynesian occupation horizons dated between the 11th and 17th centuries AD, have yielded 11 species of land snail present in the modern fauna, together with at least six (and possibly as many as eight) further species that no longer occur on the island. These extinct taxa are illustrated and formal descriptions provided for five ( Pleuropoma hendersoni , Orobophana carinacosta , Minidonta macromphalus , Philonesia pyramidalis , P. weisleri ); a sixth, known only from broken shells, appears to belong to the genus Hiona . The two remaining taxa are ‘tornatellinids’ that have not been recognized among the modern fauna. Radiocarbon dates from bones of associated extinct land birds confirm their occurrence on Henderson before the first signs of Polynesian settlement. The extinction of these taxa seems to coincide with the Polynesian occupation and evidence for large-scale burning, at least around parts of the plateau margin, suggests that their demise can be linked with habitat destruction. At least three species, Gastrocopta pediculus , Lamellidea oblonga and Pupisoma orcula , first appear in Polynesian occupation horizons. Their status as prehistoric introductions is therefore confirmed but G. pediculus no longer lives on Henderson. Pacificella variabilis , Tornatellides oblongus parvulus and Elasmias sp., all previously thought to have been other prehistoric introductions to Henderson, were recovered from pre-Polynesian levels and are therefore native."}