{"doi": "https://doi.org/10.1086/679485", "year": 2015, "abstract": "Land snails frequently encounter desiccating conditions, and their survival depends on a suite of morphological, physiological, and molecular adaptations to the specific microhabitat. Strategies of survival can be determined by integrating information from various levels of biological organization. In this study, we used a combination of physiological parameters related to water economy and molecular factors (stress protein expression) to investigate the strategies of survival adopted by seven populations of the Mediterranean-type land snail Theba pisana from different habitats. We analyzed water compartmentalization during aestivation and used experimental desiccation to compare desiccation resistance. We also measured the endogenous levels of heat shock proteins (HSPs) Hsp72, Hsp74, and Hsp90 under nonstress conditions and analyzed the HSP response to desiccation in two populations that differed mostly in their resistance to desiccation. We revealed significant intraspecific differences in resistance to desiccation that seem to be determined by the speed of recruitment of the water-preserving mechanisms. The ability to cope with desiccating conditions was correlated with habitat temperature but not with the rainfall gradient, implying that in the coastal region, temperature is likely to have a major impact on desiccation resistance rather than precipitation. Also, higher desiccation resistance was correlated with higher constitutive levels of Hsp74 in the foot tissue. HSPs were upregulated during desiccation, but the response was delayed and was milder in the most resistant population compared to the most susceptible one. Our study suggests that T. pisana populations from warmer habitats were more resistant to desiccation and developed distinct strategies of HSP expression for survival, namely, the maintenance of high constitutive levels of Hsp70 together with a delayed and limited response to stress."}