{"doi": "https://doi.org/10.1016/j.gca.2009.04.021", "year": 2009, "abstract": "Land snails provide a unique opportunity to study terrestrial paleoenvironments because their shells, which are generally highly abundant and well-preserved in the fossil record, contain a temporal record of environmental change in the form of isotope codes. To evaluate the utility of this approach for a low-latitude oceanic setting, 207 modern shells of 18 species of land snail were analyzed for their oxygen and carbon isotope composition along a north and south facing altitudinal gradient (10–2160 m a.s.l.) in Tenerife Island (∼28°N) of the Canary Archipelago. Shells collected at each locality showed a relatively large range in isotope composition which was greater along the south facing transect (drier and hotter), suggesting that the variance in shell isotope values may be related to water-stress. Although pooled isotope values did not generally show strong relationships with environmental variables (i.e., altitude, temperature and precipitation), mean isotope values were strongly associated with some climatic factors when grouped by site. The mean δ18O value of the shell (δ18Oshell) by site displayed a negative correlation with elevation, which is consistent with the positive relationship observed between temperature and the δ18O value of rain (δ18Orain). Calculated δ18O values of the snail body water (δ18Obody) derived from observed temperatures and δ18Oshell values (using the equation of Grossman and Ku [Grossman E. L. and Ku T. L. (1986) Oxygen and carbon isotope fractionation in biogenic aragonite. Chem. Geol. (Isotope Geosci. Sec.) 59, 59–74]) displayed a trend with respect to altitude that was similar to measured and hypothetical δ18O values for local rain water. The calculated δ18Obody values from the shell declined 0.17‰ (VSMOW) per 100 m, which is consistent with the “altitude effect” observed for tropical rains in Western Africa, and it correlated negatively with rainfall amount. Accordingly, lower δ18Oshell values indicate lower temperatures, lower δ18Orain values and possibly, higher rainfall totals. A positive correlation between the mean δ13C values of shells (δ13Cshell) and plants by site suggests that shells potentially record information about the surrounding vegetation. The δ13Cshell values varied between −15.7 and −0.6‰ (VPDB), indicating that snails consumed C3 and C4/CAM plants, where more negative δ13Cshell values probably reflects the preferential consumption of C3 plants which are favored under wetter conditions. Individuals with more positive δ13Cshell values consumed a larger percentage of C4 plants (other potential factors such as carbonate ingestion or atmospheric CO2 contribution were unlikely) that were more common at lower elevations of the hotter and drier south facing transect. The relatively wide range of shell isotope values within a single site requires the analysis of numerous shells for meaningful paleoclimatic studies. Although small differences were observed in isotope composition among snail species collected at a single sampling site, they were not significant, suggesting that isotope signatures extracted from multi-taxa snail data sets may be used to infer environmental conditions over a broad range of habitats."}