{"doi": "https://doi.org/10.1046/j.1365-2699.1998.2530527.x", "year": 1998, "abstract": "Abstract. This study describes and exemplifies a multivariate approach based on geographical information system (GIS) technology for the analysis of faunal responses to climatic gradients. The approach is particularly suitable for the analysis of museum collections, and it combines the data reduction capabilities of multivariate techniques (ordination and classification) with GIS tools for the manipulation of geographically referenced data. The specific steps of the analysis are (1) construction of a grid covering the study area at an appropriate resolution, (2) overlaying the grid with a data base of spatially referenced species records, (3) determining the number of times each species was recorded in each cell, (4) constructing a matrix of grid cells by species where each entry indicates the number of records of a particular species in a particular cell, (5) removing cells whose total number of records is lower than some threshold (to be determined) from the matrix, (6) analysis of the reduced matrix using ordination and classification techniques, (7) construction of maps representing the results of the multivariate analyses, and (8) analysis of these maps with respect to digital maps of relevant climatological factors. The applicability of this approach was evaluated by analysing the response of the land snail fauna of Israel to regional variation in mean annual rainfall. As was expected, patterns of faunal variation were significantly correlated with underlying variation in rainfall. However, the per‐unit effect of rainfall on the composition of the studied fauna was much greater in dry regions than in more rainy areas. Above 450 mm, no relationships could be detected between the observed patterns of faunal variation and rainfall. These patterns were consistent over a wide range of grid cell sizes (5–20 km), and were robust to outliers. The overall results indicate that the integration of GIS tools with standard multivariate techniques may serve as a valuable methodology for the identification and interpretation of regional patterns of faunal variation."}