{"doi": "https://doi.org/10.1186/1471-2148-8-339", "year": 2008, "abstract": "Present day distributions of Palearctic taxa in northern latitudes mainly result from populations having survived in local patches during the Late Pleistocene and/or from recolonizing populations from southern temperate refugia. If well-studied Mediterranean and eastern European refugia are widely accepted, some recent biogeographical assumptions still remain unclear, such as the occurrence of multiple glacial refugia in Iberia and cryptic refugia in northern Europe during the last glaciations. The Lusitanian snail Elona quimperiana has a remarkably disjunct distribution, limited to northwestern France (Brittany), northwestern Spain and the Basque Country. By describing the phylogeographical structure of this species across its entire range, the present study attempts to identify refugia and subsequent recolonization routes. Results based on 16S and COI gene sequences showed that the low genetic diversity observed in the Brittany populations should be associated with a recent demographic expansion. By contrast, populations from Spain exhibit several differentiated lineages and are characterized by demographic equilibrium, while the Basque populations are the only ones harboring typical distinct haplotypes. The center of the star-like networks of both gene sequences is occupied by a common ancestral-like haplotype found in Brittany and Spain, which might have originated from the middle of Northern Spain (i.e. Asturias, eastern Lugo and western Cantabria). Estimates of the divergence time between the Spain-Brittany and Basque lineages strongly suggest that E. quimperiana survived the Pleistocene glaciations in distinct refugia on the Iberian Peninsula, one of which is situated in Picos de Europa, and the other in the Basque Country. The occurrence of a northern refugium in France cannot be rejected as of yet. Present results confirm the Iberian origin of the land snail E. quimperiana and strongly support the emerging phylogeographic hypothesis of multiple refugia in Iberia during the last glaciations. The scenario of a spatial expansion of E. quimperiana from an Iberian refuge located in Asturias to northern areas provides the most probable explanation for the present distribution of this land snail. By harboring distinct haplotypes, the Basque Country populations appear to be of great importance in terms of potential adaptation, long term persistence and hence, the conservation of E. quimperiana."}