{"doi": "https://doi.org/10.1038/217194a0", "year": 1968, "abstract": "THERE are very dense populations of Cepaea nemoralis, the polymorphic land snail, on the sand dunes of the nature reserve of Newborough Warren in Anglesey, Wales. They occur sporadically, chiefly in areas of dune colonized by Salix repens, and contain individuals of the usual phenotypes—yellow or pink and banded or unbanded. Some populations also contain considerable numbers of the brown phenotype. While sampling one of these populations with Dr K. Isarankura, glow-worms were occasionally to be found feeding on the snails. During a survey of the area at night, about thirty-three glow-worms were seen in an area of 10 m square, the actual population no doubt being denser than this. Glow-worms may therefore well be an important predator of Cepaea and if they preferred one phenotype to another they might have a strong selective effect. An experiment was set up to test for any preferences the glow-worms may have for particular phenotypes. A glow-worm was put in a bowl with a choice of two snails to eat. The choices were either of brown and banded yellow or of unbanded and banded yellow. The experiments were carried out in the autumn of 1965 and 1967. Table 1 gives the data when the choice was of brown and banded yellow and Table 2 the data for unbanded and banded yellow. The results show that both brown and unbanded yellow are preferred to banded yellow but that there is heterogeneity in the results for unbanded and banded yellow. If the data in Tables 1 and 2 are combined, the overall preference for brown or unbanded yellow becomes very significant (0.005>P>0.001); the heterogeneity in the combined data is not quite significant. If there is significant variation in the results of the experiments, it could be caused by a varying preference in different glow-worms. The data for 1967 were obtained by using some of the glow-worms more than once. The sequences of their choices were recorded: the data and their analysis are shown in Table 3. There is no evidence for a correlation between successive choices of a glow-worm and no evidence therefore for variation in preference between glow-worms."}