{"doi": "https://doi.org/10.4003/006.030.0118", "year": 2012, "abstract": "The equilibrium theory of island biogeography as originally proposed by R. MacArthur and E. O. Wilson relied on the ecological processes of colonization and extinction to determine the species diversity of islands. Although they were well aware of the potential contribution of speciation within-island to species diversity, MacArthur and Wilson's equilibrium model was purely ecological and did not incorporate the evolutionary process of diversification. This might seem surprising given that the best-known examples of adaptive radiation, the diversification of a single ancestral species into descendant species occupying a wide variety of ecological niches, are found on island systems. Recently, it has become possible to quantify the relative contribution of between-island colonization and within-island speciation to species diversity with the use of molecular phylogenies. By providing an estimate of the historical relationship among species, phylogenies can be used in combination with information on species' geographical distributions to infer the geographical zone of origin of species. Here I use this process-oriented analysis to determine the main predictors of diversification in three unique insular land snail lineages: the Galapagos Bulimulidae, the Hawaiian Succineidae and the Hawaiian Achatinellinae. I find that in Galapagos bulimulid land snails, species richness resulting from between-island colonization is mainly driven by island area and insularity, whereas species richness resulting from withinisland speciation is mainly determined by habitat heterogeneity. In contrast, I find that within-island species diversification is driven by island area in Hawaiian succineids, and the probability of speciation via between-island colonization in this group is significantly greater on younger islands. None of best multiple regression models proposed to explain variation in Hawaiian Achatinellinae species diversity were significant."}