{"doi": "https://doi.org/10.1371/journal.pone.0084527", "year": 2013, "abstract": "Ecophenotypes reflect local matches between organisms and their environment, and show plasticity across generations in response to current living conditions. Plastic responses in shell morphology and shell growth have been widely studied in gastropods and are often related to environmental calcium availability, which influences shell biomineralisation. To date, all of these studies have overlooked micro-scale structure of the shell, in addition to how it is related to species responses in the context of environmental pressure. This study is the first to demonstrate that environmental factors induce a bi-modal variation in the shell micro-scale structure of a land gastropod. Notodiscus hookeri is the only native land snail present in the Crozet Archipelago (sub-Antarctic region). The adults have evolved into two ecophenotypes, which are referred to here as MS (mineral shell) and OS (organic shell). The MS-ecophenotype is characterised by a thick mineralised shell. It is primarily distributed along the coastline, and could be associated to the presence of exchangeable calcium in the clay minerals of the soils. The Os-ecophenotype is characterised by a thin organic shell. It is primarily distributed at high altitudes in the mesic and xeric fell-fields in soils with large particles that lack clay and exchangeable calcium. Snails of the Os-ecophenotype are characterised by thinner and larger shell sizes compared to snails of the MS- ecophenotype, indicating a trade-off between mineral thickness and shell size. This pattern increased along a temporal scale; whereby, older adult snails were more clearly separated into two clusters compared to the younger adult snails. The prevalence of glycine-rich proteins in the organic shell layer of N. hookeri, along with the absence of chitin, differs to the organic scaffolds of molluscan biominerals. The present study provides new insights for testing the adaptive value of phenotypic plasticity in response to spatial and temporal environmental variations."}