{"doi": "https://doi.org/10.1371/journal.pone.0085384", "year": 2014, "abstract": "Manganese is one of the most abundant metal in natural environments and serves as an essential microelement for all living systems. However, the enrichment of soil with manganese resulting from industrial inputs may threaten terrestrial ecosystems. Several studies have demonstrated harmful effects of manganese exposure by cutaneous contact and/or by soil ingestion to a wide range of soil invertebrates. The link between soil manganese and land snails has never been made although these invertebrates routinely come in contact with the upper soil horizons through cutaneous contact, egg-laying, and feeding activities in soil. Therefore, we have investigated the direct transfer of manganese from soils to snails and assessed its toxicity at background concentrations in the soil. Juvenile Cantareus aspersus snails were caged under semi-field conditions and exposed first, for a period of 30 days, to a series of soil manganese concentrations, and then, for a second period of 30 days, to soils with higher manganese concentrations. Manganese levels were measured in the snail hepatopancreas, foot, and shell. The snail survival and shell growth were used to assess the lethal and sublethal effects of manganese exposure. The transfer of manganese from soil to snails occurred independently of food ingestion, but had no consistent effect on either the snail survival or shell growth. The hepatopancreas was the best biomarker of manganese exposure, whereas the shell did not serve as a long-term sink for this metal. The kinetics of manganese retention in the hepatopancreas of snails previously exposed to manganese-spiked soils was significantly influenced by a new exposure event. The results of this study reveal the importance of land snails for manganese cycling in terrestrial biotopes and suggest that the direct transfer from soils to snails should be considered when precisely assessing the impact of anthropogenic Mn releases on soil ecosystems."}