{"doi": "https://doi.org/10.1186/s12862-014-0223-y", "year": 2014, "abstract": "The Central and Southern European mountain ranges represent important biodiversity hotspots and show high levels of endemism. In the land snail genus Orcula Held, 1837 nine species are distributed in the Alps and a few taxa inhabit the Carpathians, the Dinarids and the Western Black Sea region. In order to elucidate the general patterns of temporal and geographic diversification, mitochondrial and nuclear markers were analyzed in all 13 Orcula species. We particularly aimed to clarify whether the Alpine taxa represent a monophyletic group and if the local species diversity is rather the result of isolation in geographically separated Pleistocene glacial refuges or earlier Tertiary and Quaternary palaeogeographic events. In order to test if patterns of molecular genetic and morphological differentiation were congruent and/or if hybridization had occurred, shell morphometric investigations were performed on the Orcula species endemic to the Alps. The phylogenetic trees resulting from the analyses of both the mitochondrial (COI, 12S and 16S) and the nuclear (H4/H3) data sets revealed three main groups, which correspond to the three subgenera Orcula, Illyriobanatica and Hausdorfia. The reconstruction of the historic geographic ranges suggested that the genus originated in the Dinarides during the Middle Miocene and first colonized the Alps during the Late Miocene, giving rise to the most diverse subgenus Orcula. Within the latter subgenus (including all Alpine endemics) almost all species were differentiated by both molecular genetic markers and by shell morphometrics, except O. gularis and O. pseudodolium. The present study confirms the importance of the Alps as biodiversity hotspot and origin center of land snail diversity. The species diversity in the subgenus Orcula was likely promoted by Miocene to Pliocene palaeogeographic events and the insular distribution of preferred limestone areas. In some cases, speciation events could be linked to the divergence of populations in glacial refuges during the Pleistocene. Sporadic contact between geographically separated and reproductively not yet isolated populations led to intermixture of haplogroups within species and even hybridization and mitochondrial capture between species."}