{"doi": "https://doi.org/10.1016/j.palaeo.2010.04.026", "year": 2010, "abstract": "Shells from over 280 collections representing all known forms of subgenus Poecilozonites (Zonitidae) from Bermuda have been ranked in stratigraphic order and relative-age aminostratigraphy. The samples were first grouped by their source lithostratigraphic unit, with additional refinements being made based on the epimerization ratio d-alloisoleucine/l-isoleucine or A/I from nearly 400 representative individual shells of each of the forms. A plot of A/I frequency defines several modes or “aminozones”. The aminozones correlate strongly with defined lithostratigraphy, with some minor variation resulting from less optimally preserved shells. The succession of land snails is ranked over chronological range from the middle and early Pleistocene, with greatest resolution since 500 ka. This > 500 ka age-range and density of sampling is among the most extensive for any organism on an oceanic island. Morphological analysis of Poecilozonites demonstrates oscillation and repetition of morphotypes over multiple sea-level cycles. Shells from the small island(s) that formed during interglacial times are generally small and show little variation in form. During glacial periods, when Bermuda reached maximal size, shells are much larger. Extreme variation in shell size and shape occurs at interglacial–glacial transitions in as little as 2–4 ka. Because the subgenus has been endemic to Bermuda for at least ca. 1000 ka, such dramatic and rapid shifts in shell morphology cannot be the result of recolonization from outside sources. An intact and undisturbed 130-ka-long biostratigraphic record of Poecilozonites is contained in a single, vertical 2 m-thick talus accumulation in Admirals Cave that has been dated at high resolution by three independent techniques. The bio- and chronostratigraphy show that snails were very large at the close of glacial stage marine isotope stage (MIS) 6, small during interglacial MIS 5, re-evolved identical large size during the last glaciation (MIS 4-2), and changed abruptly to the small paedomorphic modern form at the onset of the Holocene (MIS 2-1) about 10–12 ka ago. When assessed with care, shells of Poecilozonites may be used as guide fossils for rapid field identification of lithostratigraphic units in surface deposits and as chronological indicators in cave and fissure fills when used in combination with vertebrate remains."}