{"doi": "https://doi.org/10.1006/jipa.1995.1088", "year": 1995, "abstract": "The conical snail, Cochlicella acuta, is a major introduced pest of grain crops in southern Australia. In particular, C. acuta aestivates on the heads and upper stalks of crop plants thus fouling grain harvests in late spring - early summer. Previous attempts to control this snail pest included the release, during the early 2000s, of parasitic flies (Sarcophaga villeneuveana) sourced from southern France, within the perceived native distribution of C. acuta. The flies established in southern Australia, but only in very low numbers, such that there was no significant reduction in the snail’s pest status. Sequencing of the snail’s COI and 16S mitochondrial genes has now identified three main maternal lineages within C. acuta, across its distribution in south-western Europe and Morocco. The 1st lineage was only found in north-eastern Spain (near the Pyrenees), throughout southern France and in northern Italy. Both the 2nd and 3rd lineages were found in the U.K., western France, northern and southern Spain, Portugal and Morocco. The 3rd lineage was also collected throughout eastern Spain and just into southern France (near the Pyrenees). All the C. acuta found in Australia belong to the 3rd lineage. Highest levels of genetic diversity in C. acuta were found in the 3rd lineage, in particular in Morocco. A plausible explanation for the poor performance of the biological control agent previously released to control C. acuta in Australia is a mismatch between snail host and selected parasitoid. A different biotype or sub-species of S. villeneuveana, or even a different parasitoid species altogether, that attacks the 3rd lineage of C. acuta in south-western Europe or Morocco, could prove to be a more effective biological control agent than the S. villeneuveana previously released from southern France. Climates in southern Spain, southern Portugal and northern Morocco also best match those areas in southern Australia where C. acuta is a pest, suggesting further searches for effective natural enemies should be focussed there."}