{"doi": "https://doi.org/10.1371/journal.pone.0071783", "year": 2013, "abstract": "The effects of non-native species invasions on community diversity and biotic homogenization have been described for various taxa in urban environments, but not for land snails. Here we relate the diversity of native and non-native land-snail urban faunas to urban habitat types and macroclimate, and analyse homogenization effects of non-native species across cities and within the main urban habitat types. Land-snail species were recorded in seven 1-ha plots in 32 cities of ten countries of Central Europe and Benelux (224 plots in total). Each plot represented one urban habitat type characterized by different management and a specific disturbance regime. For each plot, we obtained January, July and mean annual temperature and annual precipitation. Snail species were classified into either native or non-native. The effects of habitat type and macroclimate on the number of native and non-native species were analysed using generalized estimating equations; the homogenization effect of non-native species based on the Jaccard similarity index and homogenization index. We recorded 67 native and 20 non-native species. Besides being more numerous, native species also had much higher beta diversity than non-natives. There were significant differences between the studied habitat types in the numbers of native and non-native species, both of which decreased from less to heavily urbanized habitats. Macroclimate was more important for the number of non-native than native species; however in both cases the effect of climate on diversity was overridden by the effect of urban habitat type. This is the first study on urban land snails documenting that non-native land-snail species significantly contribute to homogenization among whole cities, but both the homogenization and diversification effects occur when individual habitat types are compared among cities. This indicates that the spread of non-native snail species may cause biotic homogenization, but it depends on scale and habitat type."}