{"doi": "https://doi.org/10.1163/156854201x00143", "year": 2001, "abstract": "In helicid gastropods including Arianta arbustorum (LINNAEUS, 1758) sperm are reciprocally exchanged during copulation through spermatophores. A. arbustorum has been extensively investigated with respect to sexual selection and a considerable amount of data on sperm and spermatophore transfer are available. However, nothing is known about spermatophore formation and its possible influence on sperm exchange. As a contribution to the very limited knowledge on spermatophore formation in stylommatophoran gastropods in general and in order to complement the existing behavioural studies from a functional-anatomical point of view, we investigated spermatophore formation in A. arbustorum. Spermatophores were collected at certain intervals from 2 to 90 min after the onset of copulation either through forceful separation of the pairs (after which spermatophores were expelled by the snails) or through dissection of electrocuted and fixed animals. We found that spermatophore formation was initiated more or less synchronously in mating partners a few minutes after the onset of copulation and continued until shortly before transfer, which occurred after more than 60 min. Growth of the sperm container, which is probably mediated through the incoming ejaculate dilating the viscous, workable material secreted by the epiphallus, followed a saturation curve where the final length was reached slightly earlier than the final volume. However, growth and final size were not adjusted among partners confirming earlier findings that there is no sperm trading in A. arbustorum. Spermatophores collected from separated snails were larger than those from fixed individuals indicating that spermatophore formation is not immediately stopped after separation. This means that the former protocol is less precise for the investigation of spermatophore formation than a treatment involving rapid fixation. In A. arbustorum, spermatophore formation differs largely from that in the only other investigated helicid snail, Helix pomatia Linnaeus 1758, in which the container is assembled and the spermatophore transferred in less than 10 min."}