{"doi": "https://doi.org/10.1086/277067", "year": 1898, "abstract": "Previous articleNext article FreeVariation in the Shell of Helix Nemoralis in the Lexington, Va., ColonyJas. Lewis HoweJas. Lewis Howe Search for more articles by this author PDFPDF PLUS Add to favoritesDownload CitationTrack CitationsPermissionsReprints Share onFacebookTwitterLinkedInRedditEmail SectionsMoreDetailsFiguresReferencesCited by The American Naturalist Volume 32, Number 384Dec., 1898 Published for The American Society of Naturalists Article DOIhttps://doi.org/10.1086/277067 Views: 111Total views on this site Citations: 9Citations are reported from Crossref PDF download Crossref reports the following articles citing this article:Nina Gural-Sverlova, Roman Gural Shell colouration and different introductions of the land snail Cepaea hortensis (Gastropoda: Helicidae) into Western Ukraine, Folia Malacologica 30, no.44 (Dec 2022): 221–233.https://doi.org/10.12657/folmal.030.025N. V. Gural-Sverlova, R. V. Egorov Shell colour and banding polymorphism in Cepaea nemoralis(Gastropoda, Pulmonata, Helicidae) from the Moscow region, Ruthenica, Russian Malacological Journal 31, no.11 (Jan 2021): 27–38.https://doi.org/10.35885/ruthenica.2021.31(1).4N. V. Gural-Sverlova, R. I. Gural Polymorphism of the Introduced Snail Cepaea nemoralis (Gastropoda, Helicidae) from two Distant Parts of Eastern Europe: Accidental Similarity or Regularity?, Zoodiversity 55, no.55 (Jan 2021): 369–380.https://doi.org/10.15407/zoo2021.05.369JAMES MURRAY, BRYAN CLARKE The pale brown allele in Cepaea nemoralis, Biological Journal of the Linnean Society 36, no.1-21-2 (Jan 2008): 49–54.https://doi.org/10.1111/j.1095-8312.1989.tb00481.xMichael S Johnson, O Colin Stine, James Murray Reproductive compatibility despite large-scale genetic divergence in Cepaea nemoralis, Heredity 53, no.33 (Dec 1984): 655–665.https://doi.org/10.1038/hdy.1984.124Peter F. Brussard GEOGRAPHIC VARIATION IN NORTH AMERICAN COLONIES OF CEPAEA NEMORALIS, Evolution 29, no.33 (May 2017): 402–410.https://doi.org/10.1111/j.1558-5646.1975.tb00830.xAnn V Richards, James Murray The relation of phenotype to habitat in an introduced colony of Cepaea nemoralis, Heredity 34, no.11 (Feb 1975): 128–131.https://doi.org/10.1038/hdy.1975.13C. B. Goodhart GENETIC STABILITY IN POPULATIONS OF THE POLYMORPHIC SNAIL, CEPAEA NEMORALIS (L.), Proceedings of the Linnean Society of London 167, no.11 (Jun 2008): 50–67.https://doi.org/10.1111/j.1095-8312.1956.tb00766.xCaesar R. Boettger Die Entstehung von Populationen mit bestimmter Variantenzahl bei der LandschneckengattungCepaea Held, Zeitschrift für Induktive Abstammungs- und Vererbungslehre 58, no.11 (Dec 1931): 295–316.https://doi.org/10.1007/BF01740271"}