{"doi": "https://doi.org/10.1016/j.palaeo.2013.03.020", "year": 2013, "abstract": "Aragonitic and calcitic land snails from carbonate-rich paleosols in northwestern Lanzarote (Canary Islands) were analyzed for 13C/12C and 18O/16O ratios to deduce the Pleistocene–Holocene transition in the westernmost Sahara zone. Modern, mid-late Holocene (~ 2.1–5.5 cal ka BP) and late Pleistocene (~ 23.3–24.0 cal ka BP) aragonitic shells exhibited respective values of − 9.5 ± 1.6‰, − 7.7 ± 1.5‰, and − 2.3 ± 2.8‰ for δ13C; and + 0.3 ± 0.3‰, + 0.1 ± 0.7‰, and + 2.5 ± 0.4‰ for δ18O. Holocene and Pleistocene calcitic shells of the endemic slug Cryptella canariensis showed respective values of − 0.7 ± 2.6‰ and − 8.5 ± 2.5‰ for δ13C; and + 0.8 ± 1.5 and + 3.6 ± 0.4‰ for δ18O. Both aragonitic and calcitic shells showed equivalent temporal isotopic trends. Higher δ13C values during ~ 23.3–24.0 cal ka BP suggest higher abundance of C4 and/or CAM plants, likely associated with drier conditions and/or lower atmospheric CO2 concentration. Maximum shell δ18O values during ~ 23.3–24.0 cal ka BP opposes minimal values of Greenland ice cores and probably reflect the combined effects of (1) higher rain δ18O values linked to higher glacial seawater δ18O values and/or larger snail activity during summer seasons; (2) relative humidity values similar or slightly lower than at present; (3) higher evaporation rates; and (4) cooler temperatures. Bone remains of the extinct Dune Shearwater Puffinus holeae were only recovered from the Holocene bed. Collagen δ13C and δ15N values (− 13.5 ± 0.2‰[PDB] and + 13.7 ± 1.0‰[air], respectively) match with the signature of a low trophic level Macaronesian seabird that fed upon local fish. Bone carbonate δ13C (− 7.4 ± 1.0‰[PDB]) and phosphate δ18O (+ 18.2 ± 0.4‰[SMOW]) values exhibited pristine signals denoting their potential value in future paleoenvironmental studies in the region. The age of P. holeae (~ 2.1–2.7 cal ka BP) supports that the aboriginal population possibly caused its extinction. In contrast, the extinction of the endemic helicid Theba sp. (~ 23.3–24.0 cal ka BP) was likely caused by environmental change."}