{"doi": "https://doi.org/10.1016/j.quaint.2012.06.037", "year": 2013, "abstract": "The Marroquíes archeological site, located in the metropolitan area of Jaén (37°46′), southern Spain, contains land snail shells which have been preserved jointly with other human and zooarcheological remains. New radiocarbon analyses carried out on pristine domestic animal and human bones confirmed that these remains belong to the Copper Age interval (∼4470–3880 cal BP; n = 8). Land snail entire shells of two species (one herbivorous and one omnivorous) were analyzed for 13C/12C and 18O/16O ratios to estimate the paleoenvironmental conditions prevailing during the middle to late Holocene in the southernmost part of Europe. The δ13C values of fossil shells ranged from −13.8‰ to −8.1‰ (n = 15), whereas modern specimens ranged from −10.8‰ to −8.6‰ (n = 20). The fact that ancient and modern shells generally exhibited similar δ13C values suggests that the δ13C values of the vegetation have remained relatively stable during ∼4470–3880 cal BP and the present. Snail species did not differ in δ13C values despite their differing dietary habits. The δ18O values of fossil shells ranged from −4.9‰ to −1.2‰ (n = 15), whereas modern specimens ranged from −2.8‰ to +0.9‰ (n = 20). Fossil shells were, on average, ∼2‰ lower in δ18O values than modern shells. Calculations from a snail evaporative steady-state flux balance model suggest that shells at ∼4470–3880 cal BP precipitated under appreciably higher relative humidity conditions than today, whereas rain δ18O values and air temperatures at the soil–air interface during snail active period were possibly similar. Although samples from this study represent a time-period in which the well-documented late Holocene aridification trend in southern Spain already started, snails suggest conditions at ∼4470–3880 cal BP were yet noticeably wetter than at present. This study shows that land snail shells preserved in Holocene archeological sites offer valuable paleoenvironmental information in their isotope codes."}