{"doi": "https://doi.org/10.1111/j.1095-8312.2000.tb01667.x", "year": 2000, "abstract": "Reproductive traits of the land snail Helix aspersa Mtiller were investigated under artificial conditions from two samples, one collected from a population exposed to unpredictable human pressures in its natural environment, i.e. a recently created polders area with intensive agriculture, and the other from a snail farm in which animals were reared under constant conditions denned as ‘optimal’ for growth and reproduction. Results were compared with data collected from natural populations of the same region (Brittany) and from habitats spanning the environmental heterogeneity of the range of the species. A large part of the variation among populations could be explained by different phenotypic covariances between shell size, clutch size and egg size, but not by the number of clutches per snail. Thus, the higher egg production of snails from the polders was related to (i) a strong correlation between clutch size and shell size, shell size being in the upper limit of the overall range for the region concerned; (ii) an uncommonly low egg weight in comparison with the ‘norm’ of Helix aspersa, this trait seeming to be involved in a trade-off with clutch size. Second clutches were smaller than the first ones, but their eggs were significantly heavier. This difference may be linked to a size-dependent mortality of juveniles during winter which arises in all populations in which hibernation occurs as an adaptation to low temperatures. In addition to the selective regime usually involved for populations of helicid snails from Western Europe, several unpredictable mortality factors occurred in the polders area: herbicide and pesticide treatments (lethal for young snails), human predation (lethal for adults) and burning (letiial for all snails). Life-history patterns of Helix aspersa are discussed in relation to its ability to successfully colonize a large range of habitats modified by humans, to such an extent that it can become a pest."}