{"doi": "https://doi.org/10.1111/j.1365-2699.2006.01508.x", "year": 2006, "abstract": "Abstract Aim To investigate the importance of vicariance in shaping land snail faunas. Location Three data sets of Mediterranean land snails were analysed: Helicoidea of the Iberian Peninsula and the complete land snail faunas of the central and eastern Aegean Islands and of Israel and Palestine. Methods The vicariance model predicts a clustering of species ranges. We tested for clustering of species ranges with a Monte Carlo simulation. For this simulation we used a null model that generates range data sets in such a way that their range size distribution, their species richness distribution and the spatial autocorrelation of the ranges approximate the parameters in the real data set. Biotic elements (clusters of species ranges) were delimited with model‐based Gaussian clustering. A second prediction of the vicariance model is that closely related species belong to different biotic elements. This was tested with a chi‐squared test. Results The distribution areas of the Iberian Helicoidea and the Israeli/Palestinian land snails are significantly clustered. The same is true for Israeli/Palestinian land snail species belonging to groups with geographically restricted species. However, the clustering is not significant in the complete central and eastern Aegean land snail data set, the Iberian Helicoidea species, and the central and eastern Aegean land snails belonging to groups with geographically restricted species. Contrary to the prediction of the vicariance model, closely related Iberian Helicoidea species and Israeli/Palestinian land snails belong significantly more often to the same biotic element than expected by chance. The null hypothesis that closely related species are homogeneously distributed across biotic elements cannot be rejected only for the data set that includes the Israeli/Palestinian land snails belonging to groups with geographically restricted species. Main conclusions The patterns found in the central and eastern Aegean land snail and the Iberian Helicoidea data sets do not correspond with the predictions of the vicariance model. This indicates that speciation modes other than vicariance were frequent, or that the distribution areas of many species in these faunas were largely modified by extensive post‐speciation dispersal and/or regional extinction. Hardly any possible vicariance events that might have contributed to the origin of the observed biotic elements in the Israeli/Palestinian land snail fauna could be identified. On the contrary, the biotic elements of the Israeli/Palestinian land snail fauna correspond with ecological factors. Vicariance has had only a limited influence on current biogeographical patterns in Mediterranean land snails."}