{"doi": "https://doi.org/10.1111/j.1365-2699.2005.01322.x", "year": 2005, "abstract": "Abstract Aim To test the performance of the choros model in an archipelago using two measures of environmental heterogeneity. The choros model is a simple, easy‐to‐use mathematical relationship which approaches species richness as a combined function of area and environmental heterogeneity. Location The archipelago of Skyros in the central Aegean Sea (Greece). Methods We surveyed land snails on 12 islands of the archipelago. We informed the choros model with habitat data based on natural history information from the land snail species assemblage. We contrast this with habitat information taken from traditional vegetation classification to study the behaviour of choros with different measures of environmental heterogeneity. R 2 values and Akaike's information criterion (AIC) were used to compare the choros model and the Arrhenius species–area model. Path analysis was used to evaluate the variance in species richness explained by area and habitat diversity. Results Forty‐two land snail species were recorded, living in 33 different habitat types. The choros model with habitat types had more explanatory power than the classic species–area model and the choros model using vegetation types. This was true for all islands of the archipelago, as well as for the small islands alone. Combined effects of area and habitat diversity primarily explain species richness in the archipelago, but there is a decline when only small islands are considered. The effects of area are very low both for all the islands of the archipelago, and for the small islands alone. The variance explained by habitat diversity is low for the island group as a whole, but significantly increases for the small islands. Main conclusions The choros model is effective in describing species‐richness patterns of land snails in the Skyros Archipelago, incorporating ecologically relevant information on habitat occupancy and area. The choros model is more effective in explaining richness patterns on small islands. When using traditional vegetation types, the choros model performs worse than the classic species–area relationship, indicating that use of proxies for habitat diversity may be problematic. The slopes for choros and Arrhenius models both assert that, for land snails, the Skyros Archipelago is a portion of a larger biogeographical province. The choros model, informed by ecologically relevant habitat measures, in conjunction with path analysis points to the importance of habitat diversity in island species richness."}