{"doi": "https://doi.org/10.1016/j.palaeo.2012.09.019", "year": 2013, "abstract": "The 13C/12C and 18O/16O ratios of modern and fossil shells of two ecologically-distinct land snail taxa (Cerionidae and Annularidae) from San Salvador Island were analyzed to estimate the interglacial Pleistocene and Holocene paleoenvironmental conditions in the Bahamas. The average δ13C value of Cerion was − 5.0 ± 1.8‰ for modern (~ 0–0.1 ka) specimens, − 4.3 ± 0.7‰ for late Holocene (~ 2–4.6 ka) individuals, − 3.4 ± 1.6‰ for middle Holocene (~ 5–6.3 ka) shells, − 4.0 ± 1.5‰ for ~ 85 or ~ 110 ka specimens, and − 3.6 ± 0.4‰ for individuals that grew during OIS 5e (~ 125 ka). Annularidae specimens displayed average δ13C values of − 6.3 ± 2.5‰, − 6.1 ± 1.0‰, − 2.4 ± 1.0‰, − 4.4 ± 1.1‰, and − 5.0 ± 2.9‰, respectively. These results suggest that snails consumed C3 and C4 plants arbitrarily through time, however, higher proportion of C4 plants may have been consumed in the past compared to the present. Cerion was ~ 1‰ higher in average δ13C value than Annularidae specimens for some time-intervals, indicating greater C4 plant consumption and/or higher ingestion of carbonate-rich sediments. The average δ18O value of Cerion was − 0.5 ± 0.8‰ for modern individuals, − 0.5 ± 0.5‰ for late Holocene specimens, − 0.8 ± 0.2‰ for middle Holocene shells, − 0.4 ± 0.6‰ for ~ 85 or ~ 110 ka specimens, and − 0.3 ± 0.6‰ for OIS 5e individuals. Annularidae individuals exhibited average δ18O values of − 0.7 ± 0.8‰, − 0.5 ± 0.9‰, − 0.9 ± 0.3‰, − 0.3 ± 0.6‰, and − 0.9 ± 0.9‰, respectively. These results point to similar atmospheric conditions over time-intervals when shell was deposited. The shell δ18O values did not significantly differ between species despite the apparent differences in lifestyle. Calculations from a snail evaporative steady-state flux balance model and proxy data suggest that modern individuals deposited shell at air temperatures of ~ 24–25 °C, ambient water δ18O values between − 4.5‰ and − 3.5‰ (SMOW), and relative humidity of ~ 87–89%. Late to middle Holocene and interglacial late Pleistocene shells appear to have precipitated under a similar environmental setting. Overall, atmospheric conditions during these Quaternary interglacial time-intervals at coastal sites of San Salvador were largely comparable to the present. This apparent environmental similarity is consistent with the relatively comparable snail richness and diversity observed at those same locales and time-intervals."}