{"doi": "https://doi.org/10.1098/rstb.1993.0006", "year": 1993, "abstract": "Fossil land snails have been sampled from the aeolianite (indurated dune) deposits east of Caniçal, eastern Madeira. Eight sections, comprising a 40 m sequence, were studied. Dating of material was carried out using 14 C (conventional and accelerator mass spectroscopy), amino acid epimerization and U -Th techniques. The sequence is not continuous, but spans the period from middle Pleistocene ( ca . 300 ka before present (BP)) to recent. Quantitative samples of shells were taken from all the fossiliferous horizons. Forty-three species are recorded in 51 samples, with an average of 14.3 species per sample. Most of the species (29 in 43) occur throughout the sequence, showing that the fauna was established by the middle Pleistocene. Analysis of faunal similarity shows that although there is some mixing and redeposition, five groups of samples may be distinguished. These date from V and IV: latest Holocene (post colonization), III: middle Holocene (7000-3500 years b p), II: late Pleistocene (135-45 ka b p) and I: middle Pleistocene (ca. 300-135 ka BP). Some European species ( Punctum pygmaeum, Plagyrona placida ) are present throughout the series, whereas others ( Theba pisana, Cochlicella barbara ) only appear in the most recent sediments. Some endemics are limited to part of the sequence. The earliest samples have good representation of grassland species. The composition then shifts towards woodland species and later returns to a grassland species, probably as a result of disturbance by man. The faunal changes over the course of the Quaternary are quite substantial, being comparable to those seen in mainland faunas in the temperate zone, and indicate a major influence of climatic change. Arrival of some species between 45 and 8 ka BP may be associated with lowered sea level and closer proximity of Madeira to the Deserta islands, but there is also evidence of species exchange between Madeira and the more distant island of Porto Santo, separated from it by a deep ocean floor. These findings provide information on the faunal exchanges and progressive evolution which have resulted in very high molluscan species diversity in the Madeiran archipelago."}