{"doi": "https://doi.org/10.1080/13235818.2014.948147", "year": 2014, "abstract": "AbstractMount Kaputar is an isolated high-elevation mesic refuge on the dry inland western slopes of eastern Australia's Great Dividing Range. A field survey in Mount Kaputar National Park in 2007–2014, and collation of existing information, identified a native land snail fauna of 24 species (seven families), including nine endemic taxa and another two occurring as disjunct populations. Additional species probably remain to be identified. Two introduced species of agriolimacid slugs were also recorded. Information from this study was the basis of the successful listing of an endangered land snail community at Mount Kaputar under state threatened species legislation in 2013; the first legal listing of an endangered land snail community in Australia. The recognition of endangered communities is a useful intermediate scale between the extremes of the single-species and broad-landscape conservation approaches, and has significant potential for multi-species conservation initiatives for terrestrial gastropods. Anthropogenic climate change is the most significant threat to this community, with a 100 m rise in environmental envelope likely to reduce the available area of habitat by over 50%. This community, and, in particular, a bright pink endemic athoracophorid slug, is contributing to raising public awareness of the threat to global biodiversity from anthropogenic climate change.Keywords: anthropogenic climate changeendemismhighland refugiaNandewar bioregionspecies richness AcknowledgementsJess Murphy helped with field work. John Stanisic, Mandy Reid and Janet Waterhouse provided records from the Queensland Museum and Australian Museum collection databases, and John Stanisic also provided additional detail on undescribed taxa. Jurgen Achilles helped with GIS analysis and Jess Stokes provided information on Mount Kaputar NP. John Stanisic, Winston Ponder, Andrew Rawson, Gary Barker, Mandy Reid and Jonathan Parkyn provided support for the EEC nomination. Jacki Roberts helped with media. Jonathan Parkyn, Winston Ponder and an anonymous reviewer provided constructive comments on a draft of this paper. Sue Murphy helped with proofreading. Fieldwork, data analysis, the EEC nomination and manuscript writing by the senior author was self-funded. Species identification work by the junior author was funded by the Australian Museum."}