{"doi": "https://doi.org/10.1016/j.gca.2003.10.027", "year": 2004, "abstract": "A simple flux balance model with a diffusive, evaporative boundary layer indicates that the time constant (characteristic time) for approach to oxygen isotope steady state in the body fluid of land snails is ∼19 min or less. These comparatively short times support an assumption that the snail’s aragonitic shell is commonly precipitated from a body fluid that is at, or near, isotopic steady state. The model indicates that the steady-state δ18O value of snail shell carbonate depends upon the temperature, relative humidity, δ18O of the input liquid water, and δ18O of ambient water vapor. Model shell δ18O values were calculated for the warm, wet months corresponding to times of snail activity at some European sites. Linear regression of these predicted values against published, measured values yielded the expression: δ18Ocalc = 0.93(±0.13) δ18Omeas −0.9(±0.2), with r2 = 0.65. As indicated by the value of r2, there is scatter in the relationship, but the slope and intercept are close to one and zero, respectively, which lends credence to the model. Therefore, temporal or spatial changes recorded in the δ18O values of land snail shells appear to be selectively seasonal—commonly the warm, wet months—and include the effects of relative humidity. For carbon, the time constant for approach to isotopic steady state in the bicarbonate dissolved in the body fluid of land snails is predicted to be ∼16 min or less. New and published δ13C measurements of aragonite shell and associated organic matter exhibit an overall correlation, but with considerable scatter. As noted by previous workers, 13C-rich dietary “limestone” may account for some of the scatter. Additional scatter, according to the model presented herein, could arise from changes in the proportion of total oxidized carbon that is expelled by the snail as bicarbonate dissolved in body fluid (i.e., effects of relative changes in metabolic rates). These results affirm the need for caution in the interpretation of δ13C values of land snail aragonite shells solely in terms of dietary proportions of C3 and C4 plants."}