{"doi": "https://doi.org/10.1111/jbi.12147", "year": 2013, "abstract": "Abstract Aim Camaenidae are amongst the most diverse land snail groups in Southeast Asia and Australasia, but their phylogeny and biogeography are poorly understood. The monophyly and biogeographical origin of the Australian species has remained uncertain. Being reported from north‐western Australia as well as from the Lesser Sunda Islands, the genus Rhagada is crucial to our understanding of camaenid biogeography. By resolving the phylogeny of Rhagada , we aim to uncover spatial and temporal patterns of its diversification at the interface between Oriental and Australian biogeographical regions. Location North‐western Australia, Lesser Sunda Islands. Methods We implemented Bayesian and maximum likelihood methods to generate the most complete mitochondrial phylogeny of Rhagada land snails to date. Divergence times of clades were estimated by employing a relaxed molecular clock and two internal calibrations from fossil and tectonic data. Ancestral areas of clades were inferred using character history reconstruction based on parsimony, as implemented in Mesquite . Results Rhagada clustered into eight well‐supported clades that are restricted to certain geographical areas. Species from the Kimberley, Western Australia, formed the earliest branching clades. A single Lesser Sunda clade was sister to a radiation in the Western Australian Pilbara. Molecular age estimates placed the evolutionary origin of Rhagada between the late Miocene and early Pleistocene, and dispersal from Western Australia onto the Lesser Sunda Islands in a period between the mid‐Pliocene and early Pleistocene. Main conclusions The camaenid Rhagada originated in the Kimberley and subsequently expanded its range through the Pilbara and into the Shark Bay area, probably during the late Pliocene and mid‐Pleistocene. From the Kimberley, Rhagada snails colonized the Lesser Sunda Islands probably not before 1.9 Ma following emergence of the youngest islands, which may have acted as ‘stepping stones’. Over‐sea dispersal might have occurred during the mid‐Pleistocene when lowered sea levels facilitated faunal exchange across the region."}