{"doi": "https://doi.org/10.15517/rbt.v61i4.12850", "year": 2013, "abstract": "Cuba has one of the richest land snail faunas of the world. This important fact has promoted different kind of studies on this group to promote conservation programs, from which many studies have directed their efforts to inventories, and population and community ecology. To contribute with this population knowledge, we studied land snails assemblages in three karstic elevations at the “Escaleras de Jaruco-Tapaste-Cheche” Natural Protected Landscape, Mayabeque, Cuba. We aimed to analyze the variation of the composition and structure of the assemblages between the rainy and little rainy months. The study was conducted from August to November 2009 and from January to April, 2010, in ten permanent square plots (9m2) separated for over 20m, on each elevation (Beluca, La Chirigota and La Jaula). In each plot, only live individuals were registered (physiologically active and at rest) to obtain species richness and abundance; besides, temperature (oC) and relative humidity (%) were also considered in each plot. A total of 4 248 individuals were observed which comprised two subclasses, five orders, 11 families, 20 genera and 21 species of terrestrial molluscs. From the total, 19 were Cuban endemics and eight were exclusive from Mayabeque, Matanzas. The Jaula showed the greater riches with 19 species, followed of Beluca with 17, and The Chirigota with 15. In the rainy months, La Jaula, showed individual’s greater abundance with 1 707, followed of Beluca with 1 305 and La Chirigota with 1 236. We observed differences in the population density in the three elevations between the rainy and little rainy months, which can be due to the climatic adverse conditions that are shown at the little rainy months. Additionally, during the survey we observed dominance of prosobranch species over the pulmonates. The specific abundance curves showed a steep slope, although was major in the rainy months in relation to the little rain months, which indicates the presence of dominant, common and rare species in the assemblages. In this study, it was demonstrated than the riches and the abundance of land snails in all three elevations, was favored for the elevated relative humidity and the air temperature during the rainy months. These environmental conditions resulted fundamental for the survival of these terrestrial gastropods, as the reproduction and search of food were favored."}