{"doi": "https://doi.org/10.1111/j.0030-1299.2005.13400.x", "year": 2004, "abstract": "We set up two alternative hypotheses on how environmental variables could foster nestedness; one of “nested habitats” and another of “nested habitat quality”. The former hypothesis refers to situations where the nestedness of species depends on a nestedness of discrete habitats. The latter considers situations where all species in an assemblage increase in abundance along the same environmental gradient, but differ in specialisation or tolerance. We tested whether litter‐dwelling land snails (terrestrial gastropods) in boreal riparian forest exhibited a nested community structure, whether such a pattern was related to differences in environmental variables among sites, and which of the two hypotheses that best could account for the found pattern. We sampled litter from 100 m 2 plots in 29 mature riparian forest sites along small streams in the boreal zone of Sweden. The number of snail species varied between 3 and 14 per site. Ranking the species‐by‐site matrix by PCA scores of the first ordination axis revealed a similarly significant nested pattern as when the matrix was sorted by number of species, showing that the species composition in this meta‐community can be properly described as nested. Several environmental variables, most notably pH index, were correlated with the first PCA axis. All but two species had positive eigenvectors in the PCA ordination and the abundance increased considerably along the gradient for most of the species implying that the hypothesis of “nested habitats” was rejected in favour of the “nested habitat quality” hypothesis. Analyses of nestedness have seldom been performed on equal sized plots, and our study shows the importance of understanding that variation in environmental variables among sites can result in nested communities. The conservation implications are different depending on which of our two hypotheses is supported; a conservation focus on species “hotspots” is more appropriate if the communities are nested because of “nested habitat quality”."}