{"doi": "https://doi.org/10.1016/j.quageo.2009.09.005", "year": 2010, "abstract": "Abstract Despite the nearly 600 named species of the land snail Cerion , studies of the geological and paleontological framework of modern species are few. To address this deficiency, the biostratigraphic succession of Cerion was investigated at several areas on Long Island, Bahamas. A chronostratigraphic framework was developed through whole-rock and Cerion land snail aminostratigraphies. About 175 individual Cerion shells from last interglacial and Holocene deposits were age-ranked using stratigraphic position and amino acid racemization (AAR) geochronology. AAR ages were generated using an existing AAR- 14 C age model for Cerion from the central Bahamas. The age structure of Cerion fossils in sediments was determined with AAR ages, and the magnitude of “dead carbon” anomalies was evaluated using this chronological approach. Temporal changes in gross shell morphology were examined from four study areas. The last interglacial, marine isotope stage/substage (MIS) 5e (Aminozone E) is characterized by generally large shells and in some cases, bimodal sets of very small (α shells) and very large forms (β shells) coexisting in the same stratigraphic levels (primarily soils), which may encompass the transition from between MIS 5e and 5d/c. Similar bimodality of nearly identical α and β shell forms and sizes is observed at other late MIS 5e sites from the furthest reaches of Great Bahama Bank (including Long, Exumas, Eleuthera, and New Providence Islands). The widespread distribution of α and β forms in soils capping MIS 5e marine and eolian deposits implies that there may have been a synchronous, regional morphological convergence on Great Bahama Bank. None of these forms are observed in Holocene deposits of Aminozone A. The earliest MIS 1 Cerion appear in a oolite deposited 6500 a BP, and are of intermediate size compared to the Pleistocene α and β forms. As MIS 1 progressed, the diversity of shell sizes and shapes increased into modern times. The greater variety of shell forms over the past 1000–2000 a suggests that humans may have played a role in the introduction and redistribution of Cerion across the region. The potential for frequent and widespread human introductions, combined with the propensity of Cerion to hybridise freely may explain the farrago of shell sizes and shapes in the recent snail faunas of Long Island and other Bahama islands."}