{"doi": "https://doi.org/10.1016/j.ympev.2013.01.011", "year": 2013, "abstract": "Clausiliidae is one of the most speciose and best-studied families of land snails. The family contributes to land snail diversity on a global scale, with three main centres of diversity: (1) western Eurasia (six subfamilies recognized), (2) East Asia (two subfamilies recognized) and (3) the neotropics (one subfamily recognized i.e. Neniinae). Despite a wealth of shell-morphological and anatomical studies, a well-supported phylogeny is lacking for the family. To provide a phylogenetic framework and reevaluate morphological and biogeographic observations on the family, we compiled a dataset consisting of partial 28S rRNA, histone H3 and histone H4 nucleotide sequences covering all clausiliid subfamilies, and 23 out of 25 tribes. Our analyses (MrBayes, BEAST, PhyML) divide the family into seven highly supported clades, which were retrieved by at least two of the three markers used, and which are more or less geographically confined. Three of these clades coincide with subfamilies recognized in the current classification (Alopiinae, Garnieriinae, Laminiferinae). The monophyly of four of the remaining six hitherto accepted subfamilies is not supported, with the New World subfamily Neniinae divided across two clades. All shell-morphological characters used in classical clausiliid classification were homoplasious at the subfamily level, with the exception of the type of shell aperture formation. In contrast to previous interpretations, our results suggest that the so-called ‘apostrophic’ aperture found in the neotropical clausiliids, and in a European (Laminiferinae) and a SE Asian (Garnieriinae) subfamily, is in fact the plesiomorphic condition among extant Clausiliidae. The widespread and fragmented geographic distribution of this type of aperture may therefore be considered relictual. Based on an inferred Late Cretaceous or Early Cenozoic European origin of the clade of extant Clausiliidae, the ancestor(s) of the neotropical Clausiliidae must have colonized the New World after the Atlantic Ocean had opened. A taxonomic revision is proposed."}