{"doi": "https://doi.org/10.1038/hdy.2011.88", "year": 2011, "abstract": "In a famous personification of natural selection, Darwin (1859, p 84) described it as ‘daily and hourly scrutinising […] every variation, even the slightest; rejecting that which is bad, preserving and adding up all that is good; silently and insensibly working, whenever and wherever opportunity offers'. He was despondent, however, of the possibility of actually observing the process, as he wrote, ‘We see nothing of these slow changes in progress, until the hand of time has marked the long lapse of ages'. One and a half centuries of evolutionary research have proved Darwin overly pessimistic; numerous studies, particularly over the past 50 years, have shown that evolutionary change can be detected in what Slobodkin (1961) called ‘ecological time', that is, across time-spans of the order of 10 generations (Endler, 1986; Schoener, 2011). However, even those studies often fall short of real-time monitoring of evolutionary change and of observing natural selection's ‘daily and hourly' scrutiny. In this issue, Johnson (2011) provides a rare example of such an observation in an invertebrate.\r\n\r\nFor 34 consecutive years, Johnson and his yearly band of undergraduate genetics and evolution students monitored a population of the land snail Theba pisana straddling the interface between Acacia thickets and coastal dune habitat near Perth, Australia. T. pisana (that was introduced into Australia from Europe in the 1890s) is related to the well-known model snail Cepaea, and, like it, shows a genetically determined shell colour polymorphism, with some individuals having the upper surface of the shell adorned with dark brown bands, while others have the top of the shell unbanded. In addition, T. pisana varies in the colour of the apex of the shell (the whorls laid down when it was a baby), which may be dark or pale.\r\n\r\nEvery year, the researchers would sample snail populations along a fixed transect, the centre of which coincided with the habitat transition. For each of the over 90 000 adult snails recorded, they scored the banding pattern and (during the past 22 years only) also apex colour. The results show two things. First, that year after year, snails in the closed habitat were consistently darker-tipped and more banded (that is, darker overall) than in the open habitat; a pattern that is also known for other land snails, like Cepaea, and that is driven by crypsis and/or the shells' thermal properties (Ozgo, 2011; Silvertown et al., 2011). Johnson was able to show that this parallel response in both traits was partly due to genetic linkage between the two main genes controlling apex colour and banding, partly also to independent responses.\r\n\r\nA second, equally interesting result was found in an analysis of the impact of climate on shell traits. As the snails take 2 years to mature, the snail data of a particular year were compared with weather records averaged across the 2 preceding years. As it turned out, hot and dry summers yielded more unbanded snails immediately afterwards, probably the result of heat stress affecting the darker, heat-absorbing banded snails. Apex colour, on the other hand, responded only to winter conditions, with paler apices rising after dry winters—a result for which the mechanism remains a mystery. Interestingly, these responses were very weak most of the time (yearly selection coefficients below 5%), but much stronger (up to 33%) in certain years.\r\n\r\nAlthough Johnson could not identify the actual causes of death for the snails, and in that sense the study does not reach the level of biological detail of, for example, the Grants' studies on Galapagos finches (Grant and Grant, 2008), it is a very valuable contribution to a precariously small collection of longitudinal studies of evolution in invertebrates. In fact, the only other invertebrate study system for which similarly rich data are available is the classic one of wing colour polymorphism in the peppered moth, Biston betularia (Cook, 2003). Nonetheless, if this body of work is to grow, it is likely that further new studies will also feature land snails. These invertebrates have a number of characteristics that make them ideal study subjects (Schilthuizen, 2002): their proverbially slow dispersal makes that their evolutionary play is enacted on a small stage (Johnson's T. pisana transect was just 275 m long); individuals can be easily ‘captured and recaptured', selection is extremely local, making responsible agents identifiable and acts of selection observable. Moreover, snail shells provide the malacologist with enviable opportunities: juvenile morphology remains observable in the adult, marking is easy and permanent, and deaths are recordable, as is (when it results in shell damage) the actual cause of death. These features together with a wealth of genetically based colour polymorphisms indicate that the potential for snails as model study organisms remains largely untapped.\r\n\r\nIn support of this view, the citizen science ‘Evolution Megalab' (http://www.evolutionmegalab.org), which began in 2009, and which allows volunteers to record colour morphs in Cepaea snails online (Silvertown et al., 2011), may become the first continent-wide evolution monitoring program. The success of the Megalab thus far has already led to a small revival of population studies of Cepaea. It is to be hoped that eventually these studies move beyond classical population genetics and the resampling of populations investigated in the wave of Cepaea work of the 1950s–1970s, and embark on year-by-year longitudinal studies like the one by Johnson. Better still, keeping track of individual snails, their deaths and the causes thereof over the years, analogous to the Grants' pioneering Galapagos studies, would allow rare insights into the action of natural selection in wild invertebrate populations—and the ‘daily and hourly' impact of the environment (and environmental change!) on evolution."}