{"doi": "https://doi.org/10.1111/j.1365-2656.2010.01685.x", "year": 2010, "abstract": "1. We investigated whether coexisting snail species in 145 treeless fen communities in the Western Carpathian Mountains differed more in size and diet than would be expected by chance, as predicted for traits commonly associated with competition and differential resource acquisition under limiting similarity theory. 2. Contrary to expectations, coexisting snail species were no more different in body size than expected by chance under a null model. However, variation in body size played a significant role in structuring snail communities: coexisting snail species were significantly more similar with respect to body size. 3. We developed two new test statistics to expand our investigation of limiting similarity to include diet, a nominal trait. We tested whether communities of snails were characterized by a greater richness of diet, and whether different diets were represented more or less evenly within communities. Communities of snails were significantly less evenly distributed than expected by chance, with detritivores being over-represented relative to predatory strategies. 4. We also examined the effect of water pH and conductivity, herbaceous cover, and bryophyte and vascular plant richness, on these trends by examining how the effect size of our tests varied across these gradients. Convergence in species size increased with increasing habitat pH. Specifically, smaller snail species were over-represented in fen communities in general, and this effect was accentuated in increasingly calcareous fens. 5. Theory predicts that traits related strongly to environmental conditions are more likely to be convergent. Our findings support this suggestion, as small snail species have an advantage in tolerating freezing conditions over winter when refuges are limited. 6. These results add to the growing body of literature demonstrating that variation in body size and diet play a strong role in structuring communities, although frequently in ways not predicted by limiting similarity theory. Finally, our results increase our understanding of how species are assembled non-randomly into communities with respect to important traits."}