{"doi": "https://doi.org/10.3897/zookeys.487.8463", "year": 2015, "abstract": "The minute (adult size 1.3–4.8 mm) land snail species of the family Diplommatinidae in the Fiji archipelago are revised based on historical material and modern (1998–99) collections targeting limestone outcrops on the largest island, Viti Levu, and several smaller islands in the Lau group. The forty-two species (including 30 new species) belong to the genera Moussonia Semper, 1865, Palaina Semper, 1865 and Diancta Martens, 1867, which are briefly characterized and keyed. The diagnostic structure of the inner lamellar system of each species is illustrated. All species except one are endemic to Fiji. In Viti Levu, the 12 localities surveyed each had 1–13 (average 5) species of Diplommatinidae; ten species were each found at a single site only. In the Lau islands, five islands were visited, with 1–4 species per island; four species are known from single islands. The number of historically known species not recollected in 1998–99 (7 species), the number of single-site occurrences (14 species), and the numerous islands — including limestone islands — that have not been surveyed at all, indicate that the 42 species of Diplommatinidae currently known from Fiji represent perhaps only half of the Fiji diplommatinid fauna. Such numbers approach the diplommatinid diversity of Palau (39 described and more than 60 undescribed species), and surpasses by far the diversity of other South Pacific archipelagos of comparable land area (New Caledonia, Vanuatu, Samoa). Nomenclatural acts: Lectotypes designated: Diplommatina fuscula, D. fuscula var. vitiana, D. godeffroyana, D. godeffroyana var. latecostata, D. tuberosa, D. martensi var. macrostoma, all Mousson, 1870. Neotypes designated: Diplommatina subregularis, D. ascendens, D. quadrata, all Mousson, 1870. New species: Diancta aurea sp. n., Diancta aurita sp. n., Diancta basiplana sp. n., Diancta controversa sp. n., Diancta densecostulata sp. n., Diancta dextra sp. n., Diancta dilatata sp. n., Diancta distorta sp. n., Diancta pulchella sp. n., Diancta rotunda sp. n., Diancta subquadrata sp. n., Diancta trilamellata sp. n., Moussonia acuta sp. n., Moussonia barkeri sp. n., Moussonia brodieae sp. n., Moussonia longipalatalis sp. n., Moussonia minutissima sp. n., Moussonia obesa sp. n., Moussonia polita sp. n., Moussonia uncinata sp. n., Moussonia vitianoides sp. n., Palaina alberti sp. n., Palaina flammulata sp. n., Palaina glabella sp. n., Palaina kitteli sp. n., Palaina labeosa sp. n., Palaina parietalis sp. n., Palaina sulcata sp. n., Palaina truncata sp. n., Palaina tuberosissima sp. n."}