{"doi": "https://doi.org/10.1016/s0022-0981(00)00163-5", "year": 2000, "abstract": "I manipulated snail densities of two coexisting species of salt marsh snail, Cerithidea californica Haldeman (native) and Batillaria attramentaria Sowerby (non-indigenous) to investigate how resource levels set by intraspecific competition may influence dispersal rates. I used two distinct size classes of the snails (mature and immature) to determine if the effects of competition on dispersal differed between developmental stages of a consumer. Dispersal attempts were measured within enclosure pens by counting snails climbing the sides of the enclosure. The influence of snail density per se and resource levels (which were set by snail densities) on dispersal rates were separated by comparing responses of snails to density before and after resources became depleted. For large snails of both species, dispersal increased as resource levels decreased, supporting the hypothesis that competition influences dispersal rates. Small snails of both species, in contrast, always dispersed at relatively higher rates than larger individuals, but were not influenced by variation in resource levels. This result corroborates other studies that have shown reduced competition in these species at smaller size, and suggests that another mechanism, such as genetically coded behavior to disperse when young, influences their behavior. Previous experiments demonstrated Batillaria's superior resource conversion efficiency; therefore, I had hypothesized that for any given resource level, Cerithidea would disperse more, because it was more affected by resource availability. Adult Batillaria, however, responded more sensitively to resource levels (i.e., dispersed more at any given resource level) than Cerithidea. This counter-intuitive result illustrates the potential importance of genetic limitations on behavioral responses available to a species. Constraints on behavioral responses may have been accentuated since Batillaria is a non-indigenous species whose evolved behavioral responses are not necessarily adapted to its present, non-native environment."}