{"doi": "https://doi.org/10.5539/jas.v4n10p205", "year": 2012, "abstract": "Four hundred (400) adult black-skinned snails, two hundred (200) each of Archachatina marginata and Achatina fulica with weight ranging from 50.42 g to 198.84 g and from 100.10 g to 184.00 g for A. marginata and A. fulica respectively selected based on active appearance, number of whorls and no injury on the foot and/or shell of a base population from a population gathered in the wild within the Niger Delta region were used for the study. Data collected on the selected snails were used to evaluate phenotypic correlations and multiple regression functions which were used for predicting body weights from quantitative traits. Results obtained from the study showed that A. fulica snails with 4 whorls are genetically heavier than A. marginata snails with 4 whorls. This is because there was large and significantly different (P<0.001) disparity in values of measured quantitative traits (mean body weights) among the two breeds. The results of phenotypic correlations among quantitative traits of the two breeds indicated positive, strong and very high significant (P<0.001) correlation coefficients (rp) between body weight and all body components studied. Whereas for A. fulica snails, there were positive but lower significant (P<0.05) phenotypic correlation coefficients (rp) between body weight and some body components studied. In fact, there were no significant (P>0.05) phenotypic correlation coefficients (rp) between shell length and shell ‘mouth’ width (r = 0.250) and between shell ‘mouth’ length and shell ‘mouth’ width (r = 0.187) for A. fulica snails. The prediction equations evolved for body weights of growing snails with 4 whorls using quantitative traits from A. marginata and A. fulica indicated that these quantitative traits, namely; shell length, shell width, shell ‘mouth’ length and shell ‘mouth’ width best predicted body weight for A. marginata and A. fulica snails with 4 whorls. The quantitative or phenotypic traits of the two breeds of snail studied could be chosen to differentiate as well as characterize growing snails in the Niger Delta region of Nigeria."}