{"doi": "https://doi.org/10.1098/rstb.1968.0010", "year": 1968, "abstract": "In 1924 one of us (C. D.), with the late Professor A. E. Boycott, F. R. S., collected random samples from populations of the polymorphic land snail Cepaea nemoralis L. on sand-dunes at Bundoran, County Donegal, Eire. In 1961, the other two revisited the area and sampled, as nearly as possible, the same localities. A total of 23857 live snails were collected and scored for various inherited shell characters. The data are considered from three points of view. First we have examined the distribution of morphs within individual samples, hoping to detect associations indicating linkage or selection. Secondly, we have studied the differences between contemporary samples and attempted to relate them to environmental factors. Thirdly, we have compared the two series (1924 and 1961) in order to detect any evolutionary changes that might have occurred. (1) Associations within samples In both series there are consistent linkage disequilibria involving the loci for shell-colour, for banded v. unbanded shell, for hyalozonate v. fully pigmented bands, and for white v. black lip. It is likely that these disequilibria are maintained by selection. There is also a suggestion of disequilibrium between the shell-colour locus and the loci determining the extent of band-fusions. We find no significant differences between adults and young in the proportions of any of the morphs. (2) Variation between samples Most of the characters show morph-ratio dines on an east/west axis. This pattern may be related to the fact that the western part of the area is predominantly mobile or semi-mobile dune, whereas the eastern part is generally more stable. The overall proportions of yellow and 'effectively unbanded’ shells very roughly correspond to those found by Cain &amp; Sheppard (1954) hedgerows and rough herbage. They occupy the range of frequencies expected according to the hypothesis of visual selection by predators. Nevertheless, their precise distributions within the area are not evidently related to local changes of background, nor are the distribution of unbandeds ( sensu stricto ), hyalozonates, whites, white lips or fusions. There may possibly be come correspondence in the case of browns, 00300 and 00345, and it is conceivable that the local distribution of pinks is the result of visual selection by rabbits. A final interpretation must await further detailed studies of other sand-dune populations. (3) Comparison of the two series A comparison of the series collected in 1924 with that collected in 1961 provides no evidence of consistent evolutionary change. There may have been small local changes, which in our data would be indistinguishable from differences due to errors in relocating the sampling areas; but in general the populations seem to have remained stable. There have certainly been no changes comparable to those observed at Berrow, Somerset (Clarke &amp; Murray 1962 a ). This apparent constancy may be related to the fact that the habitat at Bundoran has not greatly altered since 1924. At Berrow, on the other hand, the dunes have gradually become more stable, and larger parts of them have become overgrown with Hippophae . In each case the evolutionary situation seems to reflect the history of the habitat. It will clearly be of great interest to follow future developments at both localities."}