{"doi": "https://doi.org/10.1093/mollus/eyt017", "year": 2013, "abstract": "Depressed-shelled populations of the land snail Arianta arbustorum occur in rocky Alpine habitats, whereas globular shell forms are ubiquitous in lowland habitats of central Europe. It has been proposed that Alpine, steep, rocky habitats are the ancestral habitat and depressed-shelled snails the ancestral form of A. arbustorum. According to this hypothesis, the globular shell form evolved when A. arbustorum adapted to damp lowland habitats during the Pliocene and depressed-shelled forms survived the Pleistocene glaciations in isolated Alpine habitats like nunataks throughout the Alps. Alternatively, the depressed shells could be a more recent adaptation to steep rocky habitats, derived from the widespread globular-shelled lowland A. arbustorum. To test these alternatives, we compared globular and depressed-shelled morphotypes and their molecular differentiation between two geologically similar massifs in the Austrian Alps, the Totes Gebirge and the Gesäuse. These massifs are the centre of distribution of the nominal depressed-shelled subspecies A. a. styriaca and lie about 50 km apart. While the Gesäuse was at the edge of the Pleistocene ice-cover with numerous ice-free habitats, the Totes Gebirge lay under glaciers offering only nunataks as possible refugia. Using geometric morphometrics and phylogenetic analyses based on DNA sequences of COI, we asked (1) if the forms from the Gesäuse and Totes Gebirge were morphometrically sufficiently similar to support common ancestry; (2) if there was molecular evidence for common ancestry of shell forms; (3) if there was evidence for in situ survival on nunataks during the Pleistocene and (4) if the ancestral shell shape of A. arbustorum could be inferred based on the answers to questions 1–3. The depressed-shelled morphotypes of both massifs were significantly different in shape and size rejecting common ancestry. Additionally, snails with either depressed or globular shells were not monophyletic based on COI sequences. Lastly, we found entire clades unique to the Totes Gebirge indicating nunatak survival of snail populations. Our data also suggest that populations of A. arbustorum experienced recent gene flow between morphotypes and both massifs. Since the globular shells from the vicinity of Totes Gebirge and Gesäuse are morphologically indistinguishable in contrast to the locally strongly differentiated depressed-shelled morphotypes, we favour – at least on a local scale – the more parsimonious hypothesis of a globular-shelled ancestor locally evolving depressed-shelled forms."}