{"doi": "https://doi.org/10.1371/journal.pone.0049674", "year": 2012, "abstract": "This study is the first on the genetics of invasive populations of one of the most widely spread land mollusc species known in the world, the “Brown Snail” Cornu aspersum aspersum. Deliberately or accidentally imported, the species has become recently a notorious pest outside its native Mediterranean range. We compared the spatial structure and genetic variability of invasive (America, Oceania, South Africa) versus native populations using five microsatellite loci and mitochondrial (Cyt b and 16S rRNA) genes as a first step towards (i) the detection of potential source populations, and (ii) a better understanding of mechanisms governing evolutionary changes involved in the invasion process. Results based on multivariate analysis (Discriminant Analysis of Principal Components), Bayesian statistical inference (Clustering, Approximate Bayesian Computation) and demographic tests allowed a construction of the introduction pathways of the species over recent centuries. While emigrants originated from only one of the two native lineages, the West one, the most likely scenario involved several introduction events and “source switching” comprising (i) an early stage (around 1660) of simultaneous introductions from Europe (France, Spain) towards Oceania (New Zealand) and California, (ii) from the early 18th century, a second colonization wave from bridgehead populations successfully established in California, (iii) genetic admixture in invasive areas where highly divergent populations came into contact as in New Zealand. Although these man-made pathways are consistent with historical data, introduction time estimates suggest that the two putative waves of invasion would have occurred long before the first field observations recorded, both in America and in Oceania. A prolonged lag period as the use of an incorrect generation time could explain such 100–150 years discrepancy. Lastly, the contrasting patterns of neutral genetic signal left in invasive populations are discussed in light of possible ways of facing novel environments (standing genetic variation versus new mutation)."}