{"doi": "https://doi.org/10.1111/bij.12377", "year": 2014, "abstract": "Sperm morphology can be highly variable among species, but less is known about patterns of population differentiation within species. Sperm morphology is under strong sexual selection, may evolve rapidly, and often co-varies with other reproductive traits that differ between populations. We investigated variation in sperm morphology in the simultaneous hermaphrodite land snail Arianta arbustorum in relation to parasitic mite infection. Variation in total sperm length and sperm head length was assessed in 23 populations sampled across the distributional range of the species in Central and Northern Europe. We found a pronounced variation in total sperm length among the populations studied, with a difference of 11.0% of total sperm length between the shortest and longest population means. Differences among populations explained 62.9% of the variance in total sperm length, differences among individual snails within population 23.4% and differences within individual snail 13.7%. Mantel tests showed that interpopulation differences in total sperm length increased significantly with geographical distance between populations. A minimal adequate model revealed that parasitic infection had a positive effect and longitude a negative effect on total sperm length. Thus, independent of the population examined, mite-infected individuals of A. arbustorum produced larger sperm than uninfected snails and total sperm length decreased from west to east. Sperm head length also varied among populations, but it was not influenced by any of the factors examined. In a subsample of 12 populations restricted to the mountains of Switzerland (elevational range 440–2485 m a.s.l.), total sperm length decreased with increasing elevation. Our results suggest that selection pressures acting among populations may differ from those acting within. Stabilizing selection might be a possible mechanism for producing the reduced variation observed in sperm length within a population. © 2014 The Linnean Society of London, Biological Journal of the Linnean Society, 2014, 113, 1036–1046."}