{"doi": "https://doi.org/10.1093/mollus/eyu047", "year": 2014, "abstract": "The land snail assemblages in NW Europe exhibit marked gradients in diversity related to both latitude and longitude. These gradients, in turn, are linked to regional differences in temperature and moisture, although other non-climatic factors may be involved. Such diversity patterns have been described for the modern land snail faunas of NW Europe, especially those that inhabit forest. Here we provide an historical perspective on the development and composition of comparable land snail assemblages from various interglacials from the Middle and Late Pleistocene, and from the Holocene. We review the land snail assemblages from tufa sequences, which provide the best faunal records for each of the temperate periods. Data from 32 Quaternary sites in 7 NW European countries are considered. Assemblages from ‘forest optima’ of Pleistocene interglacial periods are richer in species compared with those from the Holocene. Correspondence analysis (CA) of data from 25 Quaternary sites in the regions where both Pleistocene and Holocene sites occur (i.e. southern England, northern France and Germany) resulted in a geographical separation of the assemblages into a western and eastern group. CA on each geographical group resulted in chronological divisions separating Pleistocene sites from the Holocene sequences. This separation results from the occurrence of numerous Central and Eastern European species in the Pleistocene faunas, whereas Holocene assemblages are characterized by species with mostly Western and Northern European modern ranges. This difference appears to reflect climatic influences, rather than resulting from anthropogenic effects. CA of 19 Holocene tufas produced geographical clusters clearly related to their position on a west-east gradient, presumably linked to some effect of ‘continentality’. During the mid Holocene, the diversity of forest snails from tufas in southern England exceeded the totals from the richest calcareous woodland sites in the region today. Further work is needed to establish whether this pattern holds for other regions of NW Europe."}