{"doi": "https://doi.org/10.1093/mollus/60.1.33", "year": 1994, "abstract": "Crevice-dwelling land snails emerge only infrequently to the exposed surface, and very little is known about their natural history. Here we report on the biology, life cycle, population dynamics and longevity of one such species, Cristataria genezarethana, which we studied over a period of three years. C. genezarethana spends 95–98% of its lifetime within rock crevices. In winter the crevice serves as an egg laying site, and as a retreat during periods of inactivity. Throughout summer it serves for aestivation adults aestivate near CTevice openings, young apparently deeper inside. The surface of the rock serves mainly as a lichen-feeding and copulating site, to which the snails emerge during brief periods of activity. Both for the onset and for the continuation of its activity season, C. genezarethana is absolutely dependent upon rain. However, activity ends before the end of the rainy season, suggesting that aestivation is not merely a direct response to dry climate. Though the population as a whole was active on each rainy day, no more than 15%–20% of the population were active simultaneously. An individual snail was active, on average, for only 6–12 days per year. Population size of the study-rock reached 2000–2900 individuals, and mean density was 150–200 snails m2. This snail carrying capacity of the rock is broadly similar to that of densely populated bushy habitats (when snail weight is considered). In these dense populations, low mating frequencies and growth inhibition may regulate population size. In all three seasons, the population consisted of two main large, well defined age groups: adults and young. As compared to the adults, the young were active on different parts of the rock and at different times. Although a third, intermediate group of sub adults was found, it was always very small. A fourth group, of juveniles, appeared during winter; later, most of them disappeared. We did not observe any shift from the young to the adult size group. This suggests a broadly stable population, with virtually no recruitment, in which final growth to adulthood is inhibited by the adults. Growth was very slow, suggesting that maturity in nature is reached in about 11 years, and that individuals live sixteen years at least. Mortality occurred in all age groups, and about 5% of the population died each year. There was no evidence for heavy predation. Crevices might be a suitable habitat for land snails in which the hatching period, and period of juvenile growth, are very long."}