{"doi": "https://doi.org/10.5733/afin.054.0215", "year": 2013, "abstract": "A revision of the world-wide available material of the Afrotropical streptaxid subgenus Avakubia Pilsbry, 1919, prompted the change in status to independent genus and the detection of undescribed species. In addition to the two earlier described species, A. avakubiensis (Pilsbry, 1919) and A. acuminata (Thiele, 1933), the genus Avakubia is found to embrace at least seven new species, viz., A. crystallum de Winter, sp.n. from Gabon; A. fruticicola de Winter & Vastenhout, sp. n., A. semenguei de Winter & Vastenhout, sp. n. and A. subacuminata de Winter & Vastenhout, sp. n. from Cameroon; A. ortizdezarateorum de Winter & Vastenhout, sp. n. and A. biokoensis de Winter & Vastenhout, sp. n. from Bioko I., Equatorial Guinea, and A. occidentalis de Winter, sp. n. from Ghana. Of some other potentially new Avakubia species insufficient material is available to allow a formal description. For a West African radiation with remarkably similar shells, but differing from true Avakubia in protoconch and teleoconch characters, a new genus Pseudavakubia de Winter & Vastenhout, gen. n. is erected with four new species, viz., P. atewaensis de Winter, sp. n., P. majus de Winter & Vastenhout, sp. n. (type species), P. ghanaensis de Winter, sp. n., and P. liberiana de Winter, sp. n. Avakubia avakubiensis has been reported in the literature from Uganda to Liberia, a range of 4750 km. Study of this material restricts the range of this species to the eastern Democratic Republic of the Congo and Uganda, the remaining records were found to refer to five other species of Avakubia or Pseudavakubia described in this paper, each with a much more restricted range. The genital anatomy of both Avakubia and Pseudavakubia is found to deviate from most other members of the family Streptaxidae in the absence of chitinous spines in the penis. Both genera are ovoviviparous. In the penis of a specimen of A. acuminata a spermatophore-like structure was found. Some aspects of the ecology of these rainforest-dwelling snails are described. An identification key to the species of Avakubia and Pseudavakubia is provided."}