{"doi": "https://doi.org/10.1046/j.1439-0469.2003.00208.x", "year": 2003, "abstract": "The intraspecific genetic differentiation depends to a large part on historical factors. The mode of dispersal is an important determinant of the genetic diversity especially of newly founded populations. Fast long-distance colonization of formerly unsuitable habitats results in reduced genetic diversity and lineages originating from different glacial refugia form well-defined hybrid zones, where they meet. Slow dispersers, on the other hand, preserve their refugial genetic diversity. Paleontological findings and a previous analysis of mtDNA suggest that the land snail Arianta arbustorum, which today is widely spread across Europe, has survived the Pleistocene glaciations within the boundaries of permafrost. In the present paper, we asked, whether the differentiation of nuclear markers, i.e. allozymes, supports these results. We investigated the allozymic differentiation at 15 polymorphic loci in 14 Alpine and one English populations of the land snail A. arbustorum. Various tests of genetic population differentiation yielded ambiguous results. Allele frequencies differed significantly across populations and all but five pairwise FST values were significant. Genetic distances between populations were comparatively high. On the other hand, an exact test of population differentiation found no differences and the assignment of individuals to their populations of origin was poor. This indicates that allozymic differentiation is constrained. Whether these constraints are of natural or methodological nature remains open. Matrices of genetic and geographical distances were correlated only after removal of the English population from the analysis. Similarly, with one exception FST values increased as the number of regions included in the calculations increased. Thus, on a regional scale, we largely observed a pattern of isolation by distance, which does no longer hold on a larger scale. This is well in accordance with the previous findings based on mtDNA. Mitochondrial lineages were widely distributed across Europe and overlapped extensively. Considering the low potential for dispersal of a land snail, the patchy distribution of lineages, and the high genetic diversity also found in the present study suggests that A. arbustorum has survived the Pleistocene within the boundaries of permafrost. Die intraspezifische genetische Differenzierung hängt zu einem grossen Teil von historischen Faktoren ab. Der Ausbreitungsmodus ist eine wichtige Determinante für die genetische Diversität insbesondere von neugegründeten Populationen. Eine rasche Kolonisierung über grosse Distanzen von vormals ungeeigneten Habitaten resultiert in reduzierter Diversität und Linien, die ihren Ursprung in verschiedenen eiszeitlichen Refugien haben, bilden klar definierte Hybridzonen, wo sie sich treffen. Organismen mit langsamer Ausbreitung dagegen bewahren die refugiale Diversität. Paläontologische Befunde und eine vorangehende Analyse von mtDNS legen nahe, dass die Landschnecke Arianta arbustorum, die heute weit über Europa verbreitet ist, die pleistocänen Vereisungen innerhalb der Grenzen des Permafrosts überlebt hat. In der vorliegenden Arbeit untersuchten wir, ob nukleare Marker, nämlich Allozyme, diese Hypothese unterstützen. Wir untersuchten die genetische Differenzierung von 14 alpinen Populationen und einer englischen an 15 polymorphen Genorten. Verschiedene Tests für die genetische Differenzierung von Populationen brachten ambivalente Resultate. Die Allelfrequenzen unterschieden sich signifikant und mit Ausnahme von 5 Werten waren alle paarweisen FST -Werte signifikant. Die genetischen Distanzen zwischen den Populationen waren vergleichsweise hoch. Andererseits fand ein exakter Test zur Populationsdifferenzierung keine Unterschiede und Individuen wurden in Assignment-Tests ihren Ursprungspopulationen nur zu einem recht geringen Teil korrekt zugeordnet. Dies zeigt, dass die Differenzierung von Allozymen eingeschränkt ist. Ob diese Einschränkungen natürlich oder methodologisch bedingt sind, bleibt offen. Matritzen von genetischen und geographischen Distanzen waren nur korreliert, wenn die Englische Population von der Analyse ausgeschlossen wurde. In ähnlicher Weise, wenn auch nicht ganz strikt, nahmen FST -Werte über eine steigende Anzahl von in die Berechnung einbezogenen Regionen zu. Auf regionaler Skala konnten wir somit im grossen und ganzen ein Muster von isolation by distance beobachten, das allerdings auf einem grösseren Massstab nicht mehr gilt. Dies stimmt sehr gut mit den früheren Befunden von mtDNS überein. Mitochondrielle Linien waren weit verbreitet über Europa und überlappten weitgehend. Aus dem geringen Ausbreitungspotential einer Landschnecke, der fleckenhaften genetischen Differenzierung und der hohen genetischen Diversität, die wir auch in der vorliegenden Arbeit gefunden haben, lässt sich folgern, dass A. arbustorum tatsächlich das Pleistocän innerhalb der Grenzen des Permafrosts überlebt haben muss."}