{"doi": "https://doi.org/10.1093/mollus/eyl024", "year": 2007, "abstract": "The aims of the study were: (1) to investigate the modern distribution pattern of snails in the Western Carpathians (Czech Republic and Slovakia) and compare it with the modern distribution pattern of plants, in which a conspicuous species turnover occurs on the scale of only tens of kilometres; and (2) to construct an hypothesis explaining why such a steep geographical gradient exists in such a small area, which is homogenous with respect to water chemistry and climate. Snail assemblages of 111 treeless base-rich spring-fen sites were sampled quantitatively from a homogeneous area of 16 m2 (one sample of 12 l volume) in which a vegetation relevé was also recorded. The result of a partial detrended correspondence analysis of snail data with water pH and conductivity as co-variables confirmed clear differences between snail assemblages of the study area's western and eastern region. The regions differed in their species pool and the frequencies of particular species. In the eastern region, fen specialists and relics occurred and they were fairly frequent and abundant (e.g. Vertigo geyeri and Pupilla alpicola). The western region differed by its higher frequency and abundance of woodland and ubiquitous species. The classification of snail species based on their co-occurrence with plant species reflected the known geographical pattern as well. We found that Western Carpathian fen vegetation as well as the fens' snail assemblages display a clear geographical gradient within a rather small area, independently of any climate or other environmental variation. Previously published palaeoecological data and both species composition and structure of modern assemblages suggest clear differences in the historical development of the two principal regions. Historical development seems to be one of the most important variables constituting qualitative characters of modern fragmented communities. On a small scale it can influence especially organisms with slower migration rates, such as molluscs."}