{"doi": "https://doi.org/10.1093/mollus/eyp020", "year": 2009, "abstract": "Mechanisms constraining phenotypic evolution, such as functional trade-offs, can cause phenotypic divergence in a common adaptation to use of the same habitat. This hypothesis was tested by field observations and laboratory experiments in Hirasea, a genus of endemic land snails of the Ogasawara Islands. Hirasea operculina was found on the large leaves of palm trees and possessed an extremely flat shell. In some localities, H. chichijimana and H. diplomphalus tended to rest on the leaves of broadleaved trees and on palm leaves, respectively, and in these localities these species possess a flat shell relatively similar to each other, although the former has a smaller number of whorls and a higher spire than the latter. In other localities, both of these species were found inside deep soil and with no difference in habitat use. In these cases, both species have a higher shell, but their morphologies are very different: H. chichijimana possesses a conical shell with a high spire and a small aperture, but H. diplomphalus has a discoidal shell with a deeply sunken spire and a large aperture. Experiments measuring the time needed for the snail to escape from a light to hide under artificial substrates showed that flatter shells were more advantageous to movement on substrates with foliated structures such as leaf litter, while higher shells were more advantageous on substrates with a fine particle structure such as soil. In one case, a relatively higher shell has been attained by a decrease of whorl expansion rate and an increase of whorl translation rate along the coiling axis (resulting in a highconical shell with a high spire), and in the other by an increase of whorl expansion rate and a decrease of whorl translation rate (resulting in a discoidal shell with a sunken spire). Both appear to be adaptive responses to the same burrowing lifestyle. These findings suggest that phenotypic traits can be diverse, even if they result from a common adaptation to a shared environment, if the adaptive changes have occurred from different starting points."}