{"doi": "https://doi.org/10.1093/mollus/eyp039", "year": 2009, "abstract": "A malacological study at 41 forest sites in the Southern Urals (Bashkortostan, Russia) conducted in 2007 gave the first quantitative data about land snail assemblages from this region. These data were used to identify the main patterns and predictors of snail species richness and composition, to assess the relations of snail assemblages to vegetation using detrended correspondence analysis (DCA) and to explore the hypothesis that forests of this area are modern analogues of the Early Holocene forests of Central Europe. In total, we recorded 29 snail species. Species richness per site was very low (0–14 species) although environmental conditions at many sites were generally favourable for snails (high calcium supply, abundant moisture and undisturbed character). Variation in species richness and composition was almost exclusively governed by local environment factors, rather than differences in location. The main gradient of vegetation composition (expressed as site scores on the first DCA axis), calcium and nitrogen content in herb biomass, and altitude were identified as the best correlates of species richness and compositional variation in snail assemblages. Snail species significantly accumulated towards more fertile, calcium-rich and lowland sites; the richest faunas were in alluvial alder forests and mesic lime–maple–elm forests. Several features such as low snail species richness, predominance of generalist species with wide distributions, and broader realized niches of particular species in the Southern Ural forests relative to their niches elsewhere, corresponded to those of fossil assemblages from the Early Holocene deposits of Central Europe. This supports the hypothesis that the Southern Urals snail faunas provide good analogues for those of Early Holocene assemblages of Central Europe. Our data also suggest that the very limited species pool, mostly of widely distributed species with good dispersal abilities, results in species-poor assemblages that are structured mainly by environmental filtering."}