{"doi": "https://doi.org/10.1635/i0097-3157-155-1-117.1", "year": 2006, "abstract": "A total of 562 species of snails and slugs are known from Jamaica, of which 505 (90%) are endemic. Both sympatric and allopatric species diversity are high and the terrestrial mollusk fauna is as diverse as any in the world for the size of the island. Although less than 15% of the original forest cover remains and deforestation continues, many snail species survive in the secondary forest that covers more than 25% of the land area. Perhaps as much as 90% of the mollusk fauna still exists, although some species have suffered great contractions of range. Tree snails of the genus Anoma (Urocoptidae) are the most critically endangered and some are probably already extinct. Many Jamaican species have naturally small ranges, so even with intensive sampling, establishing that a species is no longer extant is difficult, especially if the type locality is no more precise than “Jamaica”. A few endemic species, particularly those adapted to dry conditions, are expanding their ranges.Eight taxa formerly considered synonyms or subspecies are confirmed as full species: Priotrochatella pulchra (Helicinidae), Geomelania gracilis and G. magna (Truncatellidae), Leidyula trichroma (Veronicellidae), Aerotrochus mcnabianus (Sagdidae) and Pleurodonte amabilis, P. catadupae and P. candescens (Pleurodontidae). Fourteen taxa are synonymized: Choanopoma dislocata tentatively with Parachondria shepardiana (Annulariidae); Geomelania affinis with G. jamaicensis, G. exilis with G. beardsleana, G. jarvisi with G. minor, and G. striosa pumila with G. striosa (Truncatellidae); Varicella leucozonias striatella with V. leucozonias (Oleacinidae); Urocoptis lata with U. producta and Pupa lata tentatively with U. sanguinea (Urocoptidae); Helix albicans with Stauroglypta anthoniana (Sagdidae); Helix lindsleyana tentatively with Pleurodonte atavus, Helix soror var. latior with Pleurodonte peracutissima; Pleurodonte tridentina chittyana and P. t. schroeteriana with P. tridentina (Pleurodontidae); and Dialeuca jacobensis with D. conspersula platystyla. Pleurodonte carmelita (Férussac, 1821) is preoccupied by Helix carmelita Lichtenstein, 1794 and is replaced by Pleurodonte mora (Griffith & Pidgeon, 1834). Bulimus macrospira is transferred to Sigmataxis (Oleacinidae), Helix brevis to Happiella (Systrophiidae) and Helix alveus to Stauroglypta (Sagdidae). Gastrocopta polyptyx (Vertiginidae), Drymaeus rufescens (Bulimulidae) and Lacteoluna selenina and Aerotrochus turbiniformis (Sagdidae) are rejected from the Jamaican fauna. Ten introduced species are newly reported from Jamaica: Helicodiscus parallelus (Helicodiscidae), Paralaoma servilis (Punctidae); Karolus consobrinus (Ferussaciidae), Beckianum beckianum (Subulinidae), Bulimulus diaphanus and Drymaeus multilineatus (Bulimulidae), Zachrysia provisoria (Pleurodontidae), Huttonella bicolor (Streptaxidae), Happiella decolorata (Systrophiidae), and Bradybaena similaris (Bradybaenidae)."}