{"doi": "https://doi.org/10.1046/j.1365-2664.2002.00744.x", "year": 2002, "abstract": "Summary Physical inaccessibility often complicates censuses of poorly mobile organisms. We therefore assessed the effectiveness of using a sample of quadrat counts to generate a population estimate corrected for inaccessible areas. The result is directly applicable to management of the introduced snail Achatina fulica on Ile aux Aigrettes, a small island off Mauritius, but also has implications for counting this and similar species elsewhere. Accurate counting of A. fulica is important given that this species is such a widespread and serious pest. Counts were made in 17 quadrats taken from a grid covering the island. These were used to produce one population estimate by interpolating for the rest of the grid using GIS software (method 1). A second estimate assumed equal density of snails in accessible and inaccessible parts of the 17 quadrats, again with the population estimate interpolated (method 2). Four further quadrats were cleared of vegetation and, by comparison of counts before and after clearance, the relationship between initial count and true snail number was estimated. This resulted in two further population estimates, with the relationship used to adjust counts in the 17 experimental quadrats before interpolation (methods 3 and 4). All four estimates were tested using 35 additional quadrats of two types. Type 1 quadrats were physically cleared of vegetation; type 2 quadrats were fully accessible without clearance. Predicted counts in these quadrats were assessed for accuracy by comparison with actual counts. The method 1 estimate was clearly inadequate; method 4 gave a consistent overestimate; method 2 gave the smallest error in both quadrat types. In type 1 quadrats, method 2 and 3 estimates were not significantly different and method 2 had a slight tendency to underestimate. Overall, for studies of A. fulica , method 2 is recommended. However, it should be noted that the study took place towards the end of the wet season. In the dry season, damp refuges under inaccessible vegetation may be more important and methods 3 and 4 may then give a better estimate. The population of A. fulica with shell length &gt; 10 mm on Ile aux Aigrettes near the end of the wet season in 2000 was between 37 300 and 45 100, with 39 700 being the best estimate. The results underline the importance of considering inaccessible areas when accurate counts of species are needed, and a method is suggested by which a simple census technique can be adjusted. In the case of A. fulica , more accurate estimates of population size and distribution are invaluable in the management, monitoring and eradication of this invasive species."}