{"doi": "https://doi.org/10.1186/s40555-014-0069-4", "year": 2014, "abstract": "Lymnaea stagnalis (L., 1758), the great pond snail, is among the most common and ubiquitous species of aquatic pulmonate gastropods of Palearctic. It is notorious for its enormous conchological variation, and many students tried to separate varieties, subspecies and even distinct species within the L. stagnalis s. l. Recent molecular studies have revealed that there are at least two genetically indistinguishable morphotypes of L. stagnalis in Palearctic that earlier were accepted by some authors as biological species under the binomial names L. stagnalis s. str. and L. fragilis (L., 1758). In this article, the comparative analysis of their conchological variation in a large physical geographical region (Western Siberia, Asiatic Russia) is provided. The two morphotypes proved to be rather similar in their ecological preferences, but the patterns of their ontogenic, ecological, and geographical variation look rather distinct as well as the areas of their distribution in Western Siberia. U-shaped body size clines are reported in both morphotypes with the largest individuals tending to occur in the middle (forest-steppe) belt of Western Siberia. The causal analysis of the patterns of geographical variation in conchological traits of the great pond snail has identified the annual precipitation and the length of the growth season as the two main factors to shape the spatial clines in shell size and proportions. Among hydrological parameters, the water flow characteristics (lotic vs. lentic habitats) may influence shell morphology in the great pond snails though ecologically induced variation proved to be rather weak. The differences between populations living under different hydrological regimes may be captured by statistical techniques but are not enough to warrant separation of ‘ecological’ subspecies or other subspecific categories of ecophenotypic origin. Though there is no doubtless evidence of their specific independence, the two morphotypes, in a sense, ‘behave’ as two distinct entities with no identical ranges worthwhile to be recognized taxonomically. Their proper position in practical taxonomy should be discussed elsewhere."}