{"doi": "https://doi.org/10.4002/040.051.0101", "year": 2009, "abstract": "Life-history traits in terrestrial gastropods may be influenced by both abiotic and biotic factors. This study examines the effects of soil type and adult size (shell volume) on mating propensity and female and male reproductive output (number and mass of eggs, number of sperm delivered and spermatophore mass) in individuals of the simultaneous hermaphrodite land snail Arianta arbustorum from two populations kept both on calcium-(Ca-)rich and Ca-poor soil. Snails from the two populations differed in adult size, relative shell growth, mating propensity and egg size. Furthermore, in both populations the number of egg batches deposited, egg size and spermatophore size scaled allometrically with shell volume, but not the total number of eggs produced and number of sperm delivered. Independent of population and shell size, the type of soil on which the snails were maintained influenced mating propensity, the total number of eggs produced and the mass of the albumen gland (another measure of female reproductive output). The mating propensity was higher and the total number of eggs produced was larger in snails kept on Ca-poor soil than in individuals reared on Ca-rich soil. This surprising finding could be explained by the fact that the Ca-poor soil used in the experiment still contained enough Ca to allow reproduction, and that the snails ingested Ca through the food consumed (lettuce grown on Ca-rich soil was available ad libitum). Moreover, the Ca-rich soil could contain minerals or (unknown) substances which discourage reproduction in A. arbustorum. Our study highlights the complexities faced when interpreting differences in the life history of gastropods. Explaining interpopulational differences in life-history patterns requires not only the understanding of the influence of snail origin, but also an understanding of the effects of shell size, substratum type (soil type), food and local climate."}