{"doi": "https://doi.org/10.1111/j.1472-4642.2009.00589.x", "year": 2009, "abstract": "Abstract Aim Using New Zealand land snails as a case study, we evaluated recent spatial modelling approaches for the analysis of diversity in species‐rich invertebrate groups. Applications and prospects for improved conservation assessment were investigated. Location New Zealand. Methods The study used a spatially extensive and taxonomically comprehensive, plot‐based dataset on community structure in New Zealand land snails. Generalized regression analysis and spatial prediction (GRASP) was used to model and predict species richness as a function of environmental variables (including aspects of climate, soils and vegetation). Generalized dissimilarity modelling (GDM) was used to model turnover in species composition in relation to environmental and geographical distances, and to assess community similarity and the representativeness of the reserve network. Results Observed land snail richness in 20 × 20 m plots ranged from 1 to 74 (mean 17.5). The GRASP model explained a modest 27% of the variation in richness. The GDM model explained 57% of the variation in species turnover and indicated approximately equal amounts related to environmental (Cody’s beta diversity) and geographical distance (Cody’s gamma diversity). Temperature and moisture were the most important environmental variables. Results indicate that snail distributions are not only sorted by environment but are also strongly influenced by historical effects consistent with those expected of poorly dispersing taxa that have persisted in refugia during past climatic change. The GDM model enabled spatial classifications of snail communities, highlighting diverse communities in heterogeneous regions, such as the South Island mountains, and also enabled continuous depictions of community similarity and adequacy of New Zealand’s protected natural areas network. Main conclusions The GRASP and GDM analyses allowed us to model and depict spatial patterns of diversity in land snail communities involving 845 species, and produce community classifications and estimates of community similarity. These tools advance conservation assessment in species‐rich groups, but require further conceptual and methodological development."}