{"doi": "https://doi.org/10.4003/006.027.0206", "year": 2009, "abstract": "We reconstructed the molecular phylogeny of 78 specimens, including nearly all nominal species of the genus Pyrenaearia, and discussed the implications of the molecular phylogeny for species delimitation. The four basal clades obtained by mitochondrial COI and 16S sequences were highly congruent with nuclear ITS markers, shell morphology, and geographic distribution patterns, and were considered different species under the phylogenetic species concept: Pyrenaearia carascalopsis (Bourguignat in Fagot, 1884), P. carascalensis (Férussac, 1821), P. parva Ortiz de Zárate, 1956, and P. cantabrica (Hidalgo, 1873). Evidence of reproductive isolation between coexisting species of these basal clades has also been obtained. Because of genetic divergence, together with peculiarities of habitat use, distributional range, and shell morphology, P. organiaca (Fagot, 1905) and P. navasi (Fagot, 1907) were regarded as valid species. Further subdivisions within Pyrenaearia were also considered. Some incongruencies were found between shell morphology and DNA-based taxonomy, including the presence of hairs in adult shells and shell shape adaptations to different altitudes. The deepest split in Pyrenaearia involves four different lineages and represents an ancient event, occurring during the Pleistocene or even the Pliocene. Subsequent Pyrenaearia speciation within the four main groups has been a very recent process, and it is hypothesized to have occurred during Pleistocene cycles of climatic cooling and warming. Chronologically, a third speciation process is occurring from the Würm de-glaciation to the present time. All these processes included allopatric speciation of the high-altitude taxa during warmer interglacial periods, but parapatric or peripatric speciation events could also be involved. Based on the present day distribution of the species and their different altitudinal preferences, the whole genus could constitute a good model to investigate the evolutionary processes that created this diversity. It could also be an excellent group of closely related taxa for the study of the effect of PlioPleistocene climate changes on species distribution, population structure, speciation processes, secondary contacts, and passive dispersal."}