{"doi": "https://doi.org/10.1046/j.1466-822x.2003.00050.x", "year": 2003, "abstract": "ABSTRACT Aim To investigate latitudinal and altitudinal patterns in body size variation among north‐west European land snail species, as well as factors influencing such patterns. Location Latitudinal patterns were investigated in north‐west Europe from the British Isles and France in the west to Finland, Poland, Slovakia and Hungary in the east and from Norway in the north to France (with the exception of the Mediterranean part of the country), Switzerland, Austria and Hungary in the south. Altitudinal patterns were examined in the Alps in Austria and Switzerland. Methods Data on latitudinal ranges of 366 north‐west European land snail species, on altitudinal ranges of 175 species from Austria and 150 species from Switzerland, and on their body sizes were used to test for the presence of interspecific latitudinal or altitudinal body size patterns. Four methods, Stevens’ method, the midpoint method, the across‐species method, and a phylogenetically controlled analysis (CAIC) were applied. Results As a result of the predominance of some small bodied clades at higher latitudes and some large bodied clades at lower latitudes, body size of north‐west European land snails decreases significantly with increasing latitude. However, little of the body size variation across species is explained by latitude and the phylogenetically controlled analysis showed that the decrease of body size with increasing latitude is not a result of repeated and independent evolution of an association between body size and latitude in many clades. There is no significant correlation between body size of land snail species and altitude in the Alps although a negative correlation of body size and altitude is frequent within species. Main conclusion If phylogenetic effects are controlled for, neither latitudinal nor altitudinal patterns in body size could be found. Bergmann's rule, which predicts a positive correlation between body size of species and latitude, could not be confirmed for north‐west European land snails."}