{"doi": "https://doi.org/10.1093/mollus/eyi056", "year": 2005, "abstract": "Ribosomal RNA is coded by the rDNA gene cluster. Hundreds of rDNA loci are consecutively arranged and form repeated motifs on chromosomes. The Internal Transcribed Spacer 1 (ITS1) is part of the eukaryotic rDNA locus. This spacer is a relatively fast evolving, ‘non-coding’ element. It is often used in phylogenetic reconstructions of closely related taxa. The ITS1 separates two functional regions: the 18S rDNA and the 5.8S rDNA (Fig. 1). There are usually no or very few ITS1 nucleotide polymorphisms within an animal species (0–3% intraspecific variation). The phenomenon of very low intraspecific rDNA variation is explained by the concept of concerted evolution in the gene pool of a species under molecular drive. Yet, there are exceptions from the rule of very low intraspecific rDNA variation, particularly in crustaceans and in some species-flocks. For example, in the Cicindela dorsalis complex (tiger beetle), in the Simulium damnosum group (West African black flies), in corals with reticulate evolution and in a few plant species the genomic variation in the ITS1 is extremely high, with some sequences showing as much as 20–35% intraspecific divergence. In the following contribution, we analyse the extent of ITS1 variation of four taxonomically robust species of land snail of different family categories, i.e. within Acanthinula aculeata (Valloniidae sensu lato ), Arianta arbustorum (Helicoidea), Cochlodina fimbriata (Clausiliidae), and Vallonia costata (Valloniidae sensu stricto ). We show that one species (A. aculeata ) exhibits a high level of ITS1 variation, whilst another species (V. costata ) displays nearly no variation. The other two taxa display moderate variation. We also examine the ITS1 rDNA for highly conserved sequence motifs and investigate the extent of nucleotide variation within such motifs. Evolutionarily conserved regions in ribosomal spacers are suspected to be involved in the maturation of the precursor rRNA. Finally, we discuss the possible occurrence of rDNA pseudogenes in PCR amplicons and genome databases. DNA was extracted from 13 snail specimens. Polymerase chain reaction (PCR) of the ITS1 rDNA was performed with flanking 18S and 5.8S primers. PCR products were cloned in pCR blunt vectors (INVITROGEN), transformed in E. coli, and isolated and sequenced in both directions (Accession Nos AY267026-AY267030, AF124052-AF124053, AY546422AY546468). Number of analysed sequences per species was as follows: A. aculeata 1⁄4 23 cloned ITS1 molecules obtained from three individuals (collected in Germany and Switzerland), A. arbustorum 1⁄4 17 from four individuals (two unknown Dutch sites, Switzerland and Estonia), C. fimbriata 1⁄4 9 from one individual (Switzerland), and V. costata 1⁄4 5 from five individuals (Germany, Great Britain and Austria). Details on sampling sites, DNA extraction and PCR are available in the Electronic Supplementary Data. The consensus alignment of the 54 sequences is 662 bp long, and includes ITS1 sequences of 522 bp to 599 bp (see Supplementary Data and EMBL/EBI Alignment Accession No. ALIGN_000906). Genetic distances (D ) were calculated among all cloned sequences from the ITS1 regions using Kimura’s 2-parameter method implemented in MEGA, version 2.1. The D values give information about genomic variability within the samples. The highest genomic D was 0.061 (within A. aculeata ), whilst A. arbustorum, C. fimbriata and V. costata showed lower D values (with maxima of 0.022, 0.018 and 0.002, respectively). A neighbour-joining tree was reconstructed using MEGA (Fig. 2). Each sequence was correctly assigned to its predicted species level, and the interspecific signal was not confounded by genomic D values (Fig. 2). Approximately 190 nucleotide positions of the ITS1 are invariant in all cloned sequences (i.e. 32–36% of the alignment length). The invariant nucleotides are conserved among species from the Helicoidea, Clausiliidae and Valloniidae. The last common ancestor of these three families lived in the Upper-Mesozoic, .70 million years ago (for origin of extant land snail family lineages, see Ref. 17). It is possible that these invariant ITS1 nucleotide positions are evolving under functional constraints, i.e. they could be involved in the processing pathway of the precursor rRNA. Subsequently, the ITS1 was analysed on variable nucleotide positions: (1) in phylogenetically very ‘old’ and conserved regions; and (2) in phylogenetically unconserved segments. (1) Six highly conserved regions of the stylommatophoranbasommatophoran split 150 million years ago have been found previously. These six regions were concatenated and are referred to as ‘StyloBaso’ block (black boxes in Fig. 1). These six regions can be aligned across stylommatophoran land snails and basommatophoran freshwater snails, and are relatively constant in length. The concatenated StyloBaso box ranged in length from 110 bp (in A. aculeata ) to 115 bp (in C. fimbriata ). In A. aculeata, 18 variable positions (nucleotide substitutions and indels) occurred in the StyloBaso region (Table 1). Thus, even in sequence motifs of 150 million years, intraspecific ITS1 variation was found. (2) In the remaining part of the ITS1 of A. aculeata (length between 450 and 480 bp), 84 variable sites were detected. This means that a total of 102 polymorphic nucleotide positions occurred in the ITS1 of this species, i.e. 17–19% of the nucleotide positions were variable (see Table 1). The other land snail species showed lower percentage values of variable sites, with 0.2% (V. costata ), 3% (C. fimbriata ), and 7% (A. arbustorum ). These percentage values are only estimates because the probability of detection of variable nucleotide positions depends on the number of cloned sequences, and on sequence length. We therefore performed a partial rarefaction analysis (with the MEGA sequence editor). As target groups we focused on A. aculeata (23 sequences; ITS1 alignment length 1⁄4 603 bp) and Correspondence: G. F. J. Armbruster; e-mail: g.armbruster@unibas.ch"}