{"doi": "https://doi.org/10.1093/mollus/eyi001", "year": 2005, "abstract": "We examined the seasonal patterns of physiology and biochemical composition in the rock-dwelling clausiliid land snail Albinaria caerulea in relation to its ecology, morphology and climatic data. We found that A. caerulea displayed significant seasonal changes in biochemical composition and enzyme activity, especially during aestivation. Sugars were catabolized early in aestivation, and proteins and lipids seem to be the primary metabolic substrates after sugar reserves were depleted. Atypical for aestivating land snails was the accumulation of lactate and LDH during the first weeks of aestivation, possibly suggesting that anaerobic pathways can provide additional energy. Moreover, mortality was not significantly higher during aestivation, fresh-mass differences between the aestivation and active period were not substantial and the rate of fresh-mass decline during aestivation was low. In addition, A. caerulea shows a series of morphological (thick white shell, strengthened and reflected apertural lips, thick epiphragm, internal lamellae, door-like clausilium) and behavioural (high aggregation) characteristics that support survival during adverse climatic conditions by preventing desiccation. We did not find a correlation of biochemical variables (except LDH) with climatic conditions. Yet, the biochemical variables, taken as a whole, are sufficient to distinguish the periods of aestivation and activity. The above suggest that the start of aestivation is primarily controlled by an endogenous component, and perhaps changes in the biochemical composition are a by-product of this component and not a direct response to climatic conditions. These results, in conjunction with the non-elevated mortality during aestivation, indicate that in this Albinaria population morphological, behavioural and physiological adaptations to the dry conditions of the climatically unpredictable Mediterranean-type ecosystems are in effect, and seem to ensure sufficient water and fuel reserves."}