{"doi": "https://doi.org/10.1093/mollus/eys003", "year": 2012, "abstract": "Land snails usually exhibit cycles of activity and dormancy (aestivation or hibernation). The transition between these two states is accompanied by a range of behavioural and physiological responses to ensure their survival under adverse environmental conditions. Furthermore, aestivation plays an important role in shaping species' distribution patterns. We examined the seasonal patterns in biochemical tissue composition in relation to aspects of behavioural ecology in three land snail populations: one mainland and one insular population of the widespread Helix aspersa and a population (sympatric with the latter) of Helix figulina, a congeneric species with a narrow and declining distribution. Helix figulina aestivates in underground borrows, while H. aspersa spends the summer under stones and may interrupt aestivation when conditions become favourable. Prior to aestivation H. figulina accumulates metabolic fuels, which it consumes later during summer, and at the same time loses substantial body water and increases lactate dehydrogenase (LDH) activity. The insular H. aspersa population follows a similar pattern (regarding metabolites and LDH activity), with the difference that water loss is limited. However, the mainland population of H. aspersa deviates from this model with energy metabolites and water levels showing little variation throughout the year, while LDH activity is reduced. These differences probably reflect the particular behavioural and physiological patterns adopted by each species. The specialist and range-restricted H. figulina shows a constant and more predictable seasonal pattern, which may be effective for surviving in its historical biogeographic range, but it seems to be more vulnerable to possibly changing environmental conditions. On the other hand the generalist and cosmopolitan H. aspersa adopts a more flexible pattern that compensates for the effects of adverse conditions during aestivation and permits a more effective exploitation of energy resources."}