{"doi": "https://doi.org/10.1111/j.1365-2699.2008.01933.x", "year": 2008, "abstract": "Abstract Aim We investigated whether the biogeographical patterns expected if the East African fauna was affected by cycles of contraction to refugia and expansion of ranges, as has been previously hypothesized, can be found in the land snail fauna of rain forests in Uganda. Location The Albertine Rift region and the Lake Victoria forest belt in Uganda. Methods Snails and slugs were sampled in 60 plots in 13 rain forests, and small species were extracted from 5‐L leaf litter samples. Relative species richness was calculated by rarefaction. The influence of putative determinants of species richness was examined by bivariate correlation and multiple regression. Clustering and nestedness were tested by Monte Carlo simulations with a null model that considers the range size distribution, the species richness distribution of the forests, and the spatial autocorrelation of the occurrences of each species. Biotic elements were determined by model‐based Gaussian clustering. Results A total of 169 land snail species were recorded from 13 Ugandan rain forests. Relative species richness increases with rainfall and altitude, and decreases with evaporation and distance from the putative East Congolian refugia. Mean annual rainfall and distance from the putative East Congolian refugia were included in the best multiple regression model. The distribution areas of the Ugandan land snails are significantly clustered. Two montane, two lowland and a northern biotic element were found. The mean range extension increases with increasing distance from the putative East Congolian refugia. Moreover, the ranges of the Ugandan land snails are significantly nested. The centre of the sets of nested subsets is in the Virunga Mountains, close to the putative East Congolian refugia. Main conclusions The decrease of diversity with increasing distance from the putative East Congolian refugia, the clustering and nestedness of ranges, and the range size increase with increasing distance from the refugia indicate that the East African land snail fauna was affected by cycles of contraction to refugia and expansion of ranges. The significant clustering and nestedness cannot be explained by current environmental conditions. Given the environmental history, it can be supposed that the lowland elements expanded post‐glacially, whereas the ranges of the montane species are probably currently contracting."}