{"doi": "https://doi.org/10.12681/eadd/35853", "year": 2021, "abstract": "Η επιθήλιο-μεσεγχυματική μετατροπή (ΕΜΤ) αποτελεί ένα φυσιολογικό μηχανισμό που ενεργοποιείται κατά την εμβρυογένεση και την επούλωση τραυμάτων. Είναι ένας μοριακός μηχανισμός που συμβάλει στην μετατροπή των επιθηλιακών κυττάρων σε μεσεγχυματικά, προσδίδοντας τους χαρακτηριστικά όπως αυξημένη διεισδυτικότητακαι κινητικότητα, κάνοντάς τη έτσι μία διαδικασία που παίζει επιπλέον κεντρικό ρόλο στην μετατροπή και μετανάστευση των καρκινικών κυττάρων.Σημαντικό ρόλο στη νεοπλασία παίζει και ο άξονας των ενδοθηλινών, όπου η ενδοθηλίνη 1 (ΕΤ-1) μέσω των υποδοχέων της Α (ΕΤ-Α) και Β (ΕΤ-Β) διαμεσολαβεί στη μιτογόνο ενίσχυση των επιθηλιακών και μη- καρκινωμάτων. Η ενεργοποίηση του άξονα μπορεί να επάγει τον κυτταρικό πολλαπλασιασμό, την κυτταρική επιβίωση,την ΕΜΤ, τη νεοαγγειογένεση, την ανοσοαπόκριση και την αντίσταση σε φάρμακα. Στην παρούσα μελέτη, διερευνήθηκε με ανοσοϊστοχημική μέθοδο σε αδενοκαρκινώματα του προστάτη η έκφραση μορίων που μεταβάλλονται κατά τη διεργασία της ΕΜΤ και εξετάστηκε η πιθανή συσχέτιση τους με γνωστούς παράγοντες του άξονα των ενδοθηλινών. Χρησιμοποιήθηκαν αντισώματα για τους παράγοντες προσκόλλησης, Ε- και Ν-καντχερινών και σύνδεσης των κυττάρων, β-κατενίνη, του μεταγραφικού παράγοντα SNAIL, καθώς και παράγοντες του άξονα των ενδοθηλινών, την ΕΤ-1 και τους υποδοχείς της ΕΤ-Α και ΕΤ-Β. Τα ιστικά δείγματα προήλθαν από 87 ασθενείς με αδενοκαρκίνωμα του προστάτη, ηλικίας από51 έως 75 ετών. Η έκφραση των υπό μελέτη παραγόντων εκτιμήθηκε τόσο στο νεοπλασματικό ιστό (καρκινικά κύτταρα), όσο και στον παρακείμενο μη νεοπλασματικό ιστό, ενώ εκτιμήθηκε η ακριβής εντόπιση των παραγόντων(μεμβράνη, κυτταρόπλασμα, πυρήνας). Τα δείγματα των ασθενών κατηγοριοποιήθηκαν ως προς τους παράγοντες: ηλικία, βαθμό ιστολογικής διαφοροποίησης (Gleason score: Grade I, συνδυασμένο Gleason score 2-6, Grade II,συνδυασμένο Gleason scοre 7 (3+4 ή 4+3), Grade III, συνδυασμένο Gleason scοre 8-10), στάδιο Τ (μέγεθος όγκου) και Ν (παρουσία ή μη λεμφαδενικών μεταστάσεων).Στον «φυσιολογικό» μη νεοπλασματικό αδενικό επιθήλιο η έκφραση της Ε-καντχερίνης και της β-κατενίνης ήταν ισχυρή και μεμβρανική, με την Ν-καντχερίνηνα βρίσκεται σε μέτρια επίπεδα τόσο στην μεμβράνη όσο και το κυτταρόπλασμα καιτο SNAIL να παρουσιάζει χαμηλά επίπεδα στον πυρήνα. Αντίστοιχα, η βιμεντίνη ήταν αρνητική σε όλα τα περιστατικά, ενώ η ΕΤ-1 και ο ΕΤ-Α, εντοπίζονταν στοκυτταρόπλασμα σε χαμηλά επίπεδα. Αντίθετα, στο αδενοκαρκίνωμα του προστάτη η Ε-καντχερίνη και η Ν-καντχερίνη ήταν σε χαμηλά επίπεδα στην μεμβράνη και σε μέτρια με υψηλά επίπεδα στο κυτταρόπλασμα, σε συνδυασμό με την β-κατενίνη που επίσης βρισκόταν μειωμένη στην μεμβράνη και αυξημένη στο κυτταρόπλασμα και τον πυρήνα. Η βιμεντίνη είχε θετική χρώση στα νεοπλασματικά κύτταρα και ο μεταγραφικός παράγοντας SNAIL ήταν σε μέτρια προς υψηλά επίπεδα στον πυρήνα των καρκινικών κυττάρων. Η ΕΤ-1 και ο ΕΤ-Α αυτά εντοπίστηκαν σε αυξημένα επίπεδα στο κυτταρόπλασμα των καρκινικών κυττάρων, ενώ ο ΕΤ-Β ήταν αρνητικός σε όλα τα περιστατικά.Η στατιστική ανάλυση ανέδειξε σημαντική σχέση των δεικτών ΕΜΤ και του άξονα των ενδοθηλινών με τα κλινικοπαθολογικά χαρακτηριστικά (λεμφαδενική διήθηση, μέγεθος Τ όγκου και βαθμό διαφοροποίησης Gleason). Αυξημένα επίπεδα πυρηνικής έκφρασης του SNAIL και κυτταροπλασματικής έκφρασης της ΕΤ-1 και του ΕΤ-Α σχετίζονταν με όλες της κλινικοπαθολογικές παραμέτρους. Η μεμβρανική και η κυτταροπλασματική έκφραση της Ν-καντχερίνης σχετιζόταν σημαντικά με τη λεμφαδενική διήθηση και το μέγεθος του όγκου, ενώ η κυτταροπλασματική β-κατενίνη με τη λεμφαδενική διήθηση και η κυτταροπλασματική Ε-καντχερίνη με το βαθμό διαφοροποίησης. Επιπλέον, η πυρηνική Ε-καντχερίνη συσχετιζόταν θετικά με την κυτταροπλασματική και μεμβρανική έκφραση της Ν-καντχερίνης, ενώ η κυτταροπλασματική της έκφραση συσχετιζόταν θετικά με τα επίπεδα έκφρασης της ΕΤ-1 και του υποδοχέα της ΕΤ-Α. Αντίστοιχα, η ΕΤ-1 σχετιζόταν θετικά με τα επίπεδα της κυτταροπλασματικής έκφρασης της β-κατενίνης και αρνητικά με τα επίπεδα της στην μεμβράνη ενώ ο SNAIL σχετιζόταν θετικά με την έκφραση των ΕΤ-1 και ΕΤ-Α.Συμπερασματικά, επιβεβαιώθηκε η ύπαρξη ΕΜΤ στο αδενοκαρκίνωμα του προστάτη και η συσχέτισή της με τον άξονα ΕΤ-1/ΕΤ-Α. Ο μεταγραφικός παράγοντας SNAIL παίζει βασικό ρόλο στη συνομιλία των δύο μονοπατιών. Η αυξημένη έκφραση των δεικτών ΕΜΤ αλλά και των Snail, ΕΤ-1/ΕΤ-Α σχετίζεται μετη λεμφαδενική διήθηση, το μέγεθος Τ του όγκου και το βαθμό διαφοροποίησης. Τα ευρήματα αυτά κάνουν ελκυστική την προοπτική πιθανής χρήσης των ανωτέρω μορίων ως εργαλεία μοριακής σταδιοποίησης αλλά και υπογραμμίζουν τη λογική ανάπτυξης θεραπειών με χρήση ειδικών αναστολέων στην αντιμετώπιση του αδενοκαρκινώματος του προστάτη."}