{"doi": "https://doi.org/10.1163/18759866-08001001", "year": 2011, "abstract": "Since Solem’s provocative claim in the early 1980s that land snails in tropical forests are neither abundant nor diverse, at least 30 quantitative-ecological papers on tropical land snail communities have appeared. Jointly, these papers have shown that site diversity is, in fact, high in tropical forests; often more than 100 species have been recorded per site, which is somewhat more than normally found at sites in higher latitudes. At the same time, however, point diversities (which usually range between 10 and 30 species per quadrat) appear to be no different from the ones recorded for temperate localities, which suggests that the number of ways in which syntopic resource space can be subdivided among different land snail species has an upper limit that is no higher under tropical conditions. The available data do not allow much analysis of the ecological structuring processes of communities besides very coarse ones, e.g. the proportions of carnivores versus herbivores and Pulmonata versus non-pulmonates. Also, these first 30 years of research have shown that a number of serious methodological and conceptual issues need to be resolved for the field to move ahead; in particular whether empty shells from the forest floor may be used as a proxy for the contemporaneous communities. I make a number of suggestions for ways in which these obstacles may be removed. First, studies should be preceded by exploratory nested sampling in contiguous quadrats of increasing size, spanning several orders of magnitude. The shape of the triphasic species-area curve and nonlinear regression of the small-area end of the curve will help identify the quadrat and site areas that allow ecologically more meaningful studies. Second, researchers should be more aware of the trophic levels of species and restrict their analyses within guilds and within body size classes as much as possible. Testing species abundance distributions against ecologically explicit theoretical models may be a fruitful avenue for research. Finally, I argue that studies of this nature require species abundances that may only be found in tropical land snail communities that live on calcareous substrate, and therefore I suggest that malacologists aiming to understand community structure focus on limestone sites initially."}