{"doi": "https://doi.org/10.15517/rbt.v56i1.5528", "year": 2006, "abstract": "In an attempt to elucidate the role of calcium in the life of the edible Achatinid snail, Limicolaria flammea (Miller) I investigated short and long term effects of calcium added to the food. The short term experiments lasted for 18, 30 and 32 weeks respectively, while the long term experiment to determine life time utilization of calcium carbonate lasted for 15 months. In the short term experiments, hatchlings were divided into densities of one, ten and 50 snails. In the 10 snail group, there was a positive correlation between calcium provision, body weight (t test, p < 0.01; r = 0.96, p < 0.0001) and shell length (t test, p < 0.01; r = 0.96, p < 0.00001). There was also a positive correlation between increase in shell length and availability of calcium in the 1 snail group (t test, p< 0.01; r = 0.99, p < 0.00001). In the 50-snail group, the correlation was positive for shell length of the snails (t test, p < 0.05; r = 0.99, p < 0.0001) and body weight (t-test, p < 0.05; r = 99, p < 0.00001). Mortality was very high in the snails deprived of calcium and they did not produce eggs. In the long term experiment, there were three feeding peaks in L. flammea. In the first feeding peak, amount of food and calcium ingested by the snails increased in the first three months of life. The second feeding peak occurred at six months of age, while the last occurred at 10 months of age. The amount of calcium ingested during the second peak decreased gradually in the 4th and 5th month. The amount of calcium ingested was lowest during the 3rd feeding peak. The period of highest weight gained by the snails was between the 1st and 6th month and then dropped at between six and 12 months of age which corresponds to the period of egg production. There were also three peaks of egg production; the first was between six and eight months (535 eggs), the second at between 10 and 11 months (350 eggs) and the third at 13 to 14 months (310 eggs) respectively."}