{"doi": "https://doi.org/10.1093/mollus/eyt002", "year": 2013, "abstract": "Although many studies have dealt with the spatial distribution of land-snail species and individuals, the effect of quadrat size on the interpretation of distributional patterns at small scales has rarely been investigated. We studied the spatial pattern of terrestrial snail distributions within a continuously sampled area of homogeneous habitat at very small scales (<1 m2). The sampling was conducted in two contrasting habitat types: deciduous forests (29 sites) and treeless fens (23 sites) in Central Europe; each site consisted of three nested quadrats (25 × 25 cm2, 50 × 50 cm2 and 75 × 75 cm2). On average the forest plots harboured higher numbers of species than fen plots and fen assemblages were composed of significantly smaller species in body volume. Numbers of species and individuals in smaller quadrats estimated from those present in larger ones often deviated significantly from those actually observed, showing frequently aggregated distribution of snails. These deviations were most marked for comparisons involving the smallest quadrats, whereas they almost disappeared in comparisons of large and middle-sized quadrats, both for species and individuals in both habitat types. Proportional deviances between collected and estimated numbers were always significantly higher for individuals than for species, with only one exception. Our results extend previous observations of land-snail spatial aggregations and they raise questions about environmental heterogeneity even in visually homogeneous areas or about possible biotic interactions among individual species. The steeper slope of the regression between area and numbers of species in log-log space from the smallest to the middle quadrat than from the latter to the largest quadrat, and the existence of several cases in which the observed richness was significantly greater than that predicted from rarefaction, suggest that even at this scale there are still idiosyncratic variations in the range of microhabitats available within quadrats."}