{"doi": "https://doi.org/10.1093/mollus/eyt012", "year": 2013, "abstract": "Sperm length varies considerably, both between and within species, but the evolutionary implications of this variation are poorly understood. Sexual selection on sperm length requires a significant additive genetic variance, but few studies have actually measured this. Stylommatophoran gastropods have extraordinarily long sperm. However, the extent of intraspecific variation has rarely been examined. Here we present the first estimates of heritability of sperm length in the land snail Arianta arbustorum using two complementary approaches (one-parent–offspring regression and full-sibling split design). We also examined whether sperm length is influenced by the shell size of the snail and estimated heritability of shell size. Sperm delivered by the same individuals in 2–4 matings over two reproductive seasons did not differ in length, indicating a high repeatability of this trait. Offspring of 10 families were kept at three temperatures (11, 15 and 20°C) to examine the influence of different environmental conditions on sperm length and adult shell breadth. Independent of shell breadth, sperm length was affected by temperature but not by family of origin (the variance component associated with family was not significantly different from zero), while adult shell breadth was influenced by temperature and family of origin. Higher temperatures resulted in shorter sperm, but larger shells. The heritability of sperm length derived from the two different approaches (one-parent–offspring regression: h2 ± SE = 0.52 ± 0.55; full-sibling split design: H2 ± SE = −0.19 ± 0.28) suggests relatively little genetic variation in this trait in the studied population. In contrast, the heritability of adult shell breadth indicates a strong genetic effect (mother–offspring regression, h2 ± SE = 0.90 ± 0.33). The heritability (h2 ± SE) of adult shell breadth obtained from the father–offspring regression was 0.18 ± 0.42, i.e. five times smaller than that of the mother–offspring regression, suggesting a maternal effect on shell size."}