{"doi": "https://doi.org/10.1111/j.1365-2699.2009.02115.x", "year": 2009, "abstract": "Abstract Aim Local‐scale diversity patterns are not necessarily regulated by contemporary processes, but may be the result of historical events such as habitat changes and selective extinctions that occurred in the past. We test this hypothesis by examining species‐richness patterns of the land snail fauna on an oceanic island where forest was once destroyed but subsequently recovered. Location Hahajima Island of the Ogasawara Islands in the western Pacific. Methods Species richness of land snails was examined in 217 0.25 × 0.25 km squares during 1990–91 and 2005–07. Associations of species richness with elevation, current habitat quality (proportion of habitat composed of indigenous trees and uncultivated areas), number of alien snail species, and proportion of forest loss before 1945 in each area were examined using a randomization test and simultaneous autoregressive (SAR) models. Extinctions in each area and on the entire island were detected by comparing 2005–07 records with 1990–91 records and previously published records from surveys in 1987–91 and 1901–07. The association of species extinction with snail ecotype and the above environmental factors was examined using a spatial generalized linear mixed model (GLMM). Results The level of habitat loss before 1945 explained the greatest proportion of variation in the geographical patterns of species richness. Current species richness was positively correlated with elevation in the arboreal species, whereas it was negatively correlated with elevation in the ground‐dwelling species. However, no or a positive correlation was found between elevation and richness of the ground‐dwelling species in 1987–91. The change of the association with elevation in the ground‐dwelling species was caused by greater recent extinction at higher elevation, possibly as a result of predation by malacophagous flatworms. In contrast, very minor extinction levels have occurred in arboreal species since 1987–91, and their original patterns have remained unaltered, mainly because flatworms do not climb trees. Main conclusions The species‐richness patterns of the land snails on Hahajima Island are mosaics shaped by extinction resulting from habitat loss more than 60 years ago, recent selective extinction, and original faunal patterns. The effects of habitat destruction have remained long after habitat recovery. Different factors have operated during different periods and at different time‐scales. These findings suggest that historical processes should be taken into account when considering local‐scale diversity patterns."}