{"doi": "https://doi.org/10.1002/zoos.201200004", "year": 2012, "abstract": "A new genus of camaenid land snail, Youwanjela, is described from the Kimberley Region, Western Australia for the species previously named Hadra wilsoni Solem, 1979. The original description and genus affiliation of this species was based exclusively on shell characters. Here we describe the genital anatomy for the first time based on examination of topotypic material from the valley of the Youwanjela Creek, Prince Regent Nature Reserve, north-western Kimberley. The new genus Youwanjela is characterised by unique combination of key characteristics in shell and genitalia that is not found in any other camaenid genus in Australia, particularly not in Hadra bipartita (Férussac, 1822) from Queensland, the type species of the genus Hadra, or other camaenids from the Kimberley. This combination of features comprises a comparatively large, thin, broadly subglobose and almost uniform brown shell, an elongated vagina with corrugated longitudinal pilasters on its inner wall, a long and tubular bursa copulatrix, an elongated penis with interlocking, rhomboid pustules in posterior and corrugated longitudinal pilasters in anterior part of the inner penial wall, lack of a penial sheath, a well developed, tubular epiphallus with corrugated pilasters on inner wall with a tiny flagellum. By removing the present species from the genus Hadra, we demonstrate that this genus is endemic to the Wet Tropics of north-eastern Queensland, including Cape York and Torres Strait islands. By contrast, Youwanjela is an endemic camaenid of the Kimberley, Western Australia. This taxonomic treatment is supported by molecular phylogenetic data and reflects general patterns of distribution in the Australian Camaenidae, which are characterised by marked local endemism on the species to genus level and by a phylogeographic divide between eastern and western Australian groups. Our finding underpins the importance of both the extreme north-east and north-west of Tropical Australia as hotspots of endemism and diversity for camaenid land snails. (© 2012 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim)"}