{"doi": "https://doi.org/10.1163/18759866-08301001", "year": 2014, "abstract": "The present work revises the taxonomy of one group of camaenid gastropods from Timor-Leste based on the study of a large number of recently collected ethanol preserved samples as well as historic museum material, including types. By employing comparative analyses of the variation in morphological features (shell, penial anatomy) and the differentiation in mitochondrial DNA sequences of the cytochrome c oxidase subunit 1 gene (COI) and the 16S rDNA (16S), altogether nineteen species are recognized from Timor-Leste and adjacent areas in the Lesser Sunda and Moluccas, such as West-Timor, Adonara, Leti and Sermata Islands (Indonesia). Four of these species were described previously and have mostly been placed within the genus Chloritis Beck, 1837 in the few historic treatments available. Fifteen species found to be new are formally described. In contrast to the previous taxonomic treatment, placement in the genus Parachloritis Ehrmann, 1912 is proposed on grounds of comparative shell morphology. Molecular phylogenetic analyses revealed that all examined species form a monophyletic group, which encompasses diverse shell forms. While most species have shells of the general chloritid type, which are of little taxonomic utility, highly distinct shell morphs (trochoid shells, dwarf forms) have originated within this radiation in independent lineages. Morphological change has occurred in some taxonomic lineages while the bulk of Parachloritis species has maintained an ancestral shell phenotype. This phenotypic stasis is attributed to stabilizing selection in species, which have maintained associations with ancestral habitats, while distinct shell forms have evolved as result of habitat shifts. Consequently, purely shellbased taxonomies are prone to errors due to misjudging the significance of shell characters. While some Parachloritis species uncovered here were found to be narrowly endemic, others had wide distributions that include more than one island. Narrow range endemism was predominantly found in dwarf species and in species that live in high altitudes."}