{"doi": "https://doi.org/10.1093/mollus/eyp031", "year": 2009, "abstract": "Pulmonate snails and slugs are simultaneous hermaphrodites, although some species have a short ‘male’ phase during which only sperm are produced (i.e. they are ‘slightly protandric’, see Jordaens, Dillen & Backeljau, 2007). Pulmonates are well known for their wide variation in life-history characters, in traits such as fertility and fecundity, which are influenced by a number of genetic and environmental factors (reviewed in Jordaens et al., 2007). Among the factors affecting life history in hermaphroditic organisms, the breeding system (i.e. selffertilization, outcrossing or a combination of both) is one of the most important, since it is intimately related to inand outbreeding depression and sex allocation (Jordaens et al., 2007). Therefore, in order to study the evolution of life-history characters in hermaphrodites, a sound knowledge of the breeding system is indispensable. In theory, simultaneously hermaphroditic snails are capable to reproduce both by outcrossing and self-fertilization (e.g. Heller, 2001). However, the breeding system varies greatly within and among basommatophoran (reviewed by Duncan, 1975; Brown & Richardson, 1988; Vianey-Liaud, 1990; Jarne, Vianey-Liaud & Delay, 1993; Jarne & Stadler, 1995; Dillon, 2000) and stylommatophoran (reviewed by Duncan, 1975; Selander & Ochman, 1983; Brown & Richardson, 1988; Heller, 1993) species. Heller (1993) lists 18 pulmonate genera (of 12 families) that are capable of self-fertilization. Basommatophoran species in particular seem to have a mixed breeding system (i.e. they combine outcrossing and selffertilization) and several of these species show significant geographical variation in their breeding system (Jordaens et al., 2007). Nevertheless, several stylommatophoran genera (e.g. Arion, Cochlicopa; see Jordaens et al., 2007 and references therein) contain, besides species that appear to be strict outcrossers or strict self-fertilizers, additional species that have a mixed breeding system (reviewed in Jarne & Auld, 2006). A case in point is the stylommatophoran family Succineidae in which self-fertilization has been demonstrated in eight species of five genera, viz. Succinea grosvenori, Succinea unicolor, Succinea campestris, Omalonyx feline, Oxyloma retusa, Oxyloma salleana, Catinella sp. and Quickia spurca (Patterson, 1970). Nine other species (not listed) did not reproduce by self-fertilization (Patterson, 1970). So far, the breeding system of Succinea putris (Linnaeus, 1758) is not known although it is the most common and widely distributed European succineid species. The mating behaviour of the species is relatively well known (Rieper, 1912; Hecker, 1965; Jordaens, Pinceel & Backeljau, 2005; Dillen et al., 2008; Dillen, Jordaens & Backeljau, in press). Mate choice is random with respect to shell size, yet, in pairs where the partners are of unequal shell size, most commonly the smaller individual mounts the shell of the lower, larger individual during courtship. Penes are intromitted reciprocally and, in general, sperm are also transferred reciprocally (Jordaens et al., 2005). Eggs are laid in gelatinous translucent masses from April until the end of September (Rieper, 1912; Hecker, 1965). Although copulations are easily observed in natural populations during the breeding season, or under laboratory conditions, the exchange of sperm is no proof of outcrossing. Thus, it is unknown whether the species is capable of self-fertilization. Here, we studied the variation in life-history characters in S. putris under controlled laboratory conditions, with special emphasis on the effects of the breeding system on life-history variation. Approximately 100 recently hatched snails (shell height ,3 mm) were collected from a population in Wilrijk (Belgium) in November 2005. The snails were kept isolated in transparent plastic containers (7.5 cm diameter 5.5 cm height) of which the bottom was covered with moist paper during the first 2 months. Afterwards, the bottom was covered with a layer of moist compost to which calcium carbonate powder was added. The containers were placed in a climatecontrolled room (208C) under a light:dark cycle of 18 h light:6 h dark. Lettuce, carrots and leaves of Populus x canadensis and Alnus glutinosa were given as food ad libitum. Every second day, containers were cleaned and fresh food and leaves were provided. The compost was changed every 2 months. Individuals of S. putris with a shell height above 9 mm are able to copulate (personal observations). Most individuals were large enough for use in a mating trial after 4 months. After 5 months the remaining individuals had also reached the required body size and these were used for another mating trial. During a trial, the sexually mature individuals were put together in a large container. Then, approximately one-third of the individuals were drawn randomly from the pool, while the other individuals were allowed to copulate. Copulating pairs were gently removed from the container to prevent disturbance by other snails. After copulation, both partners were kept isolated as described above. Thus, there were a total of 46 single-mated individuals (i.e. 23 pairs) and 43 unmated individuals of which the life history was followed. Every day or every second day the containers were checked for the presence of egg clutches. Egg clutches were weighed to the nearest 0.0001 g using an electronic Sartorius balance. The eggs of each clutch were counted (1⁄4 clutch size) and checked for the presence of multiple embryos under a binocular microscope. Subsequently, the egg clutches were transferred to containers containing wet paper and kept in the same climate-controlled room. Every day or every second day the clutches were checked for hatched juveniles, which were counted and transferred to other containers. If eggs failed to develop within 45 days they were considered to be unfertilized. The hatching period was defined as the number of days between the clutch being laid and the day when 50% of the eggs hatched, and hatching success as the proportion of successfully hatched eggs. All snails were followed until they died, after which their shell height and shell width were measured to the nearest 0.01 mm with calipers (except for a few shells that were broken during dissection), and shell volume was calculated as V 1⁄4 (4/3) Correspondence: L. Dillen; email: lubina.dillen@ua.ac.be"}