{"doi": "https://doi.org/10.1093/mollus/eyq026", "year": 2010, "abstract": "The relative importance of body size as a factor in life-history variation is poorly understood in hermaphrodites, especially in reciprocally mating species. Succinea putris is a reciprocally mating land snail with different courtship roles, i.e. an ‘active’ individual mounts the shell of a ‘passive’ partner after which penes are intromitted simultaneously. This species was used to examine (1) the relation between individual body size and fecundity; (2) whether an individual's body size affects fecundity of the partner; (3) the relation between courtship role and fecundity; and (4) the relation between clutch size and egg weight under laboratory conditions. Simultaneously, we studied growth rate, hatching success and time budgets, as these may co-vary with fecundity. First, highly significant correlations between an individual's body size and its fecundity and between an individual's body size and the onset of egg laying were found. These effects were influenced by the relative size of the two partners in a mating pair and the effects on fecundity were observed only in passive (not active) individuals. Second, larger individuals laid heavier eggs. Third, active and passive individuals did not differ in fecundity, egg weight, the number of eggs in the first clutch, total egg weight, hatching success or onset of egg laying. Within pairs active individuals were significantly smaller than their passive partners. Finally, we found a trade-off between clutch size and egg weight. We conclude that our results are in agreement with the gender-ratio hypothesis which states that mating behaviour in hermaphrodites should be flexible and determined by the potential male and female fitness gain in each single mating interaction. Whether the observed interindividual variation in fecundity originates from body-size-dependent sex allocation needs to be studied further. A shift towards the female function as a result of sexual isolation after copulation could explain why active and passive individuals showed similar lifetime fecundities and why effects of body size on fecundity were not observed in active individuals."}