{"doi": "https://doi.org/10.18195/issn.0313-122x.68.2005.039-051", "year": 2005, "abstract": "Richness and shell size distributions of land snail faunas were analyzed from 838 sites sampled within ten geographic regions spread across a 2,300 x 2,800 km area in eastern North America, extending from tundra and taiga to tallgrass prairie, mixed boreal-hardwood, deciduous and evergreen subtropical forest. A total of 410,667 individuals from 166 taxa were encountered. These data documented: (1) Eastern North American land snail communities are frequently marked by high levels of syntopic species richness. Over 52% of sites exceeded 12 co-occurring taxa, with almost 10% supporting more than 24 taxa. Two percent of sites harbored 30 or more taxa. (2) Site richness was inversely related to latitude, with an almost 5-fold decrease towards the north. (3) Site richness was least in oligotrophic and grassland habitats, and greatest on base-rich bedrock outcrops. (4) Communities are dominated by taxa with maximum shell dimensions of <5 mm, representing almost 75% of species and over 80% of individuals within sites in most regions. Taxa with shells 10 mm or larger never constituted more than 16% of taxa and 7% of individuals in average sites. (5) Northern communities harbored a more narrow range of size distributions, with both the largest (10+ mm) and smallest «2 mm) size classes becoming less frequent. (6) Medium and large shelled taxa were most frequent in outcrop and lowland forest habitats, while minute species were most frequent in grasslands. (7) The contribution of a and y diversity to regional richness was greatest in the north, with 41 % of taxa being found on average in Churchill, Manitoba sites. However, the contribution of ~ diversity peaked in the south. These results suggest that the latitudinal gradient in land snail richness in eastern North America is related not only to an increase in the number of niches and guilds towards the south, but also to increased niche overlap towards the north."}