{"doi": "https://doi.org/10.1093/mollus/70.2.107", "year": 2004, "abstract": "We studied dispersal patterns in a representative population of the rock-dwelling land snail Albinariacoerulea (Clausiliidae), to obtain direct estimates of gene flow and to predict the spatial scale and mode of population differentiation and expansion. We recorded and estimated per month, at the site of Vravrona (Attica, Greece), for a period equal to the assumed generation time (2.5 years), dispersal distances and directions from four remote release stations and minimal movements from recapture points of 200 individually marked specimens. Mean dispersal and minimal movement distances were small (162.4 and 53.5 cm, respectively), with most individuals moving short or medium distances, and few individuals dispersing longer distances (extreme recorded values: 750 and 844 cm). We found significant monthly fluctuations of dispersal and minimal movement distances, but not any auto‐ or partial correlation of those distances at any time lag, or relation to density and climatic factors. The differing dispersal patterns between stations were attributed to differences in the relative abundance and proximity of suitable refugia (crevices) at each station. Dispersal was not random but no systematic directional trends or migration from station to station were detected. However, spatial distribution was associated with evident clustering behaviour and the occurrence and connectivity of suitable refugia. Neighbourhood size was relatively small on average (198), but varied significantly (13–1082), depending on the varying dispersal and density values and habitat structure. The estimated low mean and the extreme recorded values of dispersal distances, the lack of systematic dispersal trends, and the association of dispersal and spatial patterns with habitat suitability and connectivity, along with clustering behaviour, support the hypothesis of a mixed population structure with adjacent subpopulations partly separated by physical barriers, and occasionally significant isolation‐by‐distance processes within each subpopulation. Therefore, we cannot dismiss the potential role of genetic drift and natural selection in promoting very local differentiation, especially in cases of less dense and more isolated populations."}