{"doi": "https://doi.org/10.1111/j.0014-3820.2006.tb01867.x", "year": 2006, "abstract": "Abstract Species richness on island or islandlike systems is a function of colonization, within-island speciation, and extinction. Here we evaluate the relative importance of the first two of these processes as a function of the biogeographical and ecological attributes of islands using the Galápagos endemic land snails of the genus Bulimulus, the most species-rich radiation of these islands. Species in this clade have colonized almost all major islands and are found in five of the six described vegetation zones. We use molecular phylogenetics (based on COI and ITS1 sequence data) to infer the diversification patterns of extant species of Bulimulus, and multiple regression to investigate the causes of variation among islands in species richness. Maximum-likelihood, Bayesian, and maximum-parsimony analyses yield well-resolved trees with similar topologies. The phylogeny obtained supports the progression rule hypothesis, with species found on older emerged islands connecting at deeper nodes. For all but two island species assemblages we find support for only one or two colonization events, indicating that within-island speciation has an important role in the formation of species on these islands. Even though speciation through colonization is not common, island insularity (distance to nearest major island) is a significant predictor of species richness resulting from interisland colonization alone. However, island insularity has no effect on the overall bulimulid species richness per island. Habitat diversity (measured as plant species diversity), island elevation, and island area, all of which are indirect measures of niche space, are strong predictors of overall bulimulid land snail species richness. Island age is also an important independent predictor of overall species richness, with older islands harboring more species than younger islands. Taken together, our results demonstrate that the diversification of Galápagos bulimulid land snails has been driven by a combination of geographic factors (island age, size, and location), which affect colonization patterns, and ecological factors, such as plant species diversity, that foster within-island speciation."}