{"doi": "https://doi.org/10.1890/0012-9658(2000)081[1225:cbtesi]2.0.co;2", "year": 2000, "abstract": "An introduced snail, Batillaria attramentaria, has successfully invaded several salt marshes and mud flats in northern California. In these areas populations of the native mud snail, Cerithidea californica, have declined precipitously. Since both species feed on epipelic diatoms, I hypothesized that the decline in Cerithidea was a result of exploitative competition with Batillaria. To test this hypothesis I manipulated snail densities in Bolinas Lagoon, California, to estimate their effects on, and responses to, food resources. For two size classes of each snail species I quantified (1) the effect of intraspecific density on food availability, and (2) the growth response of each size class to different food levels. These relationships were used to generate predictions of the exploitative competitive effect of each snail on the other species. These predictions were tested against direct measurements of the effect of interspecific competition on snail tissue growth using field experiments. The observed values of snail growth matched well the predicted relationships, suggesting that exploitative competition does occur. Although the two snails did not differ in their effect on resource levels at any experimental snail density, the introduced snail was always more efficient at converting limited resources to tissue growth. Similar results were obtained in three different experimental periods. Batillaria‘s enhanced resource conversion efficiency provides a sufficient explanation for its successful invasion and subsequent exclusion of Cerithidea. Theoretically, conversion efficiency of resources should be just as important as resource suppression and uptake to exploitative competitive ability, but it is rarely examined experimentally. By separating exploitative competition into its component parts, the protocol used here allowed identification of a seldom implicated mechanism that can affect invasion success."}