{"doi": "https://doi.org/10.1111/jbi.12692", "year": 2016, "abstract": "Abstract Aim Land snails, because of their low vagility, are ideal organisms for probing biogeographical hypotheses. This study is the first to examine the evolutionary and biogeographical history of a group of land snails from the Caribbean region using molecular phylogenetics. It focuses on the family Urocoptidae that displays extraordinary diversity, particularly in the Greater Antilles. Location Caribbean region. Methods We reconstructed the phylogeny of Urocoptidae based on multi‐locus (partial 28S, H3 and COI sequences) analyses ( MrBayes , BEAST , GARLI ) of 65 species, representing 44 recognized genera. Biogeographical analyses of a subset of the time‐calibrated BEAST trees were made both with ( DEC and DEC +J analysis in BioGeo BEARS ) and without (S‐ DIVA in RASP ) palaeogeographical assumptions. In the DEC and DEC +J analyses we examined the effect of different settings for dispersal between directly connected areas relative to that between areas without direct land connection. Results Urocoptidae has been present on the Greater Antilles Arc from at least Middle Eocene onwards. Morphologically diverse and previously unrecognized clades evolved on most Caribbean (palaeo)islands. Jamaica was colonized at least twice. Dispersal multiplier matrices with moderately constrained dispersal between areas without direct land connections describe the phylogeographical history of the family with higher DEC and DEC +J lnL scores than uniform matrices. Main conclusions Urocoptids constitute an old element of the Greater Antillean biota, predating a proposed GAAR landia landspan connection to South America. The biogeographical history and evolution of Urocoptidae were shaped primarily by the geographical distribution of Caribbean landmasses, in combination with occasional oversea dispersal. Oversea dispersal allowed colonization of palaeogeographically isolated areas, such as Jamaica and present‐day western Cuba, where presumably the absence of ecological competitors led to independent radiations into similar shell types."}