{"doi": "https://doi.org/10.1080/00852988.1988.10673999", "year": 1988, "abstract": "Abstract The Ningbing Ranges and Jeremiah Hills are home to what is perhaps the greatest concentration of short range restricted e ndemic species found anywhere in the world. A radiation of more than 28 mainly allopatric species of camaenid land snails is packed into 52 km of limestone hills. The median linear range of a species is 1.65 km; the median area range is 0.825 km2. Located in the far northeastern tip of Western Australia between the east bank of the Ord River and the Northern Territory border, the Ningbing Ranges and Jeremiah Hills are Devonian limestone reef remnants, generally much less than 500 meters wide, that rarely reach 50–60 meters in height. The Ningbing Ranges have a length of 43.5 km; the Jeremiah Hills occupy a triangular area some 8.4 km on a side. Most of this remarkable diversity occurs within three restricted endemic genera of the pulmonate land snail family Camaenidae – Ningbingia Solem, 1981 with six species and one subspecies; Turgenirubulus Solem, 1981 with eight species; and Cristilabrum Solem, 1981 with eleven described and another probably new species. It is anticipated that additional species will be discovered. Another restricted endemi , hort range species of the East Kimberley genus, Ordtrachia Solem, 1984 is known from a small eastern outlier of the Jeremiah Hills (O. efegans Solem, 1988). This is an in situ, still exuberant, radiation filling all habitable parts of the area, not an example of constricted ranges in a group approaching extinction. In addition to the above endemics that occupy only a portion of the ranges, two land snail taxa, a hydrocenid prosobranch, Georissa, new species and a pupillid, Gyliotrachela ningbingia Solem, 1981, are common throughout much of the area. The nearest recorded species of Ceorissa Blanford, 1864 are in Indonesia and coastal Queensland. The other Australian species of Gyliotrachela live in the Napier Range of the southwest Kimberley, near Katherine, Northern Territory, and the Chillagoe Caves area of northern Queensland (Solem, 1981c). The above 30 species of endemic and restricted land snails are supplemented by a number of much more widely distributed, but also indigenous taxa: 1) eight species that occur within the main masses of at least the Ningbing Ranges (Gastrocopta, new species, Pupoides pacificus [pfeiffer, 1846], Eremopeas interioris [Tate, 1894], Stenopylis coarctata [Moellendorff, 1894], Discocharopa aperta [Moellendorff, 1888], Austrosuccinea sp., Westracystis lissus [E. A. Smith, 1894], and Xanthomelon obliquirugosa [E. A. Smith, 1894]); 2) one camaenid, Torresitrachia weaberana Solem, 1979, that lives on the dry fringes of the area; 3) one species, Pupisoma orcula (Benson, 1850), recorded once from the Central Ningbing Range; and 4) three species (Pupisoma sp., Nesopupa mooreana [E. A. Smith, 1894], and Coneuplecta microconus [Mousson, 1865]) that have been found only in the wet margins of Brolga Spring or seasonally wet margins of the North Ningbing Range. The total known land snail fauna is thus 43 species. A number of additional species found in nearby non-limestone hill systems help to define the fauna of the limestone ranges. The climate of the Ningbing region is monsoonal, with an average rainfall of about 776 mm, nearly all between early November and mid-April of the next year. Snail activity nights (SAN) probably average about 78/year, with the rest spent in partial to deep aestivation. The Ningbing-Jeremiah Hills area is much drier than the Mitchell Plateau to the west or Darwin region to the east. The latter have rain forest patches and nearly closed canopy forest, while the Ningbings have open savannah type cover with baobabs the most conspicuous tree. The restricted and short range endemic camaenid genera are allopatric, with Ningbingia in the North Ningbing Range; Turgenitubulus in the Central Ningbing Range, The Gorge, and The Pillars; Cristilabrum in a small portion of the Central Ningbing Range (but never sympatric with Turgenitubulus), South Ningbing Range, and Jeremiah Hills. All species in these genera live only within rubble or crevices on the limestone outcrops. None have been found living in plains areas or on neighbouring sandstone hills. The ranges of all species are continuous, never interrupted by an intrusive zone of another species. Four species (Table 6) have ranges broken up by uninhabitable stretches of mud or alluvial plains, so that their linear ranges are longer than their actual inhabitable ranges. Species range data are summarized in both linear (Table 5) and area (Table 7) terms. For the 28 restricted range endemic camaenids, the linear ranges vary from 0.1 to 6.1 km (median 1.65 km), and the area range from 0.01 to 7.45 km2 (median 0.825 km2). These area estimates are much greater than the actual inhabited areas, since much of the limestone masses are domed rock with neither fissures nor rubble heaps, and thus provide neither shelter nor feeding areas for the snails. Even with this overestimation of range areas, these species provide an astounding example of in situ speciation resulting in microgeographic species ranges. Boundaries between many species do not correspond with breaks in rock masses. In the North Ningbings, Ningbingia bulla, N. dentiens, N. laurina, N. octova, N. res, and N. a. australis share the same mass (Map 17), with only N. a. elongata isolated. The first five species show some sympatric overlap (Table 8). The Central Ningbing Range (Map 20) is broken up into a greater number of separate rock masses. Known ranges of Turgenirubulus species are mostly composed of allopatric rock mass cluste rs. The South Ningbing Range (Map 23) shows a va riety of distribution types. Cristilabrum buryillum and C. simplex live on several rock masses; C. monodon occupies one mass by itself, then shares the main southern mass with two other species, C. primum and C. grossum in allopatric succession (Map24). There are seven examples (Table 8) of microsympatry among two species, and one involving three species. The degree of overlap varies from 4.5% to 100% of known ranges. Anatomical differences in structures among such sympatric species provide the strongest evidence that different species are present. In discussing creation of biotic reserves to preserve species or communities, the focus continues to be on comparatively large areas. Whereas 50,000 km2 may be a \"restricted range\" for a species of vertebrate, the evidence presented below demonstrates that areas of less than 1 km2 can cover the entire range of land snail species. A refocus of interest in establishing reserves to include such restricted range taxa may enable conserving not only land snails, but many plant and arthropod taxa. These \"mini-reserves\" could be established at a fraction of the cost involved in salvaging larger areas."}