{"doi": "https://doi.org/10.1074/jbc.m115.704395", "year": 2016, "abstract": "Animals have evolved many ways to enhance their own reproductive success. One bizarre sexual ritual is the “love” dart shooting of helicid snails, which has courted many theories regarding its precise function. Acting as a hypodermic needle, the dart transfers an allohormone that increases paternity success. Its precise physiological mechanism of action within the recipient snail is to close off the entrance to the sperm digestion organ via a contraction of the copulatory canal, thereby delaying the digestion of most donated sperm. In this study, we used the common garden snail Cornu aspersum to identify the allohormone that is responsible for this physiological change in the female system of this simultaneous hermaphrodite. The love dart allohormone (LDA) was isolated from extracts derived from mucous glands that coat the dart before it is stabbed through the partner's body wall. We isolated LDA from extracts using bioassay-guided contractility measurement of the copulatory canal. LDA is encoded within a 235-amino acid precursor protein containing multiple cleavage sites that, when cleaved, releases multiple bioactive peptides. Synthetic LDA also stimulated copulatory canal contractility. Combined with our finding that the protein amino acid sequence resembles previously described molluscan buccalin precursors, this indicates that LDA is partially conserved in helicid snails and less in other molluscan species. In summary, our study provides the full identification of an allohormone that is hypodermically injected via a love dart. More importantly, our findings have important consequences for understanding reproductive biology and the evolution of alternative reproductive strategies. Animals have evolved many ways to enhance their own reproductive success. One bizarre sexual ritual is the “love” dart shooting of helicid snails, which has courted many theories regarding its precise function. Acting as a hypodermic needle, the dart transfers an allohormone that increases paternity success. Its precise physiological mechanism of action within the recipient snail is to close off the entrance to the sperm digestion organ via a contraction of the copulatory canal, thereby delaying the digestion of most donated sperm. In this study, we used the common garden snail Cornu aspersum to identify the allohormone that is responsible for this physiological change in the female system of this simultaneous hermaphrodite. The love dart allohormone (LDA) was isolated from extracts derived from mucous glands that coat the dart before it is stabbed through the partner's body wall. We isolated LDA from extracts using bioassay-guided contractility measurement of the copulatory canal. LDA is encoded within a 235-amino acid precursor protein containing multiple cleavage sites that, when cleaved, releases multiple bioactive peptides. Synthetic LDA also stimulated copulatory canal contractility. Combined with our finding that the protein amino acid sequence resembles previously described molluscan buccalin precursors, this indicates that LDA is partially conserved in helicid snails and less in other molluscan species. In summary, our study provides the full identification of an allohormone that is hypodermically injected via a love dart. More importantly, our findings have important consequences for understanding reproductive biology and the evolution of alternative reproductive strategies."}