{"doi": "https://doi.org/10.2307/2421612", "year": 1948, "abstract": "These data are presented now, despite incompleteness, because of their imnplications on the functional relationships of the various sex organs exhibited by gastrodontin landsnails, and because of their bearing on the problem of hybridism in these snails. Similar methods 'were used in obtaining these data as have been used in studies of polygrid snails (Webb, 1947). Caged specimens oiily were studied, and the matings observed occurred under artificial conditions. In nomenclature, I have followed Pilsbry's Land Mollusca of North America, vol. 2, part 1. Without the accessibility to most of the literature on these zonitid snails supplied by this work, the present paper would not have been attempted in the spare-time available. Figures 1, 2, 6, and 7 are somewlhat diagrammatic, and have been drawn (greatly enlarged) from the freshly dissected material. Figures 3, 4, and 5 are from projection-tracings (inversion uncorrected) of material mounted in Canada balsam, and the scale-lines represent 2 mm. The anatomy illustrated by fig. 5 is somewhat distorted from the effects of its former preservation in sodium silicate. Three species of Ventridens are discussed in this paper; while an unidentified species (V. dimissus brittsi? (Pilsbry), from Mt. Magazine, Ark.?) is also briefly mentioned. The basis of the presented data is: 5 specimens and 3 matings of Ventridens ligera (Say), 2 specimens and 1 mating of V. suppressus (Say), 2 specimens and 1 mating of V. intertextus (Binney), and 1 mating of the unidentified Ventridens with a specimen of V. ligera. Except for several instances of voluntary matings among group-cultured specimens, all of the matings observed have been planned matings. For this reason mating periodisms would have been unlikely of observation; and, indeed, no evident periodicity of mating was noted. However, one volutary mating occurred in the daytime shortly after the dry cage had been remoistened, and this might be interpreted as indicating a possible correlation of matings to periods of rainfall or high humidity. In this regard concerning Zonitoides arboreus (Say), Bartsch & Quick (1926) have written: Most of the specimens found conjugating were discovered in the early morning on moist days. Unfortunately I have not observed any matings of Ventridens species in the field, and any who note such should add to our knowledge by publishing detailed descriptions, by obtaining photographs, or by securing matinganatomies.2"}