{"doi": "https://doi.org/10.2307/3226962", "year": 1998, "abstract": "When offered an egg of the land snail Anguispira alternata, the carnivorous land snail Haplotrema concavum manipulates it, rotating the egg with its foot and rubbing its mouth on the surface of the egg shell. After -24 minutes of such manipulation, the egg is transported by the carnivore to a covered location where it is consumed. Transport is accomplished by a repetition of the following steps: disengagement and movement away from the egg, turning back toward the egg, extension of the body from the shell toward the egg, contact with the egg, and retrieval of the egg by pulling back toward the shell. Consumption of young hatchlings of other snail species involves a similar manipulation and transport of the prey. Additional key words: behavior, food-transport The existence of simple, stable, and stereotypical behaviors among marine, freshwater, and terrestrial gastropods has made many of these snails and slugs model organisms for the study of the cellular basis of behavior (Getting 1985). Among the behaviors that have been the recent focus of attention is the exhibition of food preferences (Teyke 1995; Atkinson & Balaban 1997). The analysis of food preference in terrestrial gastropods has been primarily concerned with optimal foraging theory (Pearce & Gaertner, 1996) or the phenomenon of associative conditioning (Teyke 1995). The ability of these animals to distinguish between potential food items suggests that food preference studies may help reveal the sensory capabilities of these animals and eventually elucidate how such sensory input is processed and appropriate motor response produced. The study reported here is a consequence of an analysis of the process of food choice in the carnivorous land snail Haplotrema concavum SAY 1821. Atkinson & Balaban (1997) have shown that H. concavum prefers the eggs and hatchlings of the herbivorous snail Anguispira alternata to conspecifics, although it occasionally engages in cannibalism. While investigating the means by which these snails distinguish between their own eggs and those of others, it was discovered that these snails manipulate and frequently transport their food to a covered location before consuming it. Since such behavior has never been reported for a land snail, a detailed investigation of this behavior has been a E-mail: atkinso9@pilot.msu.edu undertaken. A basic description of this behavior is pre-"}