{"doi": "https://doi.org/10.1111/j.1558-5646.1993.tb02174.x", "year": 1993, "abstract": "Geographical and temporal variation in gene exchange between two endemic land snail species, Mandarina aureola and Mandarina ponderosa, was studied on Hahajima Island of the Bonin Islands. Allozyme variation in modern samples, and variation in the color and shell morphology of modern and fossil samples, suggest a complex geographical and historical pattern of hybridization. These two species occur in sympatry, and their shell morphologies and protein genotypes are markedly divergent. However, many specimens of M. aureola, collected from the middle region of the island, exhibit intermediate shell morphologies and possess marker alleles of M. ponderosa. Fossil samples of the two species strongly suggest that these intermediates were hybrids with M. ponderosa that were produced since the end of the Pleistocene. Each of these species, in addition, is subdivided into two genetically and morphologically divergent parapatric races. Interspecific hybridization appears to have produced genetical and morphological admixture among these four distinctive groups of populations. The past distribution and geographic variation of M. ponderosa can be traced in the distribution of M. ponderosa‐derived genotypes in current populations of M. aureola. Temporal changes of the color pattern in the fossil populations of hybrids suggest that the traits introduced from M. ponderosa to M. aureola have been affected by natural selection and could replace traits of living species when advantageous. Moreover, these introgressed genes appeared to provide novel properties that enabled M. aureola to advance into a new environment. Relatively independent change in shell color and morphology further suggests mosaic evolution following the hybridization events. Connectively, these data reveal how hybridization events may be an important source of evolutionary novelties and make it clear that the phenomenon of reticulate evolution cannot be ignored."}