{"doi": "https://doi.org/10.2307/3670767", "year": 1984, "abstract": "-Occurrences of land snails are reported and their distribution (especially altitudinal) is discussed in the San Andres and Organ Mountains of southern New Mexico. Collections were made at 50 localities and 24 species were obtained. The San Andres and Organ Mountains form a prominent north-south linear feature, some 150 km in combined length, in south-central New Mexico. Topographically, the two ranges are continuous, although, geographically, they are separated by San Augustin Pass, east of the village of Organ, Dona Ana County. To the east, the ranges are separated by the Tularosa Basin from the Sacramento/Sierra Blanca ranges. To the west, the San Andres Mts. are bordered by the Jornada del Muerto Basin and the Organ Mts. by the Mesilla Valley of the Rio Grande. Some aspects of the ranges, related to occurrence of land snails, have been discussed by Metcalf and Smartt (1977). Insofar as distribution of land snails is concerned, three areas seem discernible: 1. Block-faulted section of San Andres Mts. Most of the San Andres range is comprised of complexly faulted and tilted blocks, predominantly of Paleozoic limestones, which form massive cliffs in many places. Mountains in this section reach 2,000-2,500 m in elevation. Nowhere are these mountains densely wooded, although One-seeded Juniper, Pinyon Pine and various shrubs occur in canyons and on slopes at higher elevations. 2. Salinas Peak area. An exception to the above, in the San Andres Mts., is provided by the area centered around Salinas Peak, highest peak in the range, reaching 2,730 m. Higher parts of this complex are largely of igneous bedrock. The upper, northern slopes of Salinas Peak are forested, much as are higher elevations in the Organ Mts., discussed below. 3. Organ Mountains. These mountains are almost entirely of igneous rocks, mainly of monzonitic and rhyolitic types. Higher peaks reach slightly over 2,700 m. There is considerable forest on higher (especially northfacing) slopes and in canyons down to lower elevations. Dominant species include Ponderosa Pine, Alligator Juniper and Gambel Oak. There is Douglas Fir at higher elevations and at least one relict stand, each, of White Fir (Loc. 34-localities identified below) and of Quaking Aspen (Loc. 32). In these mountains larger species of land snails (mainly Sonorella and Ashmunella) are usually restricted to accumulations of rock talus. In the block-faulted section of the San Andres Mts. such accumulations occur mainly below the massive cliffs mentioned. Smaller species also occur in talus as well as in decaying leaf litter on floors in the areas with deciduous forest. Earth and humus from interstices of mounds of talus and leaf litter T E SOUTHWESTERN ATURALIST 29(1):35-44 MARCH 2 , 84 This content downloaded from 207.46.13.193 on Thu, 08 Sep 2016 05:51:52 UTC All use subject to http://about.jstor.org/terms The Southwestern Naturalist from forested areas were collected in the field and inspected in the laboratory. Specimens are in invertebrate collections of the University of Texas at El Paso. ANNOTATED LIST OF SPECIES.-The taxonomic sequence of Solem (1978) and the taxonomic usages of Bequaert and Miller (1973) are utilized. Localities are given in the Appendix. 1. Cochlicopa lubrica (Miiller). Locs. 4, 36, 40, 43. 2. Gastrocopta ashmuni (Sterki). Locs. 1-3, 5-11, 14, 15, 19, 21-23, 26, 27, 29, 34, 37, 40, 44, 48. 3. Gastrocopta pellucida (Pfeiffer). Locs. 1-3, 5-11, 14, 15, 19, 21-23, 27, 40, 44. 4. Gastrocopta pilsbryana (Sterki). Locs. 4, 27, 28, 30-32, 34-40, 42, 43. 5. Pupilla sonorana (Sterki). Locs. 4, 27, 30-32, 34-36, 38, 39, 42, 43. 6. Vertigo gouldii (Binney). Locs. 4, 30, 35, 38, 42. This species was rare with only a few specimens taken at the localities noted. Most specimens exhibit the 5 denticles ascribed by Pilsbry (1948:975) to the subspecies arizonensis Pilsbry and Vanatta, although a few have, in addition, a small basal denticle. 7. Vallonia perspectiva Sterki. Locs. 3-5, 27-32, 34-40, 42, 43. 8. Holospira roemeri (Pfeiffer). Locs. 7-9, 11, 12, 15-18, 20, 21, 23-25. The occurrences noted here, together with records in the Franklin and Juarez Mts. to the south (in Texas and Mexico) mark the western terminus of the range of this species, widespread to the east and southeast in New Mexico and Texas. In New Mexico, it is not known to occur north of the San Andres Mountains. 9. Bulimulus (Rabdotus) dealbatus (Say) sspp. Locs. 11, 13-15, 18, 20, 24, 25. Taxonomically, the situation with this species is complex in the area treated here. Pilsbry (1946:13, 19) considered two species to exist in the area: (1) Bulimulus pasonis Pilsbry, with type locality in the Franklin Mts., Texas, and recognized by him also from the Sacramento and Guadalupe Mts. of southern New Mexico and adjacent Texas, and (2) Bulimulus dealbatus neomexicanus Pilsbry, a subspecies of the widespread species, B. dealbatus, which ranges from Kansas southward into Mexico. Pilsbry designated the type locality of neomexicanus as Burke's Spring (environs) in the San Andres Mts. and reported it also from the Sacramento and Guadalupe Mts. As represented in the above mountain ranges, shells of the two taxa differ greatly, B. d. neomexicanus being more robust and thickshelled, reaching some 30 mm in height and 19 mm in width, whereas B. pasonis is a much more gracile form, reaching only about 17 mm in height and 9 mm in width (Fig. 1). In a revision of some North American bulimulids, Pratt (1974:24, 25) elevated the subgenus Rabdotus to generic status. He also synonymized Bulimulus pasonis Pilsbry with Bulimulus durangoanus (von Martens), with type locality in Durango, Mexico. He relegated durangoanus to subspecific status under B. dealbatus, noting that the two kinds intergraded in places in Texas and Mexico. In addition, he deemed the subspecies 36 vol. 29, no. 1 This content downloaded from 207.46.13.193 on Thu, 08 Sep 2016 05:51:52 UTC All use subject to http://about.jstor.org/terms"}