{"doi": "https://doi.org/10.1093/sysbio/24.4.465", "year": 1975, "abstract": "Minute genera, whose shell measures less than 100 mm, form 60.0% of the Pacific land snail fauna. In contrast to this, the minute class only represents 27.1% of the continental fauna. The mean generic size in the Pacific fauna is correspondingly lower: 11.9 mm vs. 20.6. The difference between the 2 groups is statistically highly significant. Similarly to the Pacific, the eastern Pacific and eastern Atlantic insular land snail faunas and the wide-spread fauna also are dominated by the minute genera. From these observations it is concluded that minute body size is advantageous for long distance dispersal, both overseas and overland, in the land snails. This in turn indicates that the mechanism involved must be aerial, since only in this type of dispersal are small size and light weight advantageous. The minute species also are, as a rule, more abundant than the large ones, which constitutes a further advantage. Support to the hypothesis is provided by the facts that land snails have been recovered from the plumage of birds; that recently formed volcanic islands have been colonized predominantly by minute land snails, and that mineral particles considerably larger and heavier than the minute land snails have been collected at high altitudes by airplanes. Alternative hypotheses are considered and rejected on the grounds that their tenets are unproven, unnecessary or erroneous; however, it is emphasized that the relationship between body size and area size needs further analysis. The characteristics of insular land snail faunas are summarized as follows: predominance of minute genera; high frequency of primitive, orthurethran genera and families; resemblance to the fauna of the nearest continent; low degree of endemism on the family level, increasingly higher, on the genus and species level, relatively recent origin, through aerial immigration. [Biogeography; body size; aerial dispersal; Pacific land snail fauna.]"}