{"doi": "https://doi.org/10.1086/physzool.13.1.30151526", "year": 1940, "abstract": "Previous articleNext article No AccessSomatic Effects of Temperature on Development in Drosophila melanogaster. I. Phenocopies and Reversal of DominanceG. P. Child, R. Blanc, and H. H. PloughG. P. Child Search for more articles by this author , R. Blanc Search for more articles by this author , and H. H. Plough Search for more articles by this author PDFPDF PLUS Add to favoritesDownload CitationTrack CitationsPermissionsReprints Share onFacebookTwitterLinkedInRedditEmail SectionsMoreDetailsFiguresReferencesCited by Volume 13, Number 1Jan., 1940 Article DOIhttps://doi.org/10.1086/physzool.13.1.30151526 Views: 13Total views on this site Citations: 11Citations are reported from Crossref Journal History This article was published in Physiological Zoology (1928-1998), which is continued by Physiological and Biochemical Zoology (1999-present). PDF download Crossref reports the following articles citing this article:Maddalena A. Di Lellis, Sergej Sereda, Anna Geißler, Adrien Picot, Petra Arnold, Stefanie Lang, Sandra Troschinski, Andreas Dieterich, Torsten Hauffe, Yvan Capowiez, Christophe Mazzia, Thomas Knigge, Tiphaine Monsinjon, Stefanie Krais, Thomas Wilke, Rita Triebskorn, Heinz-R. Köhler Phenotypic diversity, population structure and stress protein-based capacitoring in populations of Xeropicta derbentina, a heat-tolerant land snail species, Cell Stress and Chaperones 19, no.66 (Mar 2014): 791–800.https://doi.org/10.1007/s12192-014-0503-xHeinz-R. Köhler, Carolin Schultz, Alexandra E. Scheil, Rita Triebskorn, Merav Seifan, Maddalena A. Di Lellis Historic data analysis reveals ambient temperature as a source of phenotypic variation in populations of the land snail Theba pisana, Biological Journal of the Linnean Society 109, no.11 (Mar 2013): 241–256.https://doi.org/10.1111/bij.12035Gregory D. Bennett Hyperthermia: malformations to chaperones, Birth Defects Research Part B: Developmental and Reproductive Toxicology 89, no.44 (Aug 2010): 279–288.https://doi.org/10.1002/bdrb.20254Thomas G. Wilson Expression of phenotypes in a temperature-sensitive allele of the apterous mutation in Drosophila melanogaster, Developmental Biology 85, no.22 (Jul 1981): 425–433.https://doi.org/10.1016/0012-1606(81)90274-8Dale E. Lindsley, Clifton A. Poodry A reversible temperature-induced developmental arrest in Drosophila, Developmental Biology 56, no.11 (Mar 1977): 213–218.https://doi.org/10.1016/0012-1606(77)90165-8V. B. Wigglesworth Growth, (Jan 1972): 61–145.https://doi.org/10.1007/978-94-009-5973-6_3M.F. Shawer, R.E. Moreng Hypothermal Stress Resistance in the Domestic Fowl, Poultry Science 50, no.33 (May 1971): 890–894.https://doi.org/10.3382/ps.0500890I. Grebenščikov Über einen Fall von ontogenetischem Farbwechsel der Bastardfrüchte beim Kürbis und über die Anwendung des Begriffes „Dominanzwechsel“, Die Kulturpflanze 4, no.11 (Dec 1956): 247–276.https://doi.org/10.1007/BF02095419H. Precht, J. Christophersen, H. Hensel Der Einfluß der Temperatur auf Lebensprozesse, (Jan 1955): 16–177.https://doi.org/10.1007/978-3-642-88377-4_2James H. Sang, J. M. Mcdonald Production of phenocopies indrosophila using salts, particularly sodium metaborae, Journal of Genetics 52, no.22 (May 1954): 392–412.https://doi.org/10.1007/BF02981533Richard B. Goldschmidt Additional data on phenocopies and genic action, Journal of Experimental Zoology 100, no.22 (Nov 1945): 193–201.https://doi.org/10.1002/jez.1401000203"}