{"doi": "https://doi.org/10.1111/j.1558-5646.1995.tb04446.x", "year": 1995, "abstract": "The native land-snail fauna of the Hawaiian islands was investigated from a combined perspective of ecological and historical, vicariant, and dispersalist biogeography. There were more than 750 described, valid species; almost all were endemic to the archipelago, many to single islands. Path analysis showed that island area, per se, had the strongest influence on numbers of species. Island altitude and number of plant communities, both strongly related to area and both dimensions of habitat diversity, also had major influences. The influence of island age was complex. A direct effect, older islands having more species, was more than counterbalanced by the strong indirect effects of age on area and altitude: older islands are smaller and lower, and smaller, lower islands had fewer species. Distance of an island from a source of colonization was of minor importance. Species richness thus appears to be related almost exclusively to evolutionary radiation in situ and not to an equilibrium between immigration and extinction. Islands need not be extremely isolated for evolutionary radiation to be more important than immigration/extinction dynamics in determining species richness, but isolation is a relative term dependent on the dispersal abilities of the organisms in question. Numbers of recorded species were also strongly correlated with collecting effort on each island, a result that stands as a warning to others involved in such studies. Numbers of species in different families were not evenly distributed across islands. Notably, Kauai had more amastrids and helicinids and fewer achatinellids than predicted; Oahu had more amastrids but fewer pupillids and succineids than predicted; Hawaii exhibited the opposite pattern from Oahu. These patterns may partly reflect the vagaries of collecting/describing effort, but some may be due to the combined effects of historical factors and competitive exclusion. The distribution of shell height/diameter was bimodal with a distinct absence of more or less equidimensional species, a general pattern seen in other faunas. Among the pulmonates, tall species predominated, suggesting a relative lack of opportunity for globular/flat species. Notably, amastrids occurred in both modes, evidence that, at least in part, ecological not taxonomic factors underlie the bimodality. The proportions of tall and globular/flat species did not vary among islands. Prosobranchs were mostly low-spired but generally less flat than the pulmonates in the low-spired mode. The islands were probably colonized originally by small taxa. Large, tall shells are found only on Kauai and Niihau, the oldest of the main islands, suggesting that opportunities for such species are probably available on other islands."}