{"doi": "https://doi.org/10.1086/physzool.64.2.30158192", "year": 1991, "abstract": "The properties of 6-phosphofructo-1-kinase (PFK) were analyzed in foot muscle, mantle, and hepatopancreas of the land snail, Otala lactea (Pulmonata, Helicidae). The enzyme in all tissues showed properties common to PFK from other invertebrate sources including sigmoidal fructose 6-phosphate (F6P) kinetics at pH 7, activation by AMP, fructose-2, 6-bisphosphate, NH₄⁺, and inorganic phosphate, and weak inhibition by Mg ATP and citrate. Novel to O. lactea PFK, however, was an activation of the enzyme by low levels of phosphoenolpyruvate (Ka = 30–75 μM). The properties of PFK were compared in tissues isolated from three experimental groups of snails: aroused for 2 d (control), estivating for 22 d, or anoxic (N₂ gas atmosphere) for 45 h. The PFK in both hypometabolic states showed stable modifications of enzyme properties. In mantle and hepatopancreas the pattern of changes to PFK properties were similar in both estivation and anoxia, and in both cases effects on F6P affinity and inhibitor and activator constants were consistent with the conversion of PFK to a less active enzyme form in the hypometabolic state. In foot muscle anoxia and estivation were similar in their effects on F6P affinity but had different effects on other enzyme parameters. The molecular basis of the changes in enzyme properties with the transition from the aroused to dormant or anoxic states appears to be protein phosphorylation. In vitro incubations of hepatopancreas extracts from control snails with agents promoting the action of cAMP-dependent protein kinase, cGMP-dependent protein kinase, or protein kinase C all mimicked the changes in Ka fructose-2,6-bisphosphate and inhibition by citrate seen with the natural transition from the aroused to estivating state. These agents were without effect, however, on PFK from estivating snails. It appears, then, that a key component of glycolytic rate control in O. lactea is a change in the activity state of PFK via phosphorylation of the enzyme and that this mechanism serves metabolic rate depression in either estivation or anoxia."}