{"doi": "https://doi.org/10.17816/ecogen12223-34", "year": 2014, "abstract": "Background. One may hypothesize that the land snail B. cylindrica distributed in small, isolated, ephemeral populations tends to decrease genetic polymorphism level (e. g., observed heterozygosity for allozyme loci). Thus, the present study aims at estimating the levels of allozyme polymorphism in the land snail B. cylindrica from continuously distributed populations and ephemeral ones. Materials and methods. In the Nikolaev urbanised areas 9 samples were taken and studied electrophoretically for four polymorphic allozyme system. In the Dubki, Neftebasa and Park Pobedy populations (continuously distributed populations - group N 1) the two localities, situated about 50 m apart, were sampled. While only single locality were investigated from the Kosmos, Morechodnaya and Mira populations (ephemeral populations - group N 2). Statistical analysis of electrophoretic data was performed with the program GenAIEx version 6.0. Results. In general, significant differences with respect to the level of genetic polymorphism between the continuous and ephemeral populations of the land snail B. cylindrical have not discovered on the basis of allozymes loci. However, when analyzing the distribution of multilocus allozyme genotypes in the populations studied, we have received fundamentally different results. In general, ephemeral populations differed from the continuous ones with respect to the frequency of studied multilocus allozyme genotypes although one populations has been disrupted this rule (Dubki-2). Conclusion. Based on these results it is concluded that small, isolated (including, urban) populations tend to reduce the level of genetic diversity, due to the manifestation of genetic and stochastic processes (genetic drift or founder effect). In addition, an important consequence of the latter there is a relatively high rate of unpredictable change genotypic profiles of such settlements, which leads to a significant increase in the level of genetic differentiation between them."}