{"doi": "https://doi.org/10.1111/jbi.12757", "year": 2016, "abstract": "Abstract Aim Morphological and taxonomic diversity are intuitive measures of biological diversity. Previous studies have shown discordance between these measures at large spatial and temporal scales, but the implications of this pattern for the underlying processes are not understood. Using oceanic archipelagos as spatial units, we examine potential links between the morphological and taxonomic diversity of their land snail faunas in a biogeographical framework. Location Eleven major oceanic archipelagos. Methods For each archipelago, we assembled lists of indigenous land snail species, classified by family and genus, with shell height and width for each species (1723 species in total). We used biogeographic and climatic variables as potential predictors of diversity patterns. We employed regression analyses to evaluate (1) whether morphological diversity scales with taxonomic diversity at the species, genus or family level, and (2) whether morphological and taxonomic diversity correlate similarly with biogeographic/climatic factors. We also assessed which taxonomic level contributes most to morphological variation within archipelagos. Results Morphological diversity across archipelagos was strongly related to genus but not species richness. Within archipelagos, morphological variation reflected differences among genera and families but not species. Species richness was best explained by archipelago area, but morphological diversity was not significantly related to any of the physical features of archipelagos. Main conclusions Across archipelagos, species richness and morphological diversity of land snail faunas are decoupled. The relationship between species richness and the available ecological space (captured mainly by area) indicates the prevalence of niche‐based processes while, for morphological diversity, the strong conservatism of morphology at the genus level suggests the presence of diversification‐based limits. Assuming genera effectively reflect diversification, our findings indicate that morphological space on oceanic archipelagos depends primarily on the number of evolutionary units that have colonized and/or diversified through time."}