{"doi": "https://doi.org/10.1002/ecy.1473", "year": 2016, "abstract": "The entry of secondary invaders into, or their expansion within, native communities is contingent on the changes wrought by other (primary) invaders. When primary invaders have altered more than one property of the recipient community, standard descriptive and modeling approaches only provide a best guess of the mechanism permitting the secondary invasion. In rainforest on Christmas Island, we conducted a manipulative field experiment to determine the mechanism of invasion success for a community of land snails dominated by non-native species. The invasion of rainforest by the yellow crazy ant (Anoplolepis gracilipes) has facilitated these land snails, either by creating enemy-free space and/or increased habitat and resources (in the form of leaf litter) through the removal of the native omnivorous-detritivorous red land crab (Gecarcoidea natalis). We manipulated predator densities (high and low) and leaf litter (high and low) in replicated blocks of four treatment combinations at two sites. Over the course of one wet season (five months), we found that plots with high leaf litter biomass contained significantly more snails than those with low biomass, regardless of whether those plots had high or low predation pressure, at both the site where land crabs have always been abundant, and at the site where they have been absent for many years prior to the experiment. Each site was dominated by small snail species (<2 mm length), and through handling size and predation experiments we demonstrated that red crabs tend not to handle and eat snails of that size. These results suggest that secondary invasion by this community of non-native land snails is facilitated most strongly by habitat and resource augmentation, an indirect consequence of red land crab removal, and that the creation of enemy-free space is not important. By using a full-factorial experimental approach, we have confidently determined-rather than inferred-the mechanism by which primary invaders indirectly facilitate a community of secondary invaders."}