{"doi": "https://doi.org/10.1080/11250003.2016.1186234", "year": 2016, "abstract": "Jaminia quadridens (Mollusca: Gastropoda: Heterobranchia: Pulmonata: Stylommatophora: Enidae) is a land snail living up to 2400 m above sea level on calcareous meadow slopes. It is widely distributed in Central and Southern Europe, with two subspecies currently recognised (J. quadridens quadridens and J. quadridens elongata). Like other Enidae, the genus Jaminia is sinistrally coiled, whilst the vast majority of gastropods are dextral. Chirality in snails is determined in the early embryonic stages by a single gene with maternal effect. Following the discovery of reversed (dextral) populations in Abruzzi, we investigated the genetic variability of Jaminia quadridens in central and southern Italy. In fact, reversal of chirality is often associated with extremely rapid speciation in snails (“single gene speciation”), as gene flow between opposite chiral morphs can be severely reduced by pre-copula isolation mechanisms. Phylogenetic analyses with different inference methods, haplotype analyses and species delimitation analyses were carried out on cytochtome oxydase subunit I (COI) sequences of 126 Jaminia specimens from central and southern Italy, Sardinia and Provence. Our results suggested a complex framework, with at least five lineages that may represent distinct species, in agreement with biogeographic patterns previously reported for other terrestrial taxa. Southern populations of an ancestral stock probably underwent allopatric speciation while surviving in glacial refugia during the Pleistocene. Colonization of central Italy may be recent, with evidences of current gene flow between populations of a single species, which includes reversed individuals. The appearance of chiral reversal was statistically associated with marginal demes but apparently not related to other biological, ecological or historical factors. As land snails are generally severely affected by habitat degradation, due to their ecological requirements, our results have important implications for conservation. J. quadridens in Italy may comprise a complex of distinct species, mostly with restricted ranges, which may suffer from environmental changes more than a single, widely distributed species would."}