{"doi": "https://doi.org/10.1016/j.ecolind.2016.05.013", "year": 2016, "abstract": "We investigated the effects of different land use types and environmental parameters on the number and abundance of native and introduced land snail species in East Java. 2919 specimens were sampled and assigned to 55 species of which 8 are introduced. Whereas species richness was highest in primary forest, the highest number of introduced species was found in agroforest. The snail assemblages in different habitat types differ much clearer in composition than in total species richness. Plantations and agroforest are dominated by introduced pulmonates with regard to number of individuals, while primary forest is dominated by native prosobranchs. The habitat requirements of the introduced pulmonates differ from those of the native species. In the study area, the abundance of native as well as introduced pulmonate species increased with increasing human impact. However, the abundance of introduced pulmonate species decreased with increasing density of the canopy cover, whereas the abundance of native pulmonate species increased with increasing canopy cover. The abundance of native prosobranch land snails also tends to increase with increasing canopy cover and with the availability of deadwood, but decreased with increasing human impact. Improving the canopy cover and retaining deadwood in plantations and agroforests might help to control the populations of introduced species or even prevent their establishment in these habitats. Land snails are good indicators for the long-term stability of natural habitats, because several species are restricted to undisturbed natural habitats and because of their low dispersal abilities. However, complete inventories of land snail species are costly. Therefore we propose two indices that can be scored with much less effort, namely the percentage of prosobranch individuals and the percentage of individuals of introduced species. Both indices are significantly correlated with the number of native species. Dense plantations and agroforests bordering primary forests may protect the latter from introduced species and help to conserve the native fauna by reducing desiccation and buffering the human impact on the primary forests."}