{"doi": "https://doi.org/10.1002/eap.1378", "year": 2016, "abstract": "Abstract Residential yards comprise the majority of green space in urban landscapes, yet are an understudied system because of access issues and because yards may be considered biologically depauperate. Yards are purposely created and managed and, hence, qualify as designer ecosystems, a term borrowed from restoration ecology. We investigated whether yard management (watering regime, mulching, and chemical use) or dog presence affected land snail assemblage composition and described the pattern of native vs. nonnative species among yards. Land snails form an appropriate model system for yard‐scale studies because snails are speciose, common, and have limited mobility. We found 32 land snail species in our survey of 61 yards in Norman, Oklahoma, USA (population size of 118,000). Snail richness in individual yards averaged nine species, with a range of three to 14 species. Native snails were found in all yards and nonnative snails were found in all but one yard. Although some of the nine nonnative species were rare, the most frequently encountered species was the nonnative Triodopsis hopetonensis . All encountered nonnative species also occur in Oklahoma plant nurseries, indicating possible introduction through the plant trade. Yard‐scale watering regime and the presence of dogs were associated with differences in snail species composition but not species richness. Pesticide use and mulch type had little, if any, association with snail composition. Effects may have been diluted by treating yards as units, whereas snails were concentrated in specific microhabitats, such as under shrubs. Soil type also influenced snail assemblages and acted at a scale larger than individual yards. Considering yards as designer ecosystems facilitates investigation of how local variation in management affects biota within yards and across the residential landscape, and highlights the importance of variation among residential yards in understanding patterns of urban biodiversity."}