{"doi": "https://doi.org/10.1152/ajplegacy.1973.224.4.781", "year": 1973, "abstract": "ARTICLESUrea metabolism in an estivating terrestrial snail Bulimulus dealbatusFR HorneFR HornePublished Online:01 Apr 1973https://doi.org/10.1152/ajplegacy.1973.224.4.781MoreSectionsPDF (2 MB)Download PDF ToolsExport citationAdd to favoritesGet permissionsTrack citations ShareShare onFacebookTwitterLinkedInWeChat Previous Back to Top Next Download PDF FiguresReferencesRelatedInformation Cited ByNitrogen Metabolism and Excretion During Aestivation25 September 2009Inversion of allosteric effect of arginine on N-acetylglutamate synthase, a molecular marker for evolution of tetrapods18 September 2008 | BMC Biochemistry, Vol. 9, No. 1Increases in urea synthesis and the ornithine-urea cycle capacity in the giant African snail,Achatina fulica, during fasting or aestivation, or after the injection with ammonium chloride1 January 2005 | Journal of Experimental Zoology Part A: Comparative Experimental Biology, Vol. 303A, No. 12Influência do jejum severo sobre o conteúdo de proteínas totais e de amônio na hemolinfa de Bradybaena similaris (Fèrussac) (Mollusca, Gastropoda, Xanthonychidae)Revista Brasileira de Zoologia, Vol. 17, No. 4Intraspecific variation in resistance to desiccation and climatic gradients in the distribution of the bush‐dwelling land snail Trochoidea simulata23 March 2009 | Journal of Zoology, Vol. 229, No. 2Intraspecific variation in resistance to desiccation and climatic gradients in the distribution of the land snail Xeropicta vestalis8 July 2009 | Journal of Zoology, Vol. 226, No. 4Metabolic Dormancy in Aquatic InvertebratesNitrogenous excretion in a pulmonate gastropod: Elona quimperiana (de ferussac) from western BrittanyComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 80, No. 1Amino Acid Metabolism in Molluscs11This paper was written during the tenure of a National Science Foundation Grant-in-Aid (PCM-80–22606) and represents contribution number 156 from the Tallahassee, Sopchoppy, and Gulf Coast Marine Biological Association.Physiological Ecology of Land Snails and SlugsCarbon Isotope Analysis of Land Snail Shells: Implications for Carbon Sources and Radiocarbon Dating18 July 2016 | Radiocarbon, Vol. 25, No. 3Hemolymph osmoregulation and urea retention in the woodland snail, Anguispira alternata (say) (endodontidae)Comparative Biochemistry and Physiology Part A: Physiology, Vol. 69, No. 3The ammonia and urea excretion of Biomphalaria glabrata under different physiological conditions: Starvation, infection with Schistosoma mansoni, dry keepingComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 59, No. 1Ureotelism in the slug,Limax flavus linnéJournal of Experimental Zoology, Vol. 199, No. 2Aspects of fasting metabolism in the desert tortoise Gopherus berlandieriComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 58, No. 1Studies on the urea cycle of Biomphalaria glabrata during normal feeding activity, in starvation and with infection of schistosoma mansoniComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 58, No. 4Regulation of urea biosynthesis in the slug, limax flavus linnéComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 56, No. 1Pyrimidine biosynthesis and its regulation in embryos of the sea urchin, Arbacia punctulataComparative Biochemistry and Physiology Part B: Comparative Biochemistry, Vol. 55, No. 4 More from this issue > Volume 224Issue 4April 1973Pages 781-787 Copyright & PermissionsCopyright © 1973 by American Physiological Societyhttps://doi.org/10.1152/ajplegacy.1973.224.4.781PubMed4698795History Published online 1 April 1973 Published in print 1 April 1973 Metrics"}