{"doi": "https://doi.org/10.5897/ajb2015.15154", "year": 2016, "abstract": "Limicolaria aurora belongs to the group of land snails commonly called garden snails. This study seeks to use shell morphology and random amplified polymorphic DNA-polymerase chain reaction (RAPD-PCR) to examine gross morphological differences in populations of L. aurora from New Bussa (guinea savannah) and Benin City (tropical rain forest) in Nigeria and possibly delimit the populations into sub species. A total of one hundred and ten specimens of L. aurora made up of fifty five individuals from each of the two ecological zones were collected randomly for the study. Data on shell parameters including: height of shell (SH), width of shell (SW), aperture height (AH), aperture width (AW), spire length (SL), and first whorl length (1WL) measured on each snail were subjected to one way analysis of variance (ANOVA). Principal component analysis (PCA) and canonical variates analysis (CVA) were performed on the data using PAST statistical software. DNA which was extracted from the muscular tissues of the foot of eight individuals from each location using cetyltrimethylammonium bromide (CTAB) method was subjected to RAPD-PCR. Amplification of the DNA was done using five primers (OPB-12, OPB-18, OPH-08, OPD-11 and OPS-13). Analyses showed significant differences (P&lt;0.05) in L. aurora populations within and between the vegetation zones revealing great heterogeneity in the populations. Both PCA and CVA clusters did not separate the populations into distinct sub-populations. SH was the most variable morphological characteristic and consequently the most suitable for the separation of L. aurora specimens into distinct populations. All the primers used in the amplification of the DNA produced polymorphic bands. The Unweighted Pair Group Method with Arithmetic Mean (UPGMA) cluster diagram revealed two major clades within the snail populations with about 74% similarity. The study showed that RAPD-PCR analysis is more suitable for delimiting populations of L. aurora than morphometrics and that the basis for gross morphological differences in these populations might not only be environmental but also genetic factors. Key words: Achatinidae, biodiversity, environmental factors, morphometrics, phylogenetics, shell, sub-populations, variation."}