{"doi": "https://doi.org/10.1007/s12192-015-0652-6", "year": 2015, "abstract": "Land snails are exposed to conditions of high ambient temperature and low humidity, and their survival depends on a suite of morphological, behavioral, physiological, and molecular adaptations to the specific microhabitat. We tested in six populations of the land snail Theba pisana whether adaptations to different habitats affect their ability to cope with thermal stress and their strategies of heat shock protein (HSP) expression. Levels of Hsp70 and Hsp90 in the foot tissue were measured in field-collected snails and after acclimation to laboratory conditions. Snails were also exposed to various temperatures (32 up to 54 °C) for 2 h and HSP messenger RNA (mRNA) levels were measured in the foot tissue and survival was determined. To test whether the physiological and molecular data are related to genetic parameters, we analyzed T. pisana populations using partial sequences of nuclear and mitochondrial DNA ribosomal RNA genes. We show that populations collected from warmer habitats were more thermotolerant and had higher constitutive levels of Hsp70 isoforms in the foot tissue. Quantitative real-time polymerase chain reaction (PCR) analysis indicated that hsp70 and hsp90 mRNA levels increased significantly in response to thermal stress, although the increase in hsp70 mRNA was larger compared to hsp90 and its induction continued up to higher temperatures. Generally, warm-adapted populations had higher temperatures of maximal induction of hsp70 mRNA synthesis and higher upper thermal limits to HSP mRNA synthesis. Our study suggests that Hsp70 in the foot tissue of T. pisana snails may have important roles in determining stress resistance, while Hsp90 is more likely implicated in signal transduction processes that are activated by stress. In the phylogenetic analysis, T. pisana haplotypes were principally divided into two major clades largely corresponding to the physiological ability to withstand stress, thus pointing to genetically fixed tolerance."}