{"doi": "https://doi.org/10.13031/2013.15198", "year": 2013, "abstract": "Snail infestation of grain crops is widespread in parts of South Australia and can result in verysignificant problems at harvest. Four species are encountered, commonly known as common whiteand white italian (round) snails and pointed and small pointed (conical) snails. Near harvest time,snails escape the summer heat by climbing onto plant stalks and exposing themselves to coolingbreezes. A research program in South Australia evaluated a range of options available to farmersat harvest with the aim to minimise or control snail contamination in harvested grain.<br><br>This Part I reports on the approach of mechanically dislodging snails immediately ahead of thecombine header, thus reducing snail intake into the harvester. Various concepts of dislodger bardesign producing very gradual to very aggressive snail dislodging actions were identified to suit arange of crop susceptibility to mechanical damage. The concepts included a rigid pusher bar,freely dangling agricultural belts or light chains, combing brushes, and a wiping curtain approach.<br><br>Field experiments were conducted using a dual-operator held frame supporting 3m wide versionsof the above concepts. The effects of forward speed, height setting into the crop, spacing andweight factors were evaluated. The results are presented in terms of their snail dislodging abilityand the associated crop losses.<br><br>Significant snail dislodging rates (up to 80-85%) were measured in barley, wheat and faba beancrops with the most effective systems . Higher snail dislodging rates mostly correlated with highercrop losses, while the combing brushes suggested an ability to minimise crop damage at equalperformance. The level of crop losses measured could be quite significant (eg. up to 5-7% of cropyield), depending strongly on crop maturity level.<br><br>Snail dislodging forces were also monitored in a crop context and were shown to increase 7-10fold in the weeks preceding harvest, which suggests that earlier harvesting strategies couldcombine minimum crop losses with high snail dislodging rates.<br><br>Overall, the results demonstrate great potential benefits of dislodger bars in minimising orcontrolling machinery clogging problems when harvesting snail infested crops. However, thesignificant crop losses likely to occur should be seen as incentives to invest into more effectiveearlier snail control strategies, prior to harvest."}