{"doi": "https://doi.org/10.1645/16-65", "year": 2016, "abstract": "The edible land snail Cornu aspersum (Pulmonata: Stylommatophora) acts as second intermediate host in the cycle of Brachylaima sp. trematode, harboring free metacercariae in its kidney. The ingestion of undercooked infected snails by humans allows metacercariae to develop to adult stage in the intestine, causing brachylaimiasis. Praziquantel (PZQ) is the drug of choice to treat trematodiasis and it is effective against Brachylaima sp. metacercariae. The objective of this work was to assess, by transmission electron microscopy (TEM), the ultrastructural changes produced on the tegument and gastrodermis of the Brachylaima metacercariae recovered from C. aspersum treated with PZQ in comparison with untreated ones. Snails naturally infected by Brachylaima sp. metacercariae were treated by PZQ both individually and in groups. Metacercariae recovered from treated and control snails were processed for TEM. The tegument of untreated metacercariae was covered by a regular and thick glycocalyx. The syncytial epithelium contained abundant T2 secretory bodies appearing as membrane-bound biconcave disk-vesicles with high electron-dense and uniform content. The T2 secretory bodies located along the external area of the syncytium were mainly arranged at right angles to the apical plasma membrane. In treated metacercariae, the content of the T2 secretory bodies appeared altered, degenerating from high to low electron density, losing its uniform appearance and forming high electron-dense accumulations scattered around the periphery of the vesicle and separated by low electron-dense spaces. The presence of clusters was detectable in the central area. The characteristic arrangement of the T2 secretory bodies observed in untreated metacercariae was lost in treated ones. Vesicles near the apical area of the tegument no longer maintained their arrangement perpendicular to the apical plasma membrane. The characteristic arrangement of T2 secretory bodies and mitochondria was lost. The T2 secretory bodies were also found altered in the tegumental cell bodies, suggesting that the alterations started at the production stage. Mitochondria were severely degenerated and located in the apical area of the tegument. The digestive system displayed a strong contraction, which included the disappearance of the intracecal lumen."}