{"doi": "https://doi.org/10.17816/ecogen14219-27", "year": 2016, "abstract": "Background. One of the most mysterious phenomenon related to biological invasions is the so-called “genetic paradox”. It is supposed that invasive species population starts from a small number of individuals and thus should possess low genetic variation, and then what mechanisms provide it successive distribution instead of lower survivorship in front of native species is not clear. It has been shown that there are several scenarios of invasion that may help to overcome this paradox. Here, we investigate genetic variation within and between the invasive populations of land snail in Leningrad region aimed to test the various probable invasion scenarios. Materials and methods. Samples were collected in Leningrad region in May-October 2014 at both shores of the Gulf of Finland with maximal distance between the sites in 80 km and stored in 96% ethanol. As a molecular marker to study genetic variation a sequence of DNA fragment of mitochondrial cytochrome oxidase 1 was used. Results. We revealed abnormally low haplotype and nucleotide diversity in the snail populations under study. Therewith four haplotypes uncovered among 47 specimens from the territory of approximately 100 km2 were unique for Leningrad area. Phylogenetic analysis showed one sample from Denmark in the same cluster with samples from Leningrad region. This indirectly point on colonization route from Central Europe through Denmark, but this assumption should be confirmed by enlarge sampling. Conclusions. The data obtained suggest the ‘bridgehead’ model of the land snail invasion in Leningrad region. In favor of this evidence that all haplotypes recovered in Leningrad area were unique, differing from the closest haplotype from Denmark by several mutations. This fact together with extremely low haplotype and nucleotide diversity most likely points that snails first accumulated at a small territory during a rather long period. Neutrality test are in accordance with balancing selection."}