{"doi": "https://doi.org/10.1016/j.ecolind.2016.07.003", "year": 2017, "abstract": "Exposed limestone cliffs in the Swiss Jura Mountains harbour a diverse gastropod community with some rare species. Sport climbing has recently increased in popularity on these cliffs. We examined the effects of sport climbing and microtopographical features of rock faces on terrestrial gastropods by assessing species diversity and abundance on climbing routes and in unclimbed areas of seven isolated cliffs in the Northern Swiss Jura Mountains. We considered exclusively living individuals resting attached to rock faces. In total, 19 gastropod species were recorded. Six of them were specialized rock-dwelling species, whose individuals spend their entire life on rock faces, feeding on algae and lichens. Plots along climbing routes harboured fewer species of rock-dwelling snails as well as other gastropod species (usually living in the leaf litter layer at the cliffs’ base) than plots in unclimbed control areas. Similarly, both the density of individuals and frequency of occurrence in plots were reduced in both groups of snails on climbing routes. The complexity of the rock surface had little influence on the species richness and abundance of gastropods. Pyramidula pusilla, the species with the smallest shell and a preference to rest underneath overhangs, was less affected by sport climbing than snail species with larger shells and a preference to rest on exposed smooth rock surface. Our findings indicate land snail diversity and abundance are suitable indicators for impact assessment in rocky habitats. Future management plans and actions should therefore not only rely on plants; they ought to consider also gastropods and other invertebrates. Any management plan should include a comprehensive information campaign to show the potential impact of intensive sport climbing on the specialized flora and fauna with the aim of educating the climbers and increasing their compliance with such measures."}