{"doi": "https://doi.org/10.3389/conf.fenvs.2016.01.00009", "year": 2016, "abstract": "Event Abstract Back to Event Checking Snails – pupils as snail watchers Katharina Jaksch1*, Gabriele Baumgartner2, Elisabeth Haring1 and Helmut Sattmann3* 1 Natural History Museum Vienna, Central Research Laboratories, Austria 2 GRg 13, Austria 3 Natural History Museum Vienna, 3. Zoological Department, Austria Introduction The Craven Door Snail (Clausilia dubia) is a rock-dwelling clausiliid and known for its variable external appearance. Accordingly, different morphological forms and subspecies have been described, but the biological background of those supposed taxa is uncertain (Nordsieck 2002; Jaksch 2014). So far only few data are available on the biology of this species (e.g. Nordsieck 2005; Maltz & Sulikowska-Drozd 2008) and only few data exist on close relatives (e.g. Maltz & Sulikowska-Drozd 2012; Sulikowska-Drozd & Maltz 2012; Szybiak et al. 2015). Therefore, all information on the life cycle of Clausilia dubia is of high scientific interest. Furthermore, taxonomically relevant differences in size, shell shape and ribbing might be genetically and / or environmentally linked. We hypothesise that if there is some environmental influence on shell traits, this might become apparent under altered conditions. To test this, we planned as a first experiment to rear and breed different morphological forms under the same laboratory conditions. Since for this experiment plenty of snails have to be observed, pupils were involved as Citizen Scientists. This project was started in 2014 in cooperation with secondary school students of the GRg 13 Wenzgasse, Vienna, and the Natural History Museum of Vienna (NHMW). Besides conducting all the necessary work the students also raised their own questions, made careful observations and recorded important information. This included shell characters, but also observations of reproduction biology like clutch size, hatching time, duration of development and life span. After two years of rearing and breeding, first fundamental results on reproductive biology can be reported. Methods Subadult snails (estimated age: 4 months), were collected from different populations in the Schneeberg region (Lower Austria). Students of the 6th and 7th grade (12-13 years old) received ~200 door snails kept in small terrariums. The students were instructed regarding the conditions under which the animals should be kept by the scientists of the NHMW and by their biology teacher, who supervised the onsite procedures in the school. Regularly, several times per week, the boxes were cleaned, snails were fed (with lettuce and carrots), and any conspicuities were documented. Each time, all boxes were inspected for eggs and/or clutches. Eggs per clutch were counted, protocolled and transferred into separate breeding boxes. The time until hatching, the hatching itself and finally the growing of the hatchlings were monitored, described and documented by reports and images. Results Altogether 420 eggs were yielded from the generation caught in the wild. Of the F1 generation, 228 snails were successfully reared to adult stage. At first glance the offspring did not differ from parental snails in size, shell shape and ribbing, but detailed measurements will be necessary to statistically test any differences. Beside the establishment of feasible settings for successful breeding of C. dubia, new data about the species´ biology were gathered by the students: The eggs are partly calcified with visible calcium carbonate crystals on the surface. Size of egg clutches ranged from 2 to 8 eggs (average 3.8). Eggs were laid during the whole period of observance (September to September) and it takes 11 to 19 days until hatching. In all these parameters (size of clutches, seasonality, duration until hatching) slight differences between populations/morphotypes were observed. Yet, due to the still small sample size, statistical significance has not been tested. Time from hatching until reaching adult stage (as determined by a certain size and form of the aperture) was 252 days on average. The parental generation of the studied snails reached an age up to 3 years. Discussion This was a first attempt to obtain data on door snail taxonomy and biology with substantial involvement of pupils and this pilot study can be regarded as very successful. First results about basic biological data of C. dubia have been gathered by the students. It has to be underlined that information on the biology of this species was scarce. Maltz & Sulikowska-Drozd (2008) described the knowledge on life cycles of C. dubia as “unknown” in the field and “fragmentary” from laboratory observations. They reported that the species was oviparous and determined egg sizes. According to our results clutch sizes are relatively small compared to other clausiliid species. Incubation time until hatching is within the range of other clausiliids, but longer than in C. pumila. Development seems to be relatively slow compared to other species (Maltz & Sulikowska-Drozd 2008). Welter–Schultes (2012) mentioned that epiphytic lichens and algae are the main food of C. dubia. This kind of nutrition was not available in our experiment, but it is noteworthy that we could successfully rear the animals with lettuce and carrots, which indicates that the food spectrum might be wider in nature. This pilot study provided us with some key data on reproduction, although it has to be considered that the laboratory conditions surely deviate to a certain degree from natural ones. At first appearance the results did not show any environmental influence on shell characters, but this question has to be evaluated in upcoming experiments analysing more snails and using also individuals of the F2 generation. Also observations on egg and clutch sizes as well as hatching behaviour will be statistically analysed when more data is available. In addition, food preferences will be tested in further experiments. Conclusion The success of this study was due to the strong commitment of the pupils. This was demonstrated in a joint public presentation of the young scientists together with the researchers of the NHMW and documented in a survey article of the supervisors of the project (Jaksch & Baumgartner 2015). A great benefit was the particular experience of the biology teacher in breeding of snails. Recently we have adapted the methodological approach according to our experience gained in this pilot study. We plan to extend the experiments including more students and snails. In addition to the ongoing breeding experiment, snail pairs will be handed out to students who will monitor them at home. In general all observations will be documented in more detail. Figure 1 Figure 2 Acknowledgements We are grateful to all pupils involved in this project for their commitment and to the director of the GRg 13, Andreas Paseka, for his backing. We also thank Julia Schindelar and Oliver Macek for preparing and arranging facilities for snail keeping. References Jaksch, K. (2012). Phylogeographie und Unterartklassifikation von Clausilia dubia Draparnaud, 1805 im östlichen Österreich (Gastropoda: Pulmonata: Clausiliidae). Diploma thesis, University Vienna. Jaksch, K. & Baumgartner, G. (2015). Citizen Scientists – Schülerinnen und Schüler werden zu Schneckenforschern. Das Naturhistorische in: Universum Magazin December 2015: 8-9; Vienna. Maltz, T. K. & Sulikowska-Drozd, A. (2008). Life cycles of clausiliids of Poland – knowns and unknowns. Annales Zoologici 58(4): 857-880. Maltz, T. K. & Sulikowska-Drozd, A. (2012). Life History of Alinda biplicata (Montagu, 1803) (Gastropoda: Pulmonata: Clausiliidae) based on five-year laboratory observations. Annales Zoologici 62(4):789-807. Nordsieck, H. (2002). The subspieces classification of Clausilia dubia DRAPARNAUD (Gastropoda: Stylommatophora: Clausiliidae), a critical revision. Mitt. Dtsch. Malakozool. Ges. 68: 37-44. Nordsieck, H: (2005). Mating biology of Clausiliidae. Mitt. Dtsch. Malakozool. Ges. 73/74: 29-34. Sulikowska-Drozd, A. & Maltz, T. K. (2012). Reproduction of Balea (Pseudalinda) stabilis (L. PFEIFFER, 1847) (Gastropoda: Pulmonata: Clausiliidae) kept under laboratory conditions. Folia malacologica 20(2): 73-79. Szybiak, K., Gabała, E. & Leśniewska, M. (2015). Reproduction and shell growth in two clausillids with different reproductive strategies. Biologia 70(5): 2015 Welter-Schultes, F. (2012). European non-marine molluscs: a guide for species identification. Göttingen, Planet Poster Edition. Keywords: rearing, Shell characters, Reproduction biology, citizen scientist data, Clausilia dubia Conference: Austrian Citizen Science Conference 2016, Lunz am See, Austria, 18 Feb - 19 Feb, 2016. Presentation Type: Poster Presentation Topic: Citizen Science - Quo vadis? Citation: Jaksch K, Baumgartner G, Haring E and Sattmann H (2016). Checking Snails – pupils as snail watchers. Front. Environ. Sci. Conference Abstract: Austrian Citizen Science Conference 2016. doi: 10.3389/conf.FENVS.2016.01.00009 Copyright: The abstracts in this collection have not been subject to any Frontiers peer review or checks, and are not endorsed by Frontiers. They are made available through the Frontiers publishing platform as a service to conference organizers and presenters. The copyright in the individual abstracts is owned by the author of each abstract or his/her employer unless otherwise stated. Each abstract, as well as the collection of abstracts, are published under a Creative Commons CC-BY 4.0 (attribution) licence (https://creativecommons.org/licenses/by/4.0/) and may thus be reproduced, translated, adapted and be the subject of derivative works provided the authors and Frontiers are attributed. For Frontiers’ terms and conditions please see https://www.frontiersin.org/legal/terms-and-conditions. Received: 04 May 2016; Published Online: 06 Sep 2016. * Correspondence: Ms. Katharina Jaksch, Natural History Museum Vienna, Central Research Laboratories, Vienna, 1010, Austria, katharina.jaksch@nhm-wien.ac.at Dr. Helmut Sattmann, Natural History Museum Vienna, 3. Zoological Department, Vienna, 1010, Austria, helmut.sattmann@nhm-wien.ac.at Login Required This action requires you to be registered with Frontiers and logged in. To register or login click here. Abstract Info Abstract The Authors in Frontiers Katharina Jaksch Gabriele Baumgartner Elisabeth Haring Helmut Sattmann Google Katharina Jaksch Gabriele Baumgartner Elisabeth Haring Helmut Sattmann Google Scholar Katharina Jaksch Gabriele Baumgartner Elisabeth Haring Helmut Sattmann PubMed Katharina Jaksch Gabriele Baumgartner Elisabeth Haring Helmut Sattmann Related Article in Frontiers Google Scholar PubMed Abstract Close Back to top Javascript is disabled. Please enable Javascript in your browser settings in order to see all the content on this page."}