{"doi": "https://doi.org/10.1111/jzo.12412", "year": 2016, "abstract": "Abstract Limbless animals that burrow head‐first are often considered to be evolutionarily constrained in the development of a large head, due to limitations imposed while penetrating the soil. Whilst animals with a small head experience less resistance when digging, they are believed to have a weak bite, hence restricting their potential dietary spectrum to soft prey. Yet, recent findings established molluscivory in the fossorial worm lizard Trogonophis wiegmanni (Amphisbaenia), suggesting a high bite capacity for this burrowing species necessary to crush snail shells. To tackle this burrow/crush dilemma, we examined the relationship between head morphology, bite force and gastropod diet in T. wiegmanni males and females. In vivo bite force analyses and shell hardness measurements were used to assess the potential dietary spectrum of the amphisbaenians. In addition, phylogenetic analyses were performed to put T. wiegmanni 's head size and bite force into an interspecific comparative context. Our results show a strong positive relation between head size and bite force, and we found no evidence for sexual dimorphism. In sharp contrast to other durophagous lizards, T. wiegmanni combines a relatively small body and a (disproportionally) small head with relatively high biting forces. In fact, T. wiegmanni is able to crush a wide array of the most abundant gastropod shells in their environment. However, the head size of the strongest biters imposes a limitation towards a common alternative snail‐feeding strategy: entering the opening of the gastropod shell. This study shows that head size, and consequently bite force, increases the number and variety of gastropods that can be consumed by ‘shell‐crushing’, but reduces the number and variety of snails that can be consumed by ‘shell‐entering’, and vice versa . The cranial design of (durophagous) limbless burrowers may therefore not only evolve under constraints for efficient soil penetration, but also through selection for diet."}