{"doi": "https://doi.org/10.1177/0959683616675943", "year": 2016, "abstract": "Land snails recovered from archeological deposits may be used to deduce climatic conditions during prehistoric occupation because their aragonitic skeletons are usually well-preserved and document valuable climatic information in the form of isotope codes. Since the snail Sphincterochila candidissima is common in archeological sites along the western Mediterranean but has been minimally investigated, the present work examines the relationship between the oxygen (δ 18 O) and carbon (δ 13 C) stable isotopes of modern specimens and relevant meteorological data. Individuals of Sphincterochila were regularly live-collected throughout 1 year (from September 2013 to October 2014) in Tarragona, NE Spain, and the δ 18 O and δ 13 C values were measured at the shell lip or aperture, which depicts the last growth episode closest to specimens’ collection date. Shell margin δ 18 O values varied from +3.1‰ in September to −0.8‰ in April. Average shell margin δ 18 O values per collection date positively correlated with monthly averaged rainwater δ 18 O, and negatively correlated with monthly averaged maximum relative humidity, while other variables (i.e. temperature and precipitation amount) did not explain monthly–submonthly isotopic variations in the shell lip. Shell margin δ 13 C values ranged from −11‰ in September to −4.8‰ in March, pointing to detectable variations in snails’ diet between seasons. Interestingly, snail body size positively correlated with shell margin δ 18 O and δ 13 C values, suggesting that larger snail size is reached under drier conditions. This work shows that S. candidissima from the western Mediterranean is a valid paleoprecipitation δ 18 O and/or paleohumidity proxy in the region at the monthly–submonthly scale. Although shell margin δ 18 O recorded fall and spring climate conditions only, limiting therefore their use to estimate the season of harvest, snails that grow year-round (e.g. at subtropical–tropical regions) may be used usefully for such analyses."}