{"doi": "https://doi.org/10.5451/unibas-006623203", "year": 2016, "abstract": "Sexual selection is a concept of selection and subject of numerous studies on reproduction and sexual dimorphism in secondary sexual characteristics. In simultaneous hermaphrodites both the female and male function within the same individual compete for resources. Complex behaviours and mechanisms optimize the reproductive investment in these species. These behaviours and mechanisms might also be affected by internal factors and external conditions. In former studies researchers started to disentangle different factors and conditions in order to understand the major drivers of reproduction success. In my thesis I focused on reproductive strategies of the model organism Arianta arbustorum, a hermaphroditic land snail, and the influence on reproduction and winter survival of its parasite Riccardoella limacum, a blood- sucking mite that lives in the mantle cavity of the snail.\r\nFor a better understanding of the fragile host-parasite interaction, further details about the life-history of R. limacum were explored. Hibernation is a crucial period in the annual cycle of a parasite and its host. Hibernation has a strong impact on the fitness of both species and consequently affects their life-history and reproduction. Temperature, for example, can be a limiting factor for parasite development. Low temperatures over a long period could influence the life cycle of R. limacum. Three experiments were performed to examine the influence of hibernation duration on the survival of the parasitic mite R. limacum and its eggs. The intensity of mite infection of hosts decreased with increasing hibernation duration. R. limacum survived the winter in the egg stage in the host’s lung. Winter survival of the host itself was negatively affected. It could be hypothesised that low temperature and a longer winter period at high elevation may limit the occurrence of R. limacum.\r\nThe variation in sperm morphology of the land snail Arianta arbustorum in relation to parasitic mite infection was investigated. Variation in total sperm length and sperm head length was assessed in 23 populations sampled across the distributional range of the species in Central and Northern Europe. Results showed a variation in total sperm length among populations, which increased significantly with the geographic distance between the populations. Additionally, a minimal adequate model revealed that mite-infected individuals of A. arbustorum produced longer sperm than uninfected snails and total sperm length decreased from west to east across Europe. Moreover, total sperm length in a subsample of 12 alpine populations decreased with increasing elevation. Differences among populations explained 62.9% of the variance in total sperm length, differences among individual snails within population 23.4% and differences within individual snails 13.7%. These results suggest that selection pressures acting among populations may differ from those acting within.\r\nTo examine the principles of selection pressures on sperm traits on a larger scale, a comparative approach was used considering 57 stylommatophoran snail species of Europe and South America. The hypothesis that cross-fertilizing species have longer sperm than self- fertilizing species as a consequence of sperm competition risk was tested. Sperm length, sperm head length and shell traits of these species were measured and analysed. Information on the breeding system and life-history characters including habitat preferences was gathered. Results showed that both total sperm length and sperm head length varied significantly between species and indicated that risk of sperm competition as well as shell size account for the variation across species.\r\nSperm competition is an important part of sexual selection and considered as a driving force in the evolution of sperm traits. Furthermore, sperm competition is regarded as principal determinant of male fitness in promiscuous species. The last project of this thesis deals with the question, whether the risk of sperm competition leads to a preference for mating with virgin individuals. In promiscuous species with sperm storage and multiple paternity, males are expected to prefer mating with a virgin partner to assure an exclusive paternity. In a series of mate-choice tests I examined whether virgin and nonvirgin individuals of A. arbustorum discriminate between virgin and nonvirgin mates. I also measured the sperm number of the ejaculates delivered to virgin or nonvirgin partners to see whether the snails adjust sperm delivery. In all experiments mate-choice was random and the number of sperm delivered was not adjusted to the mating status of the partner. The mating success seemed to be determined by the activity of the individual snail and its partner. Random mating does not imply a random fertilization of eggs. The presence of a sperm-digesting organ and the morphology of the sperm storage organ allow a selective storage and use of sperm in A. arbustorum.\r\nThis thesis showed that reproductive strategies and sperm traits in simultaneously hermaphrodites are influenced by species’ morphology, environmental conditions and parasitic infection."}