{"doi": "https://doi.org/10.1016/j.ympev.2016.12.020", "year": 2017, "abstract": "The land-snail genus Corilla is endemic to Sri Lanka and India’s Western Ghats. The ten extant Sri Lankan species belong to two distinct shell forms that are associated respectively with lowland and montane rainforest. We here present the first molecular phylogenetic analysis for Corilla. Our dataset includes nine nominal Sri Lankan species and is based on three mitochondrial genes (CO1, ND1 and 16S). Although the deeper nodes in the trees are not fully resolved, the results do suggest speciation in Corilla has involved repeated, ecologically-driven convergence in shell form. The mtDNA data agree with the current shell-based taxonomy for C. adamsi, C. beddomeae, C. carabinata, C. humberti and C. colletti, consistently supporting the first four as monophyletic, and supporting the last also as monophyletic in nearly all analyses. Corilla adamsi, C. beddomeae and C. colletti may each contain at least one additional, previously undescribed species. The relationship between northern and eastern C. odontophora couldn’t be reliably resolved, but our results suggest that they are distinct species and that there is further species-level or intraspecific (geographical) differentiation within eastern C. odontophora. The current, morphologically-defined species limits of the three remaining nominal species, C. gudei, C. erronea and C. fryae, are inconsistent with the mtDNA sequence data. Northern and southern C. gudei appear to be distinct species: the sister taxon of southern C. gudei is C. humberti, and most analyses showed that the sister taxon of northern C. gudei is the lowland C. carabinata. Corilla erronea and C. fryae constitute a well supported clade in which both nominal species are paraphyletic. While most intra-clade CO1 p-distances are moderate to relatively large, the phylogenetic structuring within the clade does not seem to correspond to any obvious morphological, elevational or geographical patterns. These results are difficult to interpret, and further detailed study is needed before the taxonomic status of C. erronea and C. fryae can be resolved."}