{"doi": "https://doi.org/10.2992/007.084.0103", "year": 2016, "abstract": "Population declines of species can be a concern, but before taking action, we need to verify whether apparent declines are real. Land snails are one of the most threatened groups of animals in the world, and anecdotes suggest that the abundance of the land snail Anguispira alternata has declined in Pennsylvania, U.S.A., over the past few decades. Might the apparent decline represent inadequate sampling by recent surveyors or could it represent a real decline? Past search effort is rarely documented, hindering direct comparisons of search effort. We used 547 museum records of A. alternata collected primarily from 1890 to 1960 and 2000 to 2015. Following two lines of reasoning, we conclude that the abundance of A. alternata has actually declined. (1) The smaller proportion of collecting events that found A. alternata after year 2000 suggests an actual decline of A. alternata in modern decades, regardless of the total number of collecting events. (2) The accumulation curve of new county records for all land snail species showed similar slopes in both past and modern decades, indicating comparable search effort in both time periods. The apparent decline of A. alternata was not explained by differential effort with respect to snail size or geographical area searched. The decline appears to have begun about 1960, although relatively little collecting effort from 1960 to 2000 decreases confidence in our ability to infer timing of abundance change in those decades. We speculate about three hypotheses regarding the decline (acid precipitation, climate warming, human mediated disturbance) and conclude that the historical increase in acid precipitation best matches the timing of the snail's decline. Population trends of other snail species and trends of A. alternata in other geographical areas should be studied to further explore these and other hypotheses. Our study highlights the importance of museum collections in understanding the current biodiversity crisis."}