{"doi": "https://doi.org/10.1111/jbi.12946", "year": 2017, "abstract": "Abstract Aim Despite the huge diversity of soil animals and their recognized contribution to many ecosystem functions, little is known about the relative importance of factors controlling their abundance and distribution. We examined the relative importance of environmental and spatial factors in explaining the species and functional trait composition of terrestrial snail communities at the level of meta‐communities (spatial extent c . 100 × 100 km) in a heterogeneous, intensively used landscape. We hypothesized that both spatial and environmental factors contribute to the variation in community structure across the landscape, but expected environmental variables describing local habitat conditions to be most important. Location County of Skåne, south Sweden. Methods We quantified community structure in terms of species composition and as functional trait composition, because functional traits directly link species performance to environmental conditions. To disentangle the unique and shared contribution of environmental and spatial factors to the variation in snail community structure (in terms of species and trait composition) we applied a partial redundancy analysis. Results Species traits explained more of the variance in community composition than species identity. Snail traits such as tolerance to environmental stress (related to soil moisture content) and niche width were correlated with the main environmental gradient. Environmental variables (i.e. soil moisture content, vegetation characteristics and soil pH ) contributed considerably more to variation in community composition (species: 11.4%; traits: 24.9%) than the spatial variables (species: 6.5%; traits: 4.2%). Main conclusions The results highlight that both environmental and spatial variables are required to understand the relative importance of niche‐based and intrinsic population processes as drivers of terrestrial snail community structure. However, at the scale of our study niche‐based community structuring explained by the trait–environment relationship is considerably more important than spatial patterning independent of the environment."}