{"doi": "https://doi.org/10.18195/issn.0313-122x.68.2005.053-102", "year": 2005, "abstract": "Alan Solem highlighted the high alpha diversity of land snails that occur in forests of mid-western North Island New Zealand. This paper examines patterns of diversity in land snails across the entire New Zealand archipelago, with a review of the biogeography and composition of taxon groups and with analyses of faunal composition and ecological diversity at national, island and bioregion scales based primarily on collation of museum records. Community composition and structure are also analysed using two extensive series of plot-based assessments. The fauna is primarily Gondwanan in origin, with apparently little influence from establishment of new taxa by chance dispersal since the late Paleocene. It has undergone extensive in situ cladogenesis and speciation that, combined with island biogeographic processes of dispersal and extinction, have resulted in marked intra- archipelago differences in the character of regional species pools. Species richness of communities (0 - 74 for 400 m 2 plots) was shown to vary substantially within and between bioregions, in part related to patterns of niche availability driven by temporal and spatial heterogeneity in environmental conditions and floristic diversity. It is concluded that in general the New Zealand land snail communities are not in a state of equilibrium, and that the highly dynamic nature of the environment prevents this. Only where regional conditions have favoured persistence of a diversity of forest habitat over several million years is high mean species richness evident at the plot scale. The New Zealand fauna exhibits a strong predominance of minute species with low shell height:diameter ratios. The essentially unimodal dispersion in the shell morphospace contrasts markedly with the bimodal pattern exhibited in many other faunas. If shell shapes define the repertoire of available niches then there is something different about New Zealand in respect to the niches occupied by land snails. However, the shell morphology in the New Zealand representatives of snail families conforms rather closely to that expected within the respective families worldwide, suggesting the morphospace pattern seen in the New Zealand fauna is largely a product of phylogenetic constraint, and has little to do with ecology. The high levels of cladogenesis evident in the New Zealand fauna suggest innovations in ecological niches that are not evident in examination of the shell height:diameter morphospace."}