{"doi": "https://doi.org/10.1016/j.ecolind.2016.12.033", "year": 2017, "abstract": "Site-scale species richness (alpha diversity) patterns are well described for many present-day ecosystems, but they are difficult to reconstruct from the fossil record. Very little is thus known about these patterns in Pleistocene full-glacial landscapes and their changes following Holocene climatic amelioration. However, present-day central Asian ecosystems with climatic features and biota similar to those of the full-glacial periods may serve as proxies of alpha diversity variation through both space and time during these periods. We measured alpha diversity of vascular plants, bryophytes, macrolichens and land snails, as well as environmental variables, in 100-m2 plots located in forests and open habitats in the Russian Altai Mountains and their northern foothills. This region contains adjacent areas that possess climatic and biotic features similar to mid-latitude Europe for both the Last Glacial Maximum and contemporaneous Holocene ecosystems. We related alpha diversity to environmental variables using generalized linear models and mapped it from the best-fit models. Climate was identified as the strongest predictor of alpha diversity across all taxa, with temperature being positively correlated to number of species of vascular plants and land snails and negatively correlated to that of bryophytes and macrolichens. Factors important for only some taxa included precipitation, soil pH, percentage cover of tree layer and proportion of grassland areas in the landscape around plots. These results, combined with the high degree of similarity between the current Altai biota and dry-cold Pleistocene ecosystems of Europe and northern Asia, suggest that vascular plant and land snail alpha diversity was low during cold phases of the Pleistocene with a general increase following the Holocene climatic amelioration. The opposite trend probably existed for terricolous bryophytes and macrolichens."}