{"doi": "https://doi.org/10.1016/j.ympev.2017.04.002", "year": 2017, "abstract": "The Hygromiidae is a highly diverse group of land snails with a distribution range stretching throughout the Palearctic region from the Macaronesian Islands to the Russian Far East and reaching southwards to the north-eastern Ethiopian region. So far, the classification of the family largely rested on the structure of the dart apparatus, an accessory genital organ. We used nuclear and mitochondrial DNA sequences of almost all genera to reconstruct the phylogeny of the Hygromiidae. Several of the clades found in the molecular phylogenetic analyses represent regional radiations that partly show a high variation in the structure of the dart apparatus. Thus, several of the currently accepted subdivisions of the family, which included taxa with similar dart apparatus from different regions, turned out to be polyphyletic. We newly delimit three subfamilies within the family, Hygromiinae, Leptaxinae and Trochulinae on the basis of our phylogenetic analyses. The Hygromiinae are further subdivided into Hygromiini and Perforatellini trib. nov. The Leptaxinae are classified in Leptaxini, Metafruticicolini and Cryptosaccini trib. nov. The Trochulinae are the most diverse group including Ciliellini, Archaicini, Ganulini trib. nov., Urticicolini trib. nov., Trochulini, Caucasigenini trib. nov., Ashfordini trib. nov., Halolimnohelcini and Monachaini. Moreover, two new genera, Coronarchaica gen. nov. from Central Asia and Noricella gen. nov. from the Alps, are described. The Hygromiidae originated in the western Palaearctic, from where the Central Asian mountain regions, the Macaronesian Islands, the Caucasus region and sub-Saharan East Africa were colonized. The radiation of the Hygromiidae as well as those of several other land snail families was dispersal limited. Because of the low dispersal abilities of land snails, the period until an isolated region is colonized by a group by chance dispersal is comparatively longer than the period necessary for morphological and ecological diversification of the group within the newly colonized region. Some of the regional radiations coincided with orogeny in the respective areas and were probably triggered by the development of geographical barriers and new niches."}