{"doi": "https://doi.org/10.1016/j.actao.2017.05.006", "year": 2017, "abstract": "Land-snail species richness has repeatedly been found to increase with the increasing site calcium content and humidity. These two factors, reported as the main drivers of land-snail assemblage diversity, are also among the main habitat characteristics of calcareous seepages. Here we explore local species richness and compositional variation of forest spring-fed patches (i.e. seepages), to test the hypothesis that these habitats might act as biodiversity hotspots and refugia of regional snail faunas. In contrast to treeless spring fens, only little is known about land snail faunas inhabiting forest seepages. Studying 25 isolated calcareous forest seepages, evenly distributed across the White Carpathians Protected Landscape Area (SE Czech Republic), we found that these sites, albeit spatially very limited, can harbour up to 66% of the shelled land-snail species known to occur in this well-explored protected area (in total 83 species). By comparing land snail assemblages of the studied seepages with those occurring in the woodland surroundings of each site as well as those previously sampled in 28 preserved forest sites within the study area, we found the seepages to be among the most species rich sites. Although the numbers of species did not statistically differ among these three systems, we found highly significant differences in species composition. Seepage faunas were composed of many species significantly associated with spring sites, in contrast to the assemblages of both surrounding and preserved forest sites. Our results highly support the hypothesis that calcareous forest seepages might serve as refugia and biodiversity hotspots of regional land snail faunas. Protection of these unique habitats challenges both conservation plans and forest management guidelines as they might act as sources for the recolonization and restoration of forest snail assemblages particularly in areas impoverished by harvesting and clearcutting."}