{"doi": "https://doi.org/10.1645/17-29", "year": 2017, "abstract": "The edible land snail Cornu aspersum (Pulmonata: Stylommatophora) acts as a second intermediate host in the terrestrial life cycle of Brachylaima spp. trematodes, harboring unencysted metacercariae in its kidney. The ingestion of undercooked infected snails by humans may allow metacercariae to potentially develop to adult stage in the intestine, causing brachylaimiasis, as already seen in Australia. The prevalence and dynamics of C. aspersum parasitization by Brachylaima spp. metacercariae in specimens intended for human consumption in Spanish marketplaces were studied. In total, 3,710 C. aspersum specimens were analyzed over 5 yr, which were obtained from public marketplaces in the Spanish cities of Barcelona, Bilbao, Madrid, Tudela, Valencia, and Zaragoza. The overall prevalence was 41.97% (95% CI: 40.38–45.56%). The Tudela marketplace had the highest values for both the seasonal prevalence and abundance in all studies during autumn (93.57% and 3.09, respectively). This market also gave the highest individual metacercarial burden recorded, 212 metacercariae in a single specimen. Overall, the highest prevalence of Brachylaima spp. occurred in autumn (58.65%) and the lowest in winter (22.64%). There was a seasonal effect on prevalence, which increased from summer to autumn and then decreased in winter. In total, 96 experimental Brachylaima adults were obtained from the metacercariae parasitizing the analyzed snails. These were identified through morphometric tools (principal component analysis) as Brachylaima mascomai (56 in Barcelona, 1 in Bilbao, 7 in Tudela, and 3 in Valencia), and Brachylaima llobregatensis (17 in Barcelona, 8 in Bilbao, 1 in Valencia, and 3 in Zaragoza). Logistic regression modeling, conducted to predict the probability of purchasing parasitized snails using city and season as predictors showed a correct prediction overall of 79.0%, with a significant (p = 0.001) risk effect in the Barcelona–autumn interaction (2.551–38.442), a significant (p = 0.049) protection effect in the Tudela–spring interaction (0.076–0.997), a significant (p < 0.001) risk effect in the Tudela–autumn interaction (4.330–78.584), and a significant (p = 0.014) protection effect in the Valencia–spring interaction (0.033–0.687). The high overall prevalence of Brachylaima spp. metacercariae should be a matter of concern for public health authorities, mainly in countries where C. aspersum is consumed."}