{"doi": "https://doi.org/10.1016/j.palaeo.2017.07.029", "year": 2017, "abstract": "The oxygen isotopic composition (δ18O) of land snail shells can be a valuable paleoenvironmental archive if the climatic parameters that influence the isotopic system are fully understood. Previous calibration studies have examined a limited number of species or individuals, and most have focused on larger (> 10 mm) taxa, which do not represent the dominant shell material in the Quaternary fossil record. In this study, we evaluate the δ18O values of small land snails (< 10 mm), which are common in modern settings and are often preserved in a wide array of Quaternary geologic and archeologic deposits. Our primary goal was to determine if coexisting species record equivalent isotopic information in their shells, regardless of differences in their ecology, dietary habits, behavior, and/or body size. We collected and analyzed 265 individuals of 11 species from 12 sites in northwest Minnesota (USA), which exhibits extremely abundant and diverse terrestrial malacofauna in North America. We did not observe significant correlations between shell δ18O values and the type of ecosystem (forest/grassland) or hydrologic setting (upland/lowland). However, the majority of species differed significantly in shell δ18O values. Larger taxa (Catinella, Succinea, Discus) consistently yielded higher δ18O values than smaller taxa (Euconulus, Gastrocopta, Hawaiia, Vallonia), by up to ~ 3‰. These isotopic offsets among sympatric taxa could be attributed to a number of physical, behavioral, and/or evolutionary traits, including the ability of larger species to tolerate drier conditions better than their smaller counterparts, differences in their preferred microhabitats or phylogentic non-independence. Regardless of the reason, our results imply that researchers should not combine isotopic data from different types of land snails without first investigating modern specimens to determine if it is appropriate. Moreover, our data suggest that combining instrumental climate data, a snail flux-balance model, and shell δ18O values can help us to better understand the ecology of land snails."}