{"doi": "https://doi.org/10.3897/zookeys.692.14706", "year": 2017, "abstract": "A total of 11 species and 1 subspecies of Alycaeus were recognised in Peninsular Malaysia prior to this study. However, these taxonomic descriptions of Alycaeus taxa were based on limited numbers of examined materials, where a whole spectrum of morphological variations were not accounted for and diagnoses were often provided without sufficient comparison between congeners from across the peninsula. We reviewed Peninsular Malaysian Alycaeus through the examination of 5137 specimens in 522 collection lots from all major museum collections and literature sources. Based on these examined materials, we utilised a more comprehensive revised set of 39 shell and operculum characters, as well as living animal colour to describe all Alycaeus species in this paper. We also noted their habitat and ecology, as well as updated the distribution of each species. Of the 12 previously described taxa, 10 are reconfirmed as present on Peninsular Malaysia (Alycaeus balingensis, Alycaeus carinata, Alycaeus conformis, Alycaeus gibbosulus, Alycaeus kapayanensis, Alycaeus kelantanensis, Alycaeus liratulus, Alycaeus perakensis perakensis, Alycaeus perakensis altispirus and Alycaeus thieroti) and 2 are confirmed as absent from the peninsula (Alycaeus jagori and Alycaeus pyramidalis). A new record of Alycaeus robeleni is reported for Peninsular Malaysia. One species, Chamalycaeus jousseaumei is confirmed as present on the peninsula and is reassigned to Alycaeus. The subspecies Alycaeus perakensis altispirus Möllendorff, 1902, is elevated to species. Examined Peninsular Malaysian materials that do not fit previously recognised species are described as new species. A total of 11 new species are proposed (Alycaeus selangoriensissp. n., Alycaeus costacrassasp. n., Alycaeus ikanensissp. n., Alycaeus alticolasp. n., Alycaeus charasensissp. n., Alycaeus kurauensissp. n., Alycaeus regalissp. n., Alycaeus virgogravidasp. n., Alycaeus senyumensissp. n., Alycaeus expansussp. n., Alycaeus clementsisp. n.). Overall, 23 species of Alycaeus are now recognised in Peninsular Malaysia."}