{"doi": "https://doi.org/10.3160/soca-116-02-110-136.1", "year": 2017, "abstract": "Land snails in the family Helminthoglyptidae are found sparingly and locally throughout southern California's deserts. They are mostly restricted to rock outcrops and talus in partially shaded canyons where they can gain access to cooler temperatures under the rocks. Several species are known only from their type localities, and were described by shell characters only. We have endeavored to locate known species, document their reproductive anatomy and embryonic shell structure, refine knowledge of their distribution, and incorporate genetic sequencing of two mitochondrial genes (COI and 16S) to investigate evolutionary relationships in these taxa. As a “first pass” molecular study, we have established basic sequence and divergence data for 27 populations of snails in five genera: Helminthoglypta (subgenus Coyote), Eremarionta, Cahuillus, Chamaearionta and Sonorelix. Fifteen of the populations were previously unknown. We confirmed that the Salton Rift/Coachella Valley is a major biogeographic barrier for land snails, as is the north/south transition between the Colorado and Mojave deserts. Described species of Helminthoglypta (Coyote) grouped together in our phylogenetic analyses and differed from each other by 8-18% in the sequence of the COI gene, concordant with differentiating shell characters. Two previously unknown populations grouped with the Coyote species but their COI sequences differed from the described species by 5.7-17% suggesting they may represent undescribed Coyote species. Populations of Sonorelix from the eastern Mojave were somewhat similar genetically to Sonorella spp. from southern Arizona but the precise nature of any relationship between these genera remains unresolved. The remaining, previously unknown populations were genetically close to described species of Eremarionta, but inclusion of COI sequences of two Cahuillus spp. rendered the genus Eremarionta paraphyletic, raising questions about the validity of the names applied to some described species. In particular, the subspecies E. rowelli bakerensis was clearly different (>11% in COI) from E. rowelli amboiana and E. rowelli acus, and deserves elevation to at least species status. The eastern Mojave Eremarionta from near Pahrump, Nevada may also be an undescribed species, differing in its COI sequence from its closest described relative by 6.0%. Perhaps the most surprising result from our study was the finding of a population close to the Salton Sea that was very closely related to E. rowelli ssp. bakerensis which occurs ∼200 km further north. This highlights the complex nature of genetic variation among geographically isolated Eremarionta populations across the eastern Mojave and western Colorado Deserts."}