{"doi": "https://doi.org/10.17816/ecogen1534-19", "year": 2017, "abstract": "Using the polymorphic DNA markers (RAPD and ISSR), the genetic structure was examined and the viability of 26 populations of the terrestrial gastropod Bradybaena (Fruticicola) fruticum Mll., most of which lives in the south of the Central Russian Upland, was estimated. Samples from Romania, the Urals and Vyatka regions for comparison were taken. In total, 1153 individuals were examined. The level of expected heterozygosity averaged He = 0.208 0.028, the Shannon index Ish = 0.320 0.039. The lowered level of variability, both actual and theoretically expected (estimated by the methods of Chao1-bc and 1st order jackknife) in groups of anthropogenically disturbed biotopes inhabiting the zones of industrial enterprises is noted. The indices of the genetic disunity of the populations were Fst = 0.298, Gst = 0.254, and the level of the gene flow Nm = 0.708. The cluster analysis and the Mantel correlation coefficient Rm = 0.024 showed the absence of a reliable relationship between the geographic and genetic distance between populations, which indicates the violation of the isolation model by distance and confirms the thesis advanced earlier that the urbanized forest-steppe landscape disrupts the natural migration processes, leads to the strong isolation and of the genetic drift in populations of snails. At the same time, the observed phenomenon of increasing the degree of subdivision of populations against the background of a decrease in the allelic diversity noted by us in many groups of bush snail can be regarded as the shift of genetic equilibrium toward increasing interpopopulation diversity (according to Wright's model). The calculation of the effective population size with the help of the Slatkin model turned out to be the lowest of the background mollusks in the study area (Ne = 0.39-0.83). However, the level of the effective population size calculated with the subdivision index (Fst and Gst) was equal to 6.2 and 7.3, respectively, which is comparable with other species of mollusks."}