{"doi": "https://doi.org/10.31390/gradschool_disstheses.3994", "year": 2022, "abstract": "The life cycle of Alaria marcianae (Trematoda) as found in Louisiana involves the planorbid snail, Helisoma trivolvis, as first intermediate host; tadpoles of Rana catesbiana, R. clamitans, R. utricularia, Hyla cinerea, and Gastrophryne carolinensis as second intermediate hosts; a wide range of amphibian, reptilian, and mammalian paratenic hosts; and the bobcat (Lynx rufus), domestic cat (Felis domesticus), and juvenile raccoon (Procyon lotor) as definitive hosts. Eggs defecated by the definitive host require an incubation period of approximately 20 days; a free swimming miracidium hatches from each egg and must penetrate a snail within 24 hr or die; the miracidium transforms into a mother sporocyst within the anterior blood sinuses of the snail; mother sporocyst germ cells produce a generation of daughter sporocysts which migrate to the snail digestive gland; daughter sporocyst germ cells give rise to free swimming cercariae as early as 61 days postexposure to miracidia; cercariae must penetrate tadpoles within 48 hr or die and those that are successful metamorphose to the mesocercarial stage within 14 days; mesocercariae in tadpoles that are consumed by a paratenic host remain mesocercariae, but if consumed by a definitive host they begin a complex 15-day migration involving both direct and circulatory pathways to the lungs where they metamorphose to diplostomula and then a return trip to the small intestine via the bronchi, trachea, and esophagus where they mature to the adult. Electron microscopical studies on these stages suggest that the migration from the lungs to the small intestine is orchestrated by the host's defense mechanisms rather than an active migration on the part of the parasite. Transmammary infection with mesocercariae is described experimentally in mice, domestic cats, and raccoons. Mesocercariae are diverted from their normal pathway to the mammary gland only during lactation, thereby implying a hormonal stimulus. No prenatal infection occurs. Three distinct patterns of mesocercarial behavior in lactating mammals are presented: (1) in euparatenic hosts the mesocercariae remain undifferentiated in both the parent and offspring; (2) in amphiparatenic hosts the mesocercariae remain undifferentiated in the parent, but they mature to adults when transmitted to the offspring; and (3) in definitive hosts both the parent and offspring possess the physiological requirements for development of the mesocercariae to adult worms."}