{"doi": "https://doi.org/10.1016/j.ympev.2017.12.018", "year": 2018, "abstract": "The land snail Cornu aspersum aspersum, native to the Mediterranean region, has been the subject of several anatomical and molecular studies leading to recognize two divergent lineages, named “East” and “West” according to their geographical distribution in North Africa. The first biogeographical scenario proposed the role of Oligocene paleogeographic events and Quaternary glacial refugia to explain spatial patterns of genetic variation. The aim of this study was to refine this scenario using molecular and morphometric data from 169 populations sampled across Mediterranean islands and continents. The two previously described lineages no longer correspond to distinct biogeographical entities. Phylogenetic relationships reveal the existence of seven clades, do not support the Tyrrhenian vicariance hypothesis, and suggest that C. a. aspersum most likely originates from North Africa. We found two contrasted patterns with the seven clades defining spatially well-structured populations in the southern Mediterranean whereas one clade is distributed across the basin. High genetic diversities and rates of endemism in North Africa support the role of this region for the diversification of C. a. aspersum. In referring to divergence times previously estimated, we suggest allopatric differentiation due to geological changes of the Atlas system and multiple refugial areas during Pleistocene glaciations. The new biogeographical scenario implies an initial range expansion from North Africa to the Iberian Peninsula and the peri-Tyrrhenian regions through land bridges connections during the Messinian Salinity Crisis and Pleistocene glaciations. Historical events appear to have also structured morphometric variation but recent dispersal events favored the emergence of secondary contacts between clades. Southern Mediterranean clades are limited to their initial distribution and populations of the recent clade would have rapidly recolonized the whole Mediterranean in the Holocene due to greater adaptive potential and the influence of human transportations."}