{"doi": "https://doi.org/10.21521/mw.6074", "year": 2018, "abstract": "The objective of the research was to determine the occurrence of microorganisms of the Salmonella spp. and Listeria spp. in raw and frozen (cooked) snail meat obtained from both free-living and farmed edible snails. The research material comprised meat samples collected from three snail species (25g from each), that is, Roman snail (Helix pomatia – HP), small brown garden snail (Cornu aspersum aspersum – CAA) and large brown garden snail (Cornu aspersum maxima – CAM). Roman snails came from their natural environment and were harvested in Wielkopolska Voivodeship and Lower Silesia Voivodeship (regions A and B, respectively). The Cornu genus snails were obtained from two heliciculture farms located in the abovementioned voivodeships (farms A and B, respectively). On both farms, the snails were maintained under the mixed rearing system. The raw meat samples taken from the edible portion of snails, that is, the foot with collar and a fragment of the mantle, were obtained after the snails were sacrificed in the laboratory. The frozen meat samples, on the other hand, came from a snail meat processing facility. A total of 300 samples were examined for the presence of Salmonella spp., and 240 for the presence of Listeria spp. The research also included pooled soil samples of 0.5 kg each collected from polytunnels (in the pre-fattening stage) and outdoor farming plots (in the fattening stage). The tests for the Salmonella presence were performed in accordance with Polish standard PN-EN ISO 6579:2003, and the test for Listeria complied with PN-EN ISO 11290-1:1999. Listeria monocytogenes was identified by the PCR technique. Salmonella spp. were not detected in any of the 300 samples of raw and cooked snail meat under study. Nor were these pathogens isolated from the soil samples. The absence of these bacteria in the raw meat samples indicates that Salmonella spp. did not occur in either the natural habitat of Roman snails or the two farms producing Cornu genus snails. On the other hand, bacteria of Listeria spp. were detected in 101 (42.1%) snail meat samples. A particularly high load of microbiota was found in raw meat, as these bacteria contaminated from 60% (for HP from region A and CAM from farm B) up to 75% (for CAA from farm A) of samples. Notably, a markedly lower percentage (35%) of samples containing Listeria spp. was found only among the Roman snail raw meat samples from the region B. Listeria spp. were also detected in all the soil samples. Thermal treatment of meat achieved a substantial reduction in the load of Listeria spp., but did not eliminate it. The frequency of this genus in frozen meat samples was from 63.5% (for CAM from farm A) to 15.4% (for CAA from farm B) of that in raw meat. The PCR technique was used identify 15 selected strains, including 11 from raw meat samples and 4 from cooked meat. A total of 5 isolates were recognized as Listeria monocytogenes (2.1% of all samples examined and 4.95% of samples with Listeria spp.). All of them originated from the raw meat of farmed snails, including one (CAA) from the farm A and four (3 CAA and 1 CAM) from the farm B. Bacteria of the Salmonella and Listeria genera occur in the natural habitat of edible snails, which poses a potential hazard to human health. Effective implementation of control programmes at the primary production stage is the first step that could considerably limit the presence of these pathogens in farmed snails and, consequently, in snail meat. ."}