{"doi": "https://doi.org/10.1111/ddi.12718", "year": 2018, "abstract": "Abstract Aim We present the first continental‐scale study of factors controlling the species richness of groundwater‐fed fens, comparing land snails, vascular plants and bryophytes. We separately analyse two ecologically distinct groups differing in conservation value and colonization/extinction dynamics, that is habitat specialists, and matrix‐derived species. Considering the island‐like nature of fen habitats, we hypothesize larger differences in the species richness–environment relationships between habitat specialists and matrix‐derived species than among the taxonomic entities. Location Seven European regions Methods Richness was counted at 373 well‐preserved fens with undisturbed hydrology using the same protocols. Relationships between the species richness and water pH , waterlogging, climate and geography were explored by GLM s. Results Land snail richness responded mainly to water pH , regardless of habitat specialization. Richness of vascular plant and bryophyte specialists was strongly driven by geographical location of the sites, while that of matrix‐derived species was driven by waterlogging and water pH . The richness of matrix‐derived species of all taxa significantly increased with the decreasing waterlogging. Residual richness of specialists of all taxa decreased towards southern Europe. Main conclusions In island‐like terrestrial habitats, differences between specialists and matrix‐derived species may outweigh differences among taxa, unless there is one strong physiological determinant of species richness such as pH in land snails. The richness of specialists seems to be strongly related to difficult‐to‐measure regional factors such as historical frequency and connectivity of fen habitats. The richness of matrix‐derived species depends mainly on local conditions, such as pH and waterlogging, determining the degree of habitat contrast against the surrounding matrix. Sufficient waterlogging maintains a high representation of habitat specialists in fen communities, and disturbance of water regime may cause the increase in the number of matrix‐derived species and potentially trigger successional shifts towards non‐fen communities."}