{"doi": "https://doi.org/10.1007/978-3-319-67177-2_3", "year": 2018, "abstract": "To assess the effects of guava on the community of soil invertebrates, we compared carbon and nitrogen concentrations in soil and plant tissues, and the diversity of soil invertebrates, between two areas with similar altitude and climate but which differ in the presence of guava in the highlands of San Cristobal Island. On the other hand, to analyze how guava could be affected by animal communities, we present a preliminary evaluation of introduced mammals’ role as seed dispersers of this invasive species. Fieldwork was carried out from 2011 through 2013 for 1 month in the dry and 1 month in the rainy season. Data on soil pH and snail diversity was gathered in the dry season of 2015. We collected soil and leaf samples from ten 1-m2 plots randomly selected at one site with pasture and guava and at a restoration site with native plant species. These samples were analyzed to assess their nitrogen and carbon contents. The diversity of soil invertebrates was assessed by carrying out surveys in subplots of 25 cm2 in each of the 1-m2 plots in the study areas. We focused the surveys on the diversity of the taxonomic orders of soil invertebrates and on the species diversity of ants and land snails. To evaluate the role of introduced mammals as guava seed dispersers, we randomly collected 24 fecal samples from cattle and 21 from horses that were using the area of pasture and guava. We later compared the number of seeds per gram of dried feces for both species. We found a significantly lower nitrogen concentration in soil and leaf tissue in the pasture-guava site. This could be related to a decrease of nitrogen availability resulting from a process of soil acidification that occurred over time as a result of a high rate of nitrogen deposition. We did not find significant differences in the community structure of soil invertebrates between sites using any of the three approaches. Both sites shared most of the taxonomic orders. When focusing on the species diversity of ants and land snails, differences in diversity were not significant either. Of the ten species of ants we recorded, eight are introduced species. We found two introduced species and five native species of land snails; the abundance of the introduced snails, though, was higher than the abundance of native species in both study areas. We found a higher number of seeds per gram of dried horse feces, suggesting that horses are more effective dispersers of the guava than cattle. Our results point to the complexity of the interactions between exotic plants and animals. These interactions have altered the terrestrial environments in Galapagos in ways that still need to be fully understood."}