{"doi": "https://doi.org/10.32800/abc.2018.41.0109", "year": 2018, "abstract": "espanolVertigo moulinsiana es una especie de diminutos caracoles terrestres que necesitan condiciones de humedad elevada y que se encuentran en habitats humedos y temporalmente inundados. La especie figura en la Lista Roja de Especies Amenazadas de la UICN con la categoria VU (vulnerable) y se considera una prioridad alta de conservacion. Asimismo, se menciona en el anexo II de la Directiva Habitat de la Union Europea, en la que se aconseja a los Estados miembros que hagan un seguimiento de la especie. Como el seguimiento de V. moulinsiana se basa en el conteo de los individuos adheridos a plantas en el campo, los resultados solo se podran evaluar debidamente cuando se comprenda el comportamiento de la especie. Por consiguiente, el proposito de este estudio es analizar el ciclo de luz y oscuridad de adultos y juveniles, y comparar los patrones de actividad de ambos grupos de edad en condiciones de oscuridad a temperaturas de 6oC y 21oC. Las observaciones se realizaron en condiciones de laboratorio y con humedad elevada constante (del 100% o casi). Se observo que los juveniles eran mas activos que los adultos durante el dia, por la noche y tanto a 6oC como a 21oC. Ademas, los dos grupos de edad de V. moulinsiana eran mas activos a 21oC que a 6oC y su actividad era mas elevada por la noche que durante el dia. Estos resultados indican que el comportamiento puede incidir en los resultados del seguimiento basado en el examen visual y que deberia tenerse en cuenta a la hora de interpretar los datos. EnglishVertigo moulinsiana is a minute land snail species which requires high humidity conditions and is found in wet, temporarily inundated habitats. The species is listed in the IUCN Red List of Threatened Species under the VU (vulnerable) category and is considered a high conservation priority. It is also mentioned in Annex II of the EU Habitat Directive, which imposes the obligation to monitor the species in member countries. The monitoring of V. moulinsiana is based on counting individuals attached to plants in the field, and thus any results may only be properly evaluated when the behavior of the species is understood. Therefore, the aim of this study was to investigate the light–dark cycle of both adults and juveniles within the species as well as to compare activity patterns of both age groups in dark conditions in temperatures of 6oC and 21oC. Observations were carried out under laboratory conditions, at a high and constant humidity (humidity was at or nearly 100%). It was shown that juveniles were more active than adults during the day, at night, and at 6oC and 21oC. In addition, both age groups of V. moulinsiana were more active at 21oC than at 6oC, and their activity was higher at night than during the day. Such behavior may have an impact on monitoring results based on visual examination and should be taken into account when the data are interpreted."}