{"doi": "https://doi.org/10.4000/quaternaire.8819", "year": 2018, "abstract": "Amphibulima patula (Bruguiere, 1789) is a rare native terrestrial mollusc from Guadeloupe. The past distribution of this species, assessed by shells collected from archaeological sites, natural deposits or surface surveys, shows it previously had a wider distribution that extended across all the limestone islands of the Guadeloupe archipelago. Stratigraphical contexts and radiocarbon data suggest that the presence or abundance of A. patula is related to periods of wetter environmental or climatic conditions, indicating that environmental factors influenced past variations in the distribution of this species. Its limitation to rare ecological refuges in periods of dry climatic conditions, combined with human-induced landscape modifications, have led to significant reductions in the numbers of individuals of this species that is today threatened with extinction in the Guadeloupe Islands. L’Ambrette capuchon, Amphibulima patula (Bruguiere, 1789), est un escargot indigene rare en Guadeloupe, connu en Grande Terre et, historiquement, a Marie-Galante. Les coquilles collectees en site archeologique, en site geologique ou lors de prospections malacologiques, temoignent d’une distribution de ce taxon plus etendue par le passe qu’a l’actuel, couvrant l’ensemble des iles calcaires de l’archipel guadeloupeen. Les donnees geologiques, stratigraphiques et chronologiques montrent que la presence et l’abondance d’A. patula se correlent a l’optimum humide de l’Holocene, ou a un contexte de plaine littorale humide pour les coquilles recueillies dans les depots du dernier interglaciaire, suggerant par la-meme que les facteurs environnementaux ont controle les variations passees de l’aire de distribution de cette espece. Une distribution limitee a de rares refuges ecologiques en periode seche, combinee a une degradation humaine des milieux, a conduit a une reduction significative de l’abondance de cet escargot aujourd’hui proche de la disparition en Guadeloupe."}