{"doi": "https://doi.org/10.1590/1676-0611-bn-2017-0503", "year": 2018, "abstract": "Abstract The giant African land snail, Lissachatina fulica is considered to be one of the world's worst invader species. This snail can provoke major economic and public health problems in urban areas, in particular as a potential vector of nematodes that infect both humans and animals. In this context, the present study investigated the extent of the infestation of this exotic snail in the urban neighborhoods of the city of Rio Branco, verified the presence of endoparasites in these snails, and evaluated the knowledge of local residents with regard to the presence of this invader species. For this, daytime surveys were conducted between August 2015 and June 2016. For the analysis of endoparasites, 44 live specimens were sent to the National Reference Laboratory for Schistosomiasis-Malacology (LRNEM) of the Oswaldo Cruz Institute (FIOCRUZ). The knowledge of local residents in the infested neighborhoods was investigated using questionnaires with direct, closed questions. The exotic invader species (L. fulica) was detected in 24 of the 36 neighborhoods visited. A total of 858 L. fulica specimens were collected, of which, 329 were alive and 527 were dead. The total length of the shell ranged from 0.7 to 14.2 cm, with a mean±standard deviation of 4.8±2.21 cm. The density of snails in the areas surveyed varied from 0.34 individuals/m2 to 3.54 individuals/m2, while the mean density within the whole study area was estimated to be 0.54 individuals/m2. Mature eggs were found in only 9 (2.7%) of the 329 specimens dissected. The endoparasitological analysis revealed the presence of rhabditiform larvae in 84% of the specimens examined, as well as the nematodes Aelurostrongylus abstrusus (22.7% of the specimens) and Strongyluris sp. (2.2%). A total of 39 local residents were interviewed, and while all were conscious of the presence of the mollusk, none knew its origin or the most adequate way of dealing with it. The results of the study indicate an ample infestation of the city of Rio Branco by L. fulica, and confirmed a complete lack of intervention on the part of the local authorities for the implementation of measures foe the control and management of this pest within the urban zone of Rio Branco."}