{"doi": "https://doi.org/10.15421/021829", "year": 2018, "abstract": "This paper summarizes the mechanisms behind the patterning of the intra-population abundance distribution of the land snail Vallonia pulchella (Müller, 1774). The molluscs were collected in recultivated soil formed on red-brown clays (Pokrov, Ukraine). Data obtained in this study reveal that V. pulchella population abundance ranges from 1 to 13 individuals per 100 g of soil sample. To obtain estimates of the mean, three models were used: the model of the arithmetic mean, the Poisson model and a log-normal model. The arithmetic mean of the occurrence of this species during the study period was 1.84 individuals/sample. Estimation of the average number of molluscs in one sample calculated using the Poisson model is lower and equals 1.40 individuals/sample. The distribution of the number of individuals in a population was described by the graphics \"rank – abundance\". The individual sample plot sites with molluscs may be regarded as equivalents of individual species in the community. For the analysis, the following models were used: broken sticks model, niche preemption model, log-normal model, Zipf model, and Zipf-Mandelbrot model. Applying the log-normal distribution gives a lower estimate of the mean density at 1.28 individuals/sample. Median value and mode is estimated at 1.00 individuals/sample. The Zipf-Mandelbrot model was shown as the most adequate to describe distribution of the V. pulchella population within the study area. The Zipf-Mandelbrot model belongs to the family of so-called non-Gaussian distributions. This means that the sample statistics do not possess asymptotic properties and by increasing the sample size, they tend to infinity, and are not close to the values of the general population. Therefore, the average value of the random variable that describes the non-Gaussian distribution has no statistical meaning. From an environmental point of view, this means that within the study area the capacity of the habitat is large, and for some combination of environmental conditions the rapid growth of the abundance of a given species is possible."}