{"doi": "https://doi.org/10.1007/s10437-018-9305-3", "year": 2018, "abstract": "Shell beads are well established in the archaeological record of sub-Saharan Africa and appear as early as 75,000 BP; however, most research has focused on ostrich eggshell (OES) and various marine mollusc species. Beads made from various land snails shells (LSS), frequently described as Achatina, also appear to be widespread. Yet tracking their appearance and distribution is difficult because LSS beads are often intentionally or unintentionally lumped with OES beads, there are no directly dated examples, and bead reporting in general is highly variable in the archaeological literature. Nevertheless, Achatina and other potential cases of LSS beads are present at over 80 archaeological sites in at least eight countries, spanning the early Holocene to recent past. Here, we collate published cases and report on several more. We also present a new case from Magubike Rockshelter in southern Tanzania with the first directly dated LSS beads, which we use to illustrate methods for identifying LSS as a raw material. Despite the long history of OES bead production on the continent and the abundance of land snails available throughout the Pleistocene, LSS beads appear only in the late Holocene and are almost exclusively found in Iron Age contexts. We consider possible explanations for the late adoption of land snails as a raw material for beadmaking within the larger context of environmental, economic, and social processes in Holocene Africa. By highlighting the existence of these artifacts, we hope to facilitate more in-depth research on the timing, production, and distribution of LSS beads in African prehistory.Les perles de coquillages sont bien établies dans les archives archéologiques de l’Afrique subsaharienne et apparaissent dès 75 000 BP, mais la plupart des recherches ont porté sur la coquille d’œuf d’autruche (OES) et diverses espèces de mollusques marins. Les perles fabriquées à partir de diverses coquilles d’escargots terrestres (LSS), souvent décrites comme Achatina, semblent également être répandues. Cependant, le suivi de leur apparence et de leur distribution est. difficile parce que les billes LSS sont souvent volontairement ou involontairement regroupées avec des billes OES, il n’y a pas d’exemples directement datés, et les rapports sur les perles en général sont très variables dans la littérature archéologique. Néanmoins, Achatina et d’autres cas potentiels de perles LSS sont présents sur plus de 80 sites archéologiques dans au moins huit pays, couvrant le début de l’Holocène à un passé récent. Ici, nous rassemblons les cas publiés et rapportons plusieurs autres cas. Nous présentons également un nouveau cas de Magubike Rockshelter dans le sud de la Tanzanie avec les premières perles LSS directement datées, que nous utilisons pour illustrer les méthodes d’identification du LSS comme matière première. Malgré la longue histoire de la production de perles d’OES sur le continent et l’abondance d’escargots terrestres disponibles tout au long du Pléistocène, les perles de LSS n’apparaissent qu’à la fin de l’Holocène et sont presque exclusivement trouvées dans des contextes de l’âge du fer. Nous considérons les explications possibles de l’adoption tardive des escargots terrestres en tant que matière première pour la fabrication de perles dans le contexte plus large des processus environnementaux, économiques et sociaux en Afrique de l’Holocène. En mettant en évidence l’existence de ces artefacts, nous espérons faciliter des recherches plus approfondies sur le calendrier, la production et la distribution des perles LSS dans la préhistoire africaine."}