{"doi": "https://doi.org/10.1016/j.scitotenv.2018.07.426", "year": 2019, "abstract": "Through evolution, marine snails have adapted several times independently to terrestrial life. A prime example for such transitions is the adaptation to terrestrial conditions in members of the gastropod clade of Littorinoidea (Caenogastropoda). Some species of this lineage like the periwinkle (Littorina littorea), live in intertidal habitats, where they are intermittently exposed to semi-terrestrial conditions. Pomatias elegans is a close relative of Littorina littorea that has successfully colonized terrestrial habitats. Evolutionary transitions from marine to terrestrial conditions have often been fostered in marine ancestors by acquisition of physiological pre-adaptations to terrestrial life. Such pre-adaptations are based, among others, on the optimization of a wide repertoire of stress resistance mechanisms, such as the expression of metal inactivating metallothioneins (MTs). The objective of our study was to explore the Cd handling strategy in the terrestrial snail Pomatias elegans in comparison to that observed previously in Littorina littorea. After Cd exposure, the metal is accumulated mainly in the midgut gland of Pomatias elegans, in a similar way as in its marine relative. Upon Cd exposure, Pomatias elegans expresses Cd-specific MTs, as also described from Littorina littorea. In contrast to the latter species, however, the detoxification of Cd in Pomatias elegans is mediated by two different MT isoforms, one two-domain and one three-domain MT. Although the MT proteins of both species are homologous and clearly originate from one common ancestor, the three-domain MT isoform of Pomatias elegans has evolved independently from the three-domain MT of its marine counterpart, probably by addition of a third domain to the pre-existing two-domain MT. Obviously, the occurrence of homologous MT structures in both species is a hereditary character, whereas the differentiation into two distinct MT isoforms with different upregulation capacities in Pomatias elegans is an adaptive feature that probably emerged upon transition to life on land."}