{"doi": "https://doi.org/10.4172/2376-0214.1000171", "year": 2018, "abstract": "Investigations into relationships of eggs, hatchlings and adult of Giant African land snail Archachatina marginata were conducted to ascertain optimum size of the snail species for better performance in snail farming. The research was carried out at the Teaching and Research Farm of the Department of Ecotourism and Wildlife Management, Federal University of Technology, Akure, Ondo State, Nigeria. A total number of 80 adult giant African land snails of four different sizes were used in conducting the experiment. The 80 adults of Archachatina marginata were weighed, grouped into four according to weight and labeled treatments A-D. (A- 100-249 g, B- 250-349 g, C- 350-449 g and D- 450-549 g). The snails in each group were duplicated and stocked into wooden cages of dimension 60 cm × 50cm × 45 cm and filled with loamy soil up to 15 cm thickness. The Giant African land snail A. marginata in each group were fed ad libtum with plant food materials for 90 days during the rainy season. Archachatina marginata eggs were searched for daily in the enclosure of each group, collected eggs were weighed, egg length and width measured, and incubated group by group. Hatchlings from the incubated eggs each group were collected, weighed, shell length and width measured and recorded accordingly. The results indicated that the GALS A. marginata Group D laid the eggs that had the highest mean weight (5.3 ± 0.1 g), mean length (2.5 ± 0.1 cm) and mean width (1.9 ± 0.1 cm). While those Group A laid the smallest eggs that had the lightest mean weight (2.8 ± 0.1 g), mean length (2.1 ± 0.1 cm) and mean width (1.5 ± 0.1 cm). Significant differences (p<0.05) existed among each of the parameters of weight, length, and width of the eggs from adult Archachatina marginata in all the treatment groups, this pointing to the dependency of egg characteristics of Archachatina marginata on the adult that laid the eggs. Similar incubation period of 30 days was recorded in all the groups. The hatchlings weight, length and width were found to depend on the eggs weight, length and width of A. marginata incubated."}