{"doi": "https://doi.org/10.7717/peerj.5986", "year": 2018, "abstract": "Background Land gastropods of the Dry Chaco merit special attention because they comprise a highly diverse but barely studied group. Clessinia Doering, 1875 are typical inhabitants of this ecoregion. The inclusion of their distribution areas into Spixia range, their shell shape similarities, and a former molecular study raised doubts on the monophyly of this genus. The present study review the species of Clessinia , under a morphological, geometric morphometrics, and molecular combined approach. Methods Adults were collected, photographed, measured, and dissected for anatomical studies. Shell ultrastructure was studied with scanning electron microscope. Geometric morphometric analyses on shells were performed testing if they gave complementary information to anatomy. Two mitochondrial genes, and a nuclear region were studied. Phylogenetic reconstructions to explore the relationships of DNA sequences here obtained to those of Clessinia and Spixia species from GenBank were performed. Results Species description on shell, periostracal ornamentation and anatomy is provided. We raised former Clessinia cordovana striata to species rank, naming it as Clessinia tulumbensis sp. nov. The periostracum, consisting of hairs and lamellae, has taxonomic importance for species identification. Shell morphometric analyses, inner sculpture of penis and proportion of the epiphallus and penis, were useful tools to species identification. Nuclear markers do not exhibit enough genetic variation to determine species relationships. Based on the mitochondrial markers, genetic distances among Clessinia species were greater than 10%, and while C. cordovana , C. nattkemperi , and C. pagoda were recognized as distinct evolutionary genetic species, the distinction between C. stelzneri and C. tulumbensis sp. nov. was not evident. Clessinia and Spixia were paraphyletic in the molecular phylogenetic analyses. Species of Clessinia here treated have narrow distributional areas and are endemic to the Chaco Serrano subecoregion, restricted to small patches within the Dry Chaco. Clessinia and Spixia are synonymous, and the valid name of the taxon should be Clessinia Doering, 1875 which has priority over Spixia Pilsbry &amp; Vanatta, 1894. Discussion Our results support the composition of C. cordovana complex by three species, C. cordovana , C. stelzneri , and C. tulumbensis sp. nov. The low genetic divergence between C. stelzneri and C. tulumbensis sp. nov. suggests that they have evolved relatively recently. The former Spixia and Clessinia are externally distinguished because Clessinia has a detached aperture from the body whorl forming a cornet, periostracal microsculpture extended over dorsal portion of the peristome, five inner teeth on the shell aperture instead of three–four found in Spixia . Morphological similarities exists between both genera in shell shape, type of periostracum microsculpture, reproductive anatomy, besides the overlap in geographic ranges."}