{"doi": "https://doi.org/10.1186/s40851-018-0120-0", "year": 2019, "abstract": "Spiral cleavage is a feature of non-ecdysozoan protostomes, in which left-right reversal frequently evolved in gastropod molluscs. In pulmonate gastropods, maternal molecules are responsible for chirality patterning, on which the polarities of visceral and coiling asymmetries depend. In the pond snail, Lymnaea stagnalis (the clade Hygrophila), a frame-shift mutation of one of tandem-duplicated, diaphanous-related formin genes (diaph) resulted in incomplete reversal from dextral to sinistral cleavage. Is this mechanism of chirality regulation common to, or shared with other pulmonates? To answer this question, we examined genes involved in chirality patterning in the land snail, Bradybaena similaris which belongs to the clade Stylommatophora. Both dextral and sinistral siblings develop from progeny of a racemic mutant of B. similaris. Differences in maternal mRNAs between the two strains were searched by transcriptome analyses. We found fifty maternal transcripts that exhibited less expression in early embryos of the mutant strain. The most conspicuous was a homolog of diaph. The diaph gene was duplicated in the stylommatophoran ancestor (diaph-a and diaph-b), as in the case of the ancestor of Lymnaea (Lsdiaph1 and Lsdiaph2). The quantity of maternal diaph-b mRNA was drastically reduced in early embryos of the racemic mutant compared to wild-type, while diaph-a expression was at nearly the same level in both strains. Unlike the case of Lsdiaph2, which is frame-shifted to produce truncated peptides in the mutant of L. stagnalis, however, Bsdiaph-b mRNA in the mutant strain is not frame-shifted and most probably produces normal Diaph-b protein. These results suggest the presence of regulatory mechanisms of gene expression for chirality patterning in pulmonate gastropods, although genomic analyses are required for confirmation. Heterochirality resulting from the loss of polarity control in spiral cleavage does not require mutation of the diaph gene in B. similaris. The determination of left-right polarity instead depends on the expression of this diaph gene, which is duplicated in stylommatophoran Bradybaena, as well as in hygrophilan Lymnaea. Our results provide an avenue to identifying a regulatory mechanism that controls the direction of spiral cleavage in gastropods."}