{"doi": "https://doi.org/10.5070/v419110033", "year": 2000, "abstract": "St. Helena is an Atlantic Ocean island lying 1,200 miles off the coast of Angola. Both species of commensal Rattus occur on the island, the ship rat (R. rattus) having possibly arrived as early as 1502, the year of the island’s discovery, and the brown rat (R. norvegicus) in the 1700s. Today, rats are widespread and common over the entire island, including the arid wastes, the inhabited and agricultural areas, and into the National Park around the central peaks. The impact of invasive rats on the endemic flora and fauna (predominantly invertebrate with many endemic species of snail, spider, and weevil being recorded) is unknown. The only natural enemies of rats on the island are occasional feral cats, raptors, and other predators being absent. In 1924, the Agriculture and Forestry Department started a 50 year poisoning campaign against rats which ended in 1956 when the brown rat was considered to be almost extinct. Since that time a continuous island-wide suppression campaign has been carried out by the Department of Public Health. This consists of placing anticoagulant baits in and around the inhabited areas of the island (and, on demand, in the agricultural and forested land) routinely, checking baits at least every two weeks and more often if take is high. On average, 20 tons of bait are laid every year. Data on baits placed, takes, and dead rats found were examined for the years 1995 to 1998. R. norvegicus was found to be the most common species, with the two species approaching 1:1 in only three areas of the island. A number of recommendations for the improvement of the rodent control program have been made with the overall aim of raising the professional status of the operators from that of \"rat baiters\" to that of professional pest control technicians. This will effectively raise the professional status of the Environmental Health Section as a whole. The aim is also to involve the public as partners for improvements in their own health and welfare."}