{"doi": "https://doi.org/10.1186/s40709-019-0093-y", "year": 2019, "abstract": "Postcopulatory sexual selection is very important in species with reproductive strategies that involve multiple mating and prolonged sperm storage. The sperm storage organ has been hypothesized to evolve in response to different levels of sperm competition in several species while population density has been considered as a factor that approximates sperm competition risk and intensity in the field. Apart from population density, local microclimatic conditions may also play a role in determining sperm competition levels in natural populations of land snails by affecting their chances of encountering mates. The goal of this study was to investigate the variation of the structure of the sperm storage organ in the simultaneously hermaphroditic land snails Helix lucorum and Cepaea vindobonensis occurring sympatrically in two sites which differed in habitat humidity. The populations of both species from the two sites, also differed in density and in duration of reproductive period. Multiple samples were taken from each population in order to test for temporal variation.In both species, the spermatheca consisted of a simple fertilization chamber and a variable number of lateral tubules. The length of the spermatheca showed no temporal or spatial differentiation nor did it show any correlation with snail size. The number of tubules in Helix lucorum ranged from five to sixteen and in Cepaea vindobonensis from one to eight and in both species a significant difference of this trait between the two study sites was detected. In Cepaea vindobonensis, the difference in tubule number led to difference of the total tubule length which reflects sperm storage capacity of the spermatheca but this was not the case with H. lucorum in which no increase in total tubule length was detected.Intraspecific variation in the spermatheca was observed in both snail species studied. The variation observed was independent of snail size, and reproduction status, while the two species responded differently to higher sperm competition levels."}