{"doi": "https://doi.org/10.1163/18759866-08702001", "year": 2018, "abstract": "Helix lucorum is a large synanthropic land snail of substantial economic importance, which has been recently reported from a number of new sites in Western, Central, and Eastern Europe. It is an originally Anatolian and Caucasian species, but its presumed natural distribution also covers the south and east of the Balkans. Populations of unclear origin, known as Helix lucorum taurica , live in the south-western part of Crimea. The Balkan and Crimean populations differ in their appearance, were long treated as different species or subspecies, and the Crimean populations are protected by law as a presumably endemic taxon. Here we explore the origins of European populations using phylogenetic analysis of mitochondrial markers. The results point to north-eastern Anatolia and the Lesser Caucasus as the centre of H . lucorum diversification. The Crimean conchological form, along with the associated mitochondrial lineage, is not endemic to that peninsula and was likely introduced there. Other European samples belong to a different lineage, which is associated with the nominotypical conchological form of H . lucorum . The conchological characteristics of the nominotypical form are unusual within the genus Helix , and we propose this reflects a change in habitat use and parallels the evolution of some other lineages of Helicidae. As a result, the typical European H . lucorum differs considerably from the Crimean populations, but the two lineages just represent opposite ends of a continuum in conchological characteristics. Their formal descriptions were based on probably introduced populations detached from the main range. Separated from the geographic pattern of the overall variation of H . lucorum they appeared distinctive, thus confounding the taxonomy of the species. Currently, the division of H . lucorum into subspecies appears unwarranted. Helix lucorum may not be a unique example of a large snail successfully expanding from Anatolia, as we argue that even the native origin of Balkan populations is uncertain. However, further sampling in north-western Turkey and analysis of archaeozoological findings from the south-eastern Balkans is needed to evaluate this hypothesis."}