{"doi": "https://doi.org/10.1016/j.gca.2019.04.028", "year": 2019, "abstract": "Land snail fossils are abundantly distributed in geological deposits and their isotopic compositions provide a means to determine paleoclimatic changes. With the development of the clumped isotopes (Δ47) geothermometer, many efforts have been made in recent years to study clumped isotopes in land snail shell carbonate. Although there have been several recent attempts, there is, as yet, no empirical calibration function to convert land snail Δ47 to environmental temperature. Here, we systematically analyzed clumped isotopes (Δ47) of two common land snail species (Bradybaena and Cathaica) from China. Results showed that temperatures calculated using the Δ47 (T47) of both species did not correlate with the mean annual temperatures (MAT) at the study sites. However, the T47-MAT offset is negatively correlated to MAT, suggesting that land snails tend to add shell during the warmer months at colder sites or modulate their body temperature differently in colder regions. Meanwhile, clumped temperatures of Cathaica are 3.4 ± 1.5 °C higher than those of Bradybaena at 18 sites, indicating that a species-specific transfer function is needed to reconstruct paleotemperature using land snail clumped isotopes. After determining the proper duration of the growing season for land snails at different locations, we developed a Δ47-growth season temperature (GST) transfer function for the two species. The calibration function for Bradybaena land snails is expressed by a linear regression between 1/T2 and absolute Δ47 (R2 = 0.94): Δ47 = (0.0513 ± 0.0036) × 106/T2 + (0.0930 ± 0.0413), where Δ47 is expressed in ‰ and T in K. The calibration function for Cathaica is as follows (R2 = 0.80): Δ47 = (0.055 ± 0.011) × 106/T2 + (0.035 ± 0.129). The function for Cathaica was successfully applied to reconstruct mean summer (June-July-August) temperatures during the Last Glacial Maximum and modern times on the central Chinese Loess Plateau, based on Δ47 data of Cathaica sp. provided by Eagle et al (2013a). This testifies to the validity of the aforementioned constructed transfer function. In addition, the calculated δ18O of body water (δ18OBW) for Bradybaena showed a robust correlation with the δ18O of rainfall (δ18Op), particularly in northern China, which points to the potential to trace hydrological changes in the region. In contrast, Cathaica δ18OBW did not show a straightforward relation to δ18Op. This inter-species complexity warrants further study."}