{"doi": "https://doi.org/10.15421/011910", "year": 2019, "abstract": "The aim of our work is to describe the ecological niche of the land snail Brephulopsis cylindrica (Menke, 1828) in terms of the edaphic properties and properties of the vegetation cover and to show the spatial features of the variation of the habitat preference index within the artificial soil body – technosols (soddy-lithogenic soils on loess-like clays) using the ecological niche factor analysis (ENFA). The research was carried out at the Research Centre of the Dnipro Agrarian and Economic University in Pokrov. Sampling was carried out on a variant of artificial soil (technozems) formed on loess-like clays. The test site where the sampling was conducted consists of 7 transects of 15 samples each. Test points form a regular grid with a mesh size of 3 m. Soil mechanical impedance, aggregate-size distribution, soil electrical conductivity, vegetation physiognomic characteristics, and Didukh phytoindication scales were used as ecogeographic predictors of the mollusc’s ecological niche properties. Phytoindication assessment indicates that the technosol ecological regimes are favourable for sub-mesophytes, hemi-hydrocontrastophiles, neutrophiles, semi-eutrophs. The test for statistical significance showed that an axis of marginality of the ecological niche of B. cylindrica and axes of specialization are significantly different from the random distribution. We found that the ecological niche of the mollusc is determined by both edaphic factors and ecological features of vegetation. The marginality of B. cylindrica ecological niche over the entire period of study is determined mainly by preferences for physiognomic vegetation types, higher values of the continentality and thermality regimes. Often greater content in the soil of aggregates 1–3 mm in size coincides with greater numbers of B. cylindrica individuals. Individuals of this species avoid physiognomic type III and areas with higher soil alkalinity and mineralization detected both by means of the phytoindication approach and soil electrical conductivity data. Ecological niche optima may be presented by integral variables such as marginality and specialization axes and plotted in geographic space. The spatial distribution of the B. cylindrica habitat suitability index (HSI) within the technosols is shown, which makes it possible to predict the optimal conditions for the existence of the species."}