{"doi": "https://doi.org/10.5852/ejt.2019.526", "year": 2019, "abstract": "A revision of the land snail genus Landouria Godwin-Austin, 1918 (Camaenidae) from Java reveals that this group represents the most diverse land snail radiation on that island. Only six species of Landouria were recognized from Java in the last revision of the genus based on shell characters. Our investigation, which also considers the genitalia as well as DNA sequences, shows that the diversity in Java is much higher. Based on newly collected specimens as well as museum material, twenty-eight species of Landouria from Java are described and figured. To stabilize the nomenclature, neotypes are designated for L. winteriana (Pfeiffer, 1842) and L. rotatoria (Pfeiffer, 1842). Sixteen species are described as new to science, i.e., L. naggsi sp. nov., L. parahyangensis sp. nov., L. nusakambangensis sp. nov., L. petrukensis sp. nov., L. tholiformis sp. nov., L. madurensis sp. nov., L. abdidalem sp. nov., L. sewuensis sp. nov., L. tonywhitteni sp. nov., L. sukoliloensis sp. nov., L. nodifera sp. nov., L. pacitanensis sp. nov., L. zonifera sp. nov., L. pakidulan sp. nov., L. dharmai sp. nov. and L. menorehensis sp. nov. Landouria conoidea (Leschke, 1914) comb. nov., L. intumescens (Martens, 1867) comb. nov., L. moussoniana (Martens, 1867) comb. nov., L. schepmani (Möllendorff, 1897) comb. nov. and L. leucochila (Gude, 1905) comb. nov. are considered valid species of the genus Landouria for the first time. Plectotropis kraepelini Leschke, 1914 syn. nov. is considered a probable synonym of L. winteriana (Pfeiffer, 1842), P. trichotrochium Möllendorff, 1897 syn. nov. is a synonym of L. epiplatia (Möllendorff, 1897) and the preoccupied name Helix squamulosa Martens, 1867 syn. nov. is a synonym of L. madurensis sp. nov. We estimate that there are actually more than fifty species of Landouria in Java because many shell samples could not be classified and because no material is available from several regions of the island. A molecular phylogeny reveals that the species from Java do not form a monophyletic group, but that at least one species from Timor is nested within Javanese clades. This means that the Oriental Landouria crossed Wallace’s line, the supposed border between the Oriental and Australo-Papuan regions, at least twice and supports the conclusion that Wallace’s line does not represent a more severe barrier for terrestrial organisms than other straits through the archipelago. Within the Javanese clades, species from western and eastern Java are mixed, indicating frequent dispersals also within Java."}