{"doi": "https://doi.org/10.1016/j.fsi.2019.06.061", "year": 2019, "abstract": "The aim of this study was to determine the in vitro probiotic properties as well as the immunomodulatory activity of bacterial strains isolated from the gastrointestinal tract of the edible-farmed land snail Cornu aspersum maxima. Forty lactic acid bacterial strains (named Sgs1-40) were isolated from the intestinal tract and eight strains (named SgmA-H) from the oesophagus-crop of snails. Several criteria were used to examine whether they may be applied as snail-specific for the screening of the presumptive probiotic bacterial strains. Principal Component Analysis using criteria such as the tolerance of these strains to the pedal mucus, gastric mucus, gastric juices and low pH, as well as the expression of the cell surface traits of hydrophobicity, biofilm formation and autoaggregation capacity revealed discrimination of twelve strains exhibiting presumptive in vitro probiotic properties. Injection of eight of these strains, which were identified as Lactobacillus plantarum, in snail haemocoel increased the recruitment and phagocytic activity of amoebocytes in snail haemolymph. The Sgs14 and SgmB strains, exhibiting the highest immunostimulatory activity in haemolymph, were FITC-labelled and orally administrated to snails for ten days. The Sgs14 strain was able to adhere to intestinal mucosa of snails and stimulate the chemotactic and phagocytic activity of amoebocytes in haemolymph as well as the bactericidal activity of haemolymph serum. These responses are potentially mediated by the regulation of TLRs expression in the gut mucosa. These data indicate that the determination of properties such as snail mucus and gastric juice tolerance, cell surface traits for adhesion as well as increased chemotactic and phagocytic activity in snail haemolymph are eligible criteria to screen for snail-specific probiotics. To the best of our knowledge, this is the first work that investigates the probiotic properties of gastrointestinal microflora of the terrestrial farmed snail Cornu aspersum maxima."}