{"doi": "https://doi.org/10.1016/j.palaeo.2019.109236", "year": 2019, "abstract": "The stable oxygen and carbon isotope composition (δ18Oshell and δ13Cshell) of land snail shells preserved in Chinese eolian loess deposits have the potential to reconstruct past changes in the East Asian Summer Monsoon (EASM) since the late Oligocene. To assess the potential of δ18Oshell and δ13Cshell for the semi-quantitative reconstruction of past variations of the EASM, we studied modern snails and the corresponding vegetation composition of three distinct ecosystems (woodland, grassland and mountains), spanning a large rainfall gradient (178–1403 mm) in the mid-latitude East Asian monsoon region. The results show that different snail species in the three ecosystems have significantly different values of δ18Oshell and δ13Cshell. The snails in woodland from the eastern plain area have significantly lower δ18Oshell and δ13Cshell values than those of snails in grassland from the Chinese Loess Plateau, and the snails from the Qinba Mountains region have values intermediate between the two. Systematic variations of the δ13C of snail shells, body tissues and local plants are evident along the rainfall gradient, indicating that δ13Cshell is mainly influenced by the δ13C of ingested plants, which is controlled by the EASM. We confirm that δ13Cshell is a reliable precipitation proxy and we obtained a new empirical equation (δ13Cshell = −0.0030(±0.0003) MAP − 8.80(±0.32), r = −0.76, n = 74, p < 0.001) for the relationship between δ13Cshell and mean annual precipitation, which is based on the results of the present study, together with those of Bao et al. (2018). We infer that δ18Oshell is influenced by precipitation δ18O, and that here is a significant relationship between δ18Oshell and mean annual precipitation (δ18Oshell = −0.0028(±0.0008) MAP − 1.32(±0.58), r = −0.65, p < 0.05, n = 21), possibly because of the rainfall amount effect in the study region. In addition, temperature and evaporation associated with relative humidity play non-negligible roles in determining δ18Oshell, and their effects should be considered before using the δ18O of fossil snail shells to reconstruct precipitation δ18O and/or rainfall amount."}