{"doi": "https://doi.org/10.1016/j.ympev.2019.106570", "year": 2019, "abstract": "The subfamily Leptaxinae is included within the highly diverse land snail family Hygromiidae. In the absence of clear diagnostic morphological differences, the subfamily status is currently based solely on molecular information and includes three disjunctly distributed tribes, Leptaxini, Cryptosaccini and Metafruticicolini. However, the phylogenetic relationships among these tribes are not fully resolved and the clustering of some of the genera to the tribes is not statistically supported. To resolve the relationships within Leptaxinae and their position within Hygromiidae, we reconstructed their phylogeny using a multi-locus approach with two mitochondrial genes and eight nuclear markers. The phylogeny was further calibrated and an analysis of ancestral area estimation was carried out to infer the biogeographic history of the group. We elevated Metafruticicolini to subfamily level (Metafruticicolinae) and we restricted Leptaxinae to Cryptosaccini and Leptaxini. The Lusitanian genus Portugala was moved to Leptaxini, previously containing only the Macaronesian genus Leptaxis. Within Cryptosaccini, a new genus strictly confined to the Sierra de la Cabrera (Spain) is described, Fractanella gen. nov. According to our results, Leptaxinae originated in the Early Miocene in the Iberian Peninsula, from which the Macaronesian Islands were colonized. Due to the old split recovered for the divergence between Macaronesian and Iberian lineages, we hypothesize that this colonization may have occurred via the once emerged seamounts located between the archipelagos and the European and African continents, although this could also have occurred through the oldest now emerged islands of Macaronesia. In the Iberian Peninsula, the climatic shift that began during the Middle Miocene, changing progressively from subtropical climate towards the present-day Mediterranean climate, was identified as an important factor shaping the subfamily's diversification, along with Pleistocene climatic fluctuations."}