{"doi": "https://doi.org/10.9734/ajrb/2019/v4i430077", "year": 2019, "abstract": "This study investigated the concentrations of heavy metals (As, Cd, Cr, Cu, Hg and Pb) in African Giant Land Snail (AGLS) treated with different soil samples dumpsite (A), mining site (B) and control soil (C) (a reserve area where no activities) use in farming AGLS and also to ascertain if they are within permissible limits and its ecological risk assessment on the consumption. Soil samples; at site A, B and C was collected at 0-30 cm depth with the aid of soil auger and were used for AGLS farming, to ascertain whether the potentially toxic elements (PTEs) concentration were within the permissible limits and their ecological risk assessment on AGLS consumption. A total of 54 juvenile snails of similar weights was used for the study. The experiment lasted for six month (182 days), during which the snails were subjected to similar dietary reign and equal quantity of feed. Snail’s morphological characteristics such as Weight, length and diameter of its shell were measured after farming. The soil samples were analysed for PTEs before and after farming, and snail were also analyzed for PTEs after farming for six month using atomic absorptions spectrophotometer (AAS). The ecological health risk from the consumption of these snails was assessed using standard methods and formulas. The result of different soil before and after farming shows a significant different (P&lt;0.05) between the activities sites (dump and mining) and the control site. The concentration of PTEs (As, Cd, Cr, Cu, Hg, and Pb) in snails treated with dump site soil were 3.05, 3.89, 3.60, 2.89, 3.98, and 2.55 mg/kg, and snails treated with mining site soil recorded 2.73, 2.74, 3.91, 4.96, 2.88 and 4.82 mg/kg. The values were greater than the maximum permissible limit of 0.5, 2.0, 0.3, 0.04, 0.1 and 0.1 mg/kg respectively recommended by FAO/WHO compared to the control. The study concludes that snail bioaccumulate toxic elements from the soil used in rearing them which is deleterious to humans when consumed. Also the DIM, HQ, HI on the consumption of snail reared with dumpsite, mining site soils are nearly free of risks, but continuous consumption can lead to bioaccumulation in the food chain."}