{"doi": "https://doi.org/10.15517/rbt.v67i6.36201", "year": 2019, "abstract": "Abstract. Introduction: Ecology and natural history of neotropical land snails is almost unknown. Objetive: In this paper I analyse the population dynamics of Tikoconus (Tikoconus) costarricanus Barrientos, in prep., an understory endemic euconulid. Methods: I compared T. costarricanus’ demography patterns in tropical montane forests in central Costa Rica in three habitats with different restoration techniques: a mature forest, a secondary forest and a Cuppressus lusitanica plantation. I collected data in three month periods during a year. I analysed population size in relation with habitat, sampling date, leaf litter humidity, depth and quantity; and specimen size in relation with habitat and sampling date. I also kept some specimens in terraria and described part of their natural history. Results: The species is more abundant in mature forest (Ø = 0.174 ind/m2). The number of specimens in each habitat was constant throughout the year (Kruskall-Wallis = 2.0118, p = 0.57, NS) and hatching occurs in the middle and last months of the rainy season (Kruskall-Wallis = 17.3061, p = 0.00061, **). Number of specimens is related with leaf litter humidity (Spearman correlation, r = 0.3524, n = 232, p = 0.000, **), amount (Spearman correlation, r = 0.3922, n = 232, p = 0.000, **) and depth (Spearman correlation, r = 0.2543, n = 232, p = 0.000, **). This relationship is explained by the high and stable humid environment provided by leaf litter. During the drier months some specimens migrate from the foliage to the leaf litter. Eggs (Ø = 1mm) are laid on moss or soil and the young spend the first 2 or 3 weeks of their life on moss. Egg masses are small (Ø = 4 eggs), and shells look bubbly. Egg development time (20 days) was longer than in other tropical species. Adult pigmentation appears around two months after hatch. In the only case observed egg laying began 5 months after hatching and the specimen lived 9 months. Conclusions: Although no conclusive, these data point to a fragile species susceptible to habitat and climate change. Restorations techniques should consider leaf litter features in order to protect endemic neotropical humid dependent diversity."}