{"doi": "https://doi.org/10.25145/j.recaesin.2019.79.06", "year": 2019, "abstract": "espanolDesde finales del siglo XV al XVII, viajeros de diferentes paises europeos intentaron llegar a un continente austral desconocido, supuestamente situado en algun lugar entre las tierras africanas y americanas. Una de las narraciones mas populares sobre este continente en Inglaterra a finales del siglo XVII fue A New Discovery of Terra Incognita Australis, or the Southern World, de Gabriel de Foigny, publicada en 1693 por John Dunton y, de hecho, una traduccion de la version francesa de 1692. Aunque esta obra de la novela inglesa temprana es citada por varios estudiosos, se ha realizado poco trabajo critico sobre la version inglesa. En consecuencia, el objetivo de este articulo es sacar a la luz la relevancia de esta novela, por una parte, al considerar esta obra de ficcion dentro de la tradicion tanto de la literatura de viajes como de las novelas utopicas del siglo XVII en Inglaterra y, por otra, examinar aquellos elementos de la historia que pueden haber contribuido al establecimiento del emergente genero de la novela. EnglishFrom the late fifteenth century to the seventeenth century, travellers from different European countries tried to reach an unknown southern continent supposedly situated somewhere between the African and American lands. One of the most popular accounts dealing with this continent produced in England in the late seventeenth century was Gabriel de Foigny’s A New Discovery of Terra Incognita Australis, or the Southern World, published in 1693 by John Dunton, and, in fact, a translation from the 1692 French version. Although this piece of early prose fiction in English has been recorded by several scholars, little critical work has been done on the English version. Consequently, the aim of this paper is to bring to the light the relevance of this novel by, on the one hand, considering this fictional work within the tradition of both travel literature and utopian novels in seventeenth-century England and, on the other, exploring those elements in the story that may have contributed to the establishment of the budding genre of the novel."}