{"doi": "https://doi.org/10.17816/ecogen17415-26", "year": 2019, "abstract": "Using the polymorphic esterases loci, the genetic structure of the gastropod mollusk Fruticicola (Bradybaena) fruticum Мll., most of which lives in the south of the Central Russian Upland, was studied. For comparison, the samples were taken from the Romania, the North Caucasus, the Ural and the Vyatka regions. A total of the 1668 individuals were investigated. Of the 28 studied populations in 11 (39.3%), there was significant shortage of the heterozygotes. The level of the expected heterozygosity fluctuated in the range He = 0.1160.454. Using the non-parametric statistics (Chao1-bc method and 1st order jackknife method), the populations with potentially high and low diversity of the multilocus genotypes were identified. The indicators of the genetic disunity between populations averaged st = 0.276, Fst = 0.292. The principal component analysis and the Mantel correlation criterion Rм = 0.007 showed the absence of a reliable relationship between the geographical and genetic distance between populations, which indicates a violation of the isolation model by distance and confirms the thesis put forward by us that the urbanized forest-steppe landscape disrupts the natural migration processes, leads to the strong isolation and the genetic drift in the snail populations. At the same time, the phenomenon of increasing the degree of division of the populations against the background of reduced the allelic diversity, noted by us in many groups of bush snails, can be regarded as a shift in genetic equilibrium towards an increase in the interpopupulation diversity (according to the Wright model). The revealed absence of the effect of isolation by distance can be a consequence of the action of the stabilizing natural selection. The assumption of the dependence of the esterase alleles frequencies in the bush snail populations on the genetic (biochemical) characteristics of the food objects was proposed. The effective size, calculated using the Slatkin formula turned out to be comparable with the background, adventive and relict species of the terrestrial mollusks living in the study area (Ne = 2.27.6)."}