{"doi": "https://doi.org/10.1101/2019.12.16.877977", "year": 2019, "abstract": "Abstract The aim of this study was to determine the differences in the shell, radula and genital structures of 3 new invasive species, Achatina fulica Bowdich, 1822, Achatina albopicta E.A. Smith (1878) and Achatina reticulata Pfeiffer, 1845 collected from southwestern Nigeria and to determine features that would be of importance in the identification of these invasive species in Nigeria. This is the first report of Achatina albopicta and A. reticulata in Nigeria, but Achatina fulica have since been reported in Nigeria and other African countries outside coastal East Africa. No study has described the external or internal morphology of any of the invasive species in Nigeria. Five to ten live specimens of each species, with complete shell characters, of each species were used for this study. Vernier caliper was used to obtain all shell measurements, with the shell held vertically and the aperture facing the observer. The genital structures were dissected out and fixed in 70% alcohol for 10-15 minutes and examined. The buccal mass was dissected out and digested in 7.5% sodium hydroxide for 24 hrs to free the radula from snail tissues and then examined under the compound microscope. The shells of the 3 new species were dextral, conical with pointed spire and narrow apex. The whorls were separated by deep sutures. The parietal walls and the columella of the three species were white but columella of A. reticulata had a characteristic thick deposit of white porcelain-like material. There were dark brown markings on the whorls of the three species on dirty brown background for A. fulica and A. reticulata and dirty yellowish background for A. albopicta . The shell of A. albopicta was slightly glossy on the body whorl. The whorls of A. albopicta were much more convex than the whorls of A. fulica and A. reticulata . The columella of A. albopicta was truncate above the base of the peristome, moderately concave and slightly curved up at the base, while the columella of A. fulica was truncate sharply at the base of the peristome and straight and the columella of A. reticulata was slantly truncate at the base of the peristome and straight. The genitalia of the three species were very identical but differed slightly in the emergence of the basal vas deferens from the penis. The penes were slender and completely enclosed by the penial sheaths. The length of the penis varied from 10 to 12 mm. The vas deferens, free oviduct and the spermatheca duct were very long. The radula could be differentiated by the structure of central teeth and the first lateral tooth. The study showed that the shell morphology, radula and genital structures can be of importance in the identification of members of the family Achatinidae in Nigeria."}