{"doi": "https://doi.org/10.33310/2518-7813-2019-66-3-48-52", "year": 2019, "abstract": "The organization of field training in zoology in the territory of the hydrological reserve \"Salt Lake\" allows to active involve of students in the study of fauna with obtaining significant results. Based on the researches, students of biological specialties defended four diploma papers of the specialist, three master's theses and prepared dozens of course papers. Graduation works according to modern requirements carried out on the basing of their own materials, which requires mastering the skills of collecting, fixing, determining the types of invertebrates and vertebrates, as well as performing complex statistical processing of the obtained results using parametric and non-parametric statistics. There were following topics: «Features of external and internal morphology of Cepaea vindobonensis Ferussac 1821 land snail, from the adjoining territory of the Solonets-Tuzla lake», «Variability of the shell of Chondrula tridens land snail from the adjacent territory of the lake Solonets-Tuzla», «Common and rare species of animals on the territory of the Biloberezhya Sviatoslava National Park (Solonets-Tuzli Lake)», «Ornithofauna of the hydrological reserve of the state significance “Solt lake»\", «Interpopulation variability of the shell and genital apparatus of Cepaea vindobonensis Ferussac, 1821», «Conservation activity of NNP \"Biloberezhya Svyatoslava»», «Morphological features of molluscs of the Chondrula genus collected near the village of Rybakivka». Masters of the first year of the 2019-2020 academic year are working on two new topics: «Intra- and inter-population variability of the land snail Brephulopsis cylindrica from the Northern Black Sea coast region» та «Intra- and inter-population variability of some parts of the genital apparatus of the land snail Brephulopsis cylindrica from the Northern Black Sea coast region». Thus, the planned field training practice of zoology implemented according to the curriculum, which envisages the collection (removal) of representatives of fauna from nature. This approach allows to exploring the fauna of the uncharted territory that the conservation organization is interested in. Participation of students in the implementation of the state scientific theme motivates to research work, leads to awareness of involvement in nature conservation activities. Conditions for in-depth mastering of specialized competencies by biology students created in accordance with the provisions of the concept of development of pedagogical education. Researches, conducted on the territory, adjacent to Solonets-Tuzla Lake, have revealed dozens of species of invertebrates and vertebrates for which the territory considered as habitat."}