{"doi": "https://doi.org/10.1016/j.gca.2020.01.029", "year": 2020, "abstract": "The carbon and oxygen isotopic composition of land snail shells (δ13Cshell and δ18Oshell) has been used to reconstruct paleoenvironmental changes worldwide. Adding to the limited calibration information available for the monsoon marginal regions, we present δ13C and δ18O results for modern snails, plants and soils, collected from the Helan Mountains, in North China, spanning an altitudinal gradient of 1733–2851 m a.s.l. Linear regression analysis show that δ13Cshell is positively correlated with altitude on both slopes, with similar rates of altitudinal variation; in contrast, δ18Oshell is negatively correlated with altitude on the western slopes, but this effect is absent on the eastern slopes. The variations in the integrated δ13C signals of living vegetation and the flux of absorbed atmospheric CO2 attributed to changes in metabolic rates are likely responsible for the altitudinal effect on δ13Cshell above 2000 m a.s.l., while changes in vegetation type and/or carbonate ingestion by snails may be important in inducing the positive shift in δ13Cshell below 2000 m a.s.l. δ18Oshell is determined by the rainwater δ18O and by the fractionation processes between shell carbonate and snail body water, and both are controlled by the temperature of the alpine environment. In addition, evaporative enrichment of the body fluid or of the environmental water prior to ingestion by snails exerts an important influence on δ18Oshell. Notably, both δ13Cshell and δ18Oshell in the study region respond more sensitively to climate than in the monsoon core area. The rate of change of δ13Cshell in response to temperature and precipitation above the altitude of 2000 m a.s.l. are −0.87‰/°C and +2.76‰/100 mm, while the corresponding rates for δ18Oshell on the western slopes are +0.41‰/°C and −1.29‰/100 mm. Our results expand the range of application of δ13Cshell and δ18Oshell as climatic indicators, and emphasize the differences in the climatic sensitivity of these proxies between the monsoon margin and core areas. In addition, the differences in shell isotope composition in response to environment changes between adjacent locations (i.e. on different slopes) in mountainous terrain need to be considered in future studies."}