{"doi": "https://doi.org/10.1016/j.palaeo.2020.109654", "year": 2020, "abstract": "It has long been known that many terrestrial snail shells are subject to the so-called “limestone effect”. However, the magnitude and impact of this effect on the δ13C values of snail shells and soft body tissue (δ13Cshell and δ13Cbody) are still unknown. In this study, Achatina fulica snails were hatched and cultured under controlled conditions and supplied with 14C-free calcium carbonate and lettuce (a C3 plant) as a calcium source and food supply, respectively. The snail shells and soft body tissues were sampled monthly for 5 months, and δ13C and radiocarbon dating analyses were conducted to trace carbon source variations at different growth stages. Our results show that the apparent 14C age of the shells and the corresponding δ13Cshell values increased progressively from the 1st to 3rd months and subsequently decreased during the 4th and 5th months. The results demonstrate for the first time that carbonate ingestion has a straightforward influence on the 14C ages and δ13C values of shells and that the “limestone effect” changes over the lifetime of snails. Moreover, the apparent 14C ages of snails sampled in the field are older than modern ages when taken from the northern carbonate region and relatively young or the same as modern ages when collected from ferralic soils. This further supports our findings from cultured snails and suggests that snail shells are good archives for radiocarbon dating purposes in southern China. Although the δ13C values of the soft body tissues of cultured snails vary synchronously with those of the shell, this seemingly common phenomenon cannot be easily explained by carbonate ingestion, as the snail bodies are of more recent origin than the shells. Atmospheric CO2 may be another candidate explaining the synchronicity between δ13Cshell and δ13Cbody, as well as the F 14C variations of snail bodies. However, it is still unclear how snails differentially incorporate carbon from different sources (e.g., carbonate and atmospheric CO2) at different growth stages, since carbon from different sources is combined in the bicarbonate pool in the hemolymph before being used by snails."}