{"doi": "https://doi.org/10.1051/parasite/2020012", "year": 2020, "abstract": "The edible land snail Cornu aspersum, native to the Mediterranean coastlines of North Africa, is widely distributed on most continents and often invasive in areas where introduction is recent. This species could contribute to the geographic spread of parasites as demonstrated for Brachylaima spp. These cosmopolitan trematodes may represent a threat to human health, like in Australia where Brachylaima cribbi infects humans. In this study, we demonstrate for the first time the occurrence of Brachylaima spp. in two French populations of C. aspersum, Thorigné-Fouillard (Ille-et-Vilaine), and Arçais (Deux-Sèvres), with an overall prevalence of 10.4% (Thorigné-Fouillard) and 73.3% (Arçais), respectively and a metacercarial intensity on average three times higher in Thorigné-Fouillard (37) than in Arçais (11). Cornu aspersum may act as a first and second intermediate host, as demonstrated in Arçais. The morphometrics of metacercariae, particularly the great body length about 2 mm, discriminate our Brachylaima species from those already described in C. aspersum (B. cribbi in Australia, and B. aspersae, B. llobregatensis and B. mascomai in Europe). Molecular analysis, based on 28S and COI, suggests the occurrence of two species in our study, one of which is probably Brachylaima mesostoma, an intestinal parasite of passeriform birds described in Central Europe. We underline the need for further research to identify species of Brachylaima in France and measure the health hazard of consuming field-collected snails.Brachylaima spp. (Trematoda) parasitant Cornu aspersum (Gastropoda) en France et risque potentiel pour la consommation humaine.L’escargot Cornu aspersum, originaire des côtes méditerranéennes d’Afrique du Nord, est largement répandu sur la plupart des continents et souvent invasif dans ses aires d’introduction récente. Cette espèce peut contribuer à l’expansion géographique de parasites comme démontré pour Brachylaima spp. Ces trématodes cosmopolites peuvent représenter une menace pour la santé comme en Australie où Brachylaima cribbi parasite l’espèce humaine. Dans cette étude, nous démontrons pour la première fois la présence de Brachylaima spp. dans deux populations françaises de C. aspersum, à Thorigné-Fouillard (Ille-et-Vilaine) et Arçais (Deux-Sèvres), avec une prévalence totale de 10.4 % (Thorigné-Fouillard) et 73.3 % (Arçais), et une intensité de métacercaires en moyenne trois fois plus importante à Thorigné-Fouillard (37) qu’à Arçais (11). Cornu aspersum peut jouer le rôle de premier et de second hôte intermédiaire, comme démontré à Arçais. La morphométrie des métacercaires, en particulier la grande taille corporelle d’environ 2 mm de long, suggèrent qu’il ne s’agit pas d’espèces de Brachylaima déjà décrites chez C. aspersum (B. cribbi en Australie et B. aspersae, B. llobregatensis et B. mascomai en Europe). L’analyse moléculaire, basée sur 28S et COI, suggère la présence de deux espèces dans notre étude, dont l’une est probablement Brachylaima mesostoma, un parasite intestinal d’oiseaux passeriformes décrit en Europe Centrale. Nous soulignons le besoin de recherche future pour identifier les espèces de Brachylaima présentes en France et mesurer le risque associé à la consommation d’escargots terrestres prélevés en milieu naturel."}