{"doi": "https://doi.org/10.1016/j.vetpar.2020.109123", "year": 2020, "abstract": "Troglostrongylus brevior, a lungworm affecting wild felids, has been increasingly reported in domestic cats from Europe. Troglostrongylosis is a relevant disease that may result in a potentially life-threatening bronchopneumonia, especially in kittens. The life cycle of T. brevior is indirect with terrestrial gastropods acting as intermediate host. The widely distributed spread land snail Cornu aspersum (former Helix aspersa) is competent for T. brevior development and may transmit the nematode in natural conditions. The present study evaluated the larval development of T. brevior in C. aspersum at two different environmental temperature conditions, with a focus on the effect of hibernation. One hundred and seventy snails were infected with 500 first stage larvae (L1) of T. brevior and kept in vivaria at 25 ± 2 °C. Fifteen days post infection (p.i.), 20 specimens were digested to evaluate the overall larval developmental rate from L1 to L3 (2.5 % on days 15 p.i.) and then the snails were divided in two groups, i.e. G1 kept at 25 ± 2 °C and G2 that were hibernated at 4 ± 2 °C. The developmental rate of T. brevior was evaluated in these groups on 30 and 60 days p.i. by snail digestion at each time-point. An additional batch of 40 snails (G2-1) was hibernated on D15 and digested on D60. Larvae recovered were morphologically and morphometrically examined. The infective third larval stage (L3) was detected in the muscular foot of C. aspersum at different rates depending on the environmental temperature. In particular, T. brevior showed a higher developmental rate in hibernated snails (G2: 6.9 % and 14.1 % on days 30 and 60 p.i; G2-1: 4%; G2 + G2-1 overall mean percentage: 9%) compared to non-hibernated snails (G1: 4% and 5.2 % on days 30 and 60 p.i.), indicating that lower temperatures may positively influence the developmental in C. aspersum. These data are suggestive for a seasonal pattern of T. brevior infections under field conditions, with snails containing higher parasitic burdens after their natural hibernation occurring in winter. Studies on the larval development of T. brevior in other mollusc species in field surveys evaluating differences in developmental rates and transmission patterns in different seasons are warranted."}