{"doi": "https://doi.org/10.1016/j.ecoenv.2020.110565", "year": 2020, "abstract": "The aim of the present work was to study the effect of the pyrethroid cypermethrin (CYP) on the non-target freshwater snail Chilina parchappi. Initially, the sensitivity of adult snails to CYP was evaluated via the 96-h LC50 test. Then, snails were exposed to subtethal CYP concentrations (0.1 and 10 mg/l) for 1, 4 and 10 days and the digestive glands were dissected for biomarkers analyses. Enzymatic activity of catalase (CAT), glutathione peroxidase (GPx) and glutathione-S-transferase (GST), as well as total glutathione reduced (GSH) levels, were determined. Histological analyses of morphology, intracellular accumulation of lipofucsins and neutral lipids accumulation in the digestive gland were also evaluated. As compared to other molluscs, C. parchappi showed high resistance to CYP exposure evidenced by the 96-h LC50 value (44.59 mg/l). Snails exposed to sublethal CYP concentrations showed a statistically significant increase (p < 0.01) in GST (79–116%) and GPx (45–190%) activities with respect to controls. However, CAT activity showed a tendency to decrease with CYP treatment but was not statistically significantly different compared to control. Only high CYP concentration caused a statistically significant increase (p < 0.01) in GSH content (95–196%). There was evidence of structural changes in the digestive gland of snails exposed to CYP, showing a dose-dependent response. In exposed snails, some of the main symptoms included a reduction in the thickness of the epithelium, vacuolisation of the digestive cells and an increase in the number of excretory cells. Accumulation of lipofuscins (933–1006%) and neutral lipids (403%) were statistically significantly higher (p < 0.05) in snails exposed to CYP compared to control. This study showed that C. parchappii is quite tolerant to CYP exposure and that at sublethal concentrations, GSH metabolism could play a protective role against the pesticide harm in snails. Therefore, it would be interesting to study the response of this organism to other environmental stressors to assess its potential use in monitoring programs."}