{"doi": "https://doi.org/10.1016/j.quascirev.2020.106579", "year": 2020, "abstract": "Reconstructing and quantifying human impacts is an important step in understanding how, when, and to what extent humans have changed terrestrial ecosystems via agricultural land use during the Holocene. However, the use of soil-faunal indicators and an associated quantitative model of land use intensity to study anthropogenic disturbance is relatively poorly developed. In this study we collected 139 samples of soil-dwelling snails from urban land and human settlements, cultivated land, modified and natural vegetation mosaics, and natural habitats in northern China, in order to characterize the snail assemblages in human-modified habitats. The results show that cultivated land and planted forest are mainly dominated by snails of Cathaica fasiola, Bradybaena ravida, Vallonia tenera, etc., while natural habitats are characterized by an even distribution of members of the families, such as Ariophantidae, Cochlicopidae, Pupillidae, Subulinidae. Canonical correspondence analysis indicates that human activity (quantified by the human influence index, HII) is one of the most important factors shaping the composition of snail fauna in man-modified habitats. There is a significant relationship between modern snail data and HII, and the transfer function established by weighted-averaging partial least squares (WA-PLS) model for HII exhibits a good statistical performance. We then applied the calibration model to a fossil snail record spanning the last 12 kyr from the Chinese Loess Plateau (CLP). The reconstructed HII increases slightly at ∼5 ka and abruptly at ∼2 ka, coinciding with increases in the human population of the CLP, local cultural development, and human-induced changes in vegetation cover. Our quantitative reconstruction indicates that human activities, via agricultural activity, may have permanently altered natural ecosystems and the soil fauna for at least the last two millennia."}