{"doi": "https://doi.org/10.21521/mw.6463", "year": 2020, "abstract": "Ascorbic acid (Vit. C) is essential for the proper functioning of the human body. Humans are unable to synthesize vitamin C endogenously, so it must be supplied with food. The available literature does not provide any data on the content of vitamin C in the meat of snails. The aim of the study was therefore to determine and compare its content in the edible parts of snails obtained in Poland. The research material consisted of 30 samples of snail meat (the foot with the collar and a fragment of the coat) belonging to three species: Helix pomatia, Cornu aspersum aspersum, and Cornu aspersum maxima. Helix pomatia snails were obtained from the natural environment, while the other two species came from commercial breeding farms. Ascorbic acid was determined by the method of Roe and Kuethner, as modified by Dabrowski and Hinterleitner (1989). Previously, tissues for biochemical analysis were prepared according to the methodology described by Zannoni et al. (1974). The average level of vitamin C in the edible parts of particular snail species ranged from 38.14 mg/kg (Helix pomatia) to 185.38 mg/kg (Cornu apsersum aspersum). Statistically significant differences in the level of ascorbic acid were found between all species of snails examined. The highest vitamin C content was found in the meat of Cornu aspersum aspersum. The lowest level of ascrobic acid occurred in the meat of Helix pomatia, in which it was 20.41% and 37.04% of the levels found in the meat of Cornu aspersum aspersum and Cornu aspersum maxima, respectively. The present research showed a significantly higher content of ascorbic acid in snails of the Cornu genus kept in heliculture as compared to free-living snails (Helix pomatia). Moreover, the content of ascorbic acid in the edible parts of snails is higher than it is in pork and beef meat. The present study showed that snails from the Cornu genus can be an additional valuable source of vitamin C in the human diet."}