{"doi": "https://doi.org/10.1371/journal.pone.0234830", "year": 2020, "abstract": "Residential yards constitute a substantive biodiverse greenspace within urban areas. This biodiversity results from a combination of native and non-native species and can contribute to biotic homogenization. Geographical climatic patterns affect the distribution of native species and may differently affect non-native species. In this study, we examined biodiversity and biotic homogenization patterns of yard-dwelling land snails across 12 towns in Oklahoma and Kansas (USA). The 3 x 4 array of towns incorporated a N-S winter temperature gradient (mean low January temperature range = -8.4 to 0.1°C) and an E-W annual rainfall gradient (annual rainfall range = 113.8 to 61.3 cm/yr). Ten yards per town were surveyed. We hypothesized that mild winter temperatures and greater annual rainfall would be associated with greater snail abundance and richness, and that the presence of non-native species would contribute to biotic homogenization. Non-native snails were present and often abundant in all towns. Snail communities varied with both rainfall and cold temperature. Contrary to our prediction, snail abundance was inversely related to annual rainfall-likely because drier conditions resulted in greater yard watering that both augmented rainfall and maintained moist conditions. Sørensen similarity between towns for the entire land snail community and for only non-native species both showed distance-decay patterns, with snail composition becoming less similar with increasing distance-patterns resulting from species turnover. The biotic homogenization index also showed a distance-related pattern, such that closer towns were more likely to have biotic homogenization whereas more distant towns tended to have biotic differentiation. These results support the concept that biotic homogenization is more likely regionally and that climatic changes over distance result in species turnover and can reduce spatially broad biotic homogenization."}