{"doi": "https://doi.org/10.1016/j.ympev.2020.106999", "year": 2021, "abstract": "East Asia has highly diverse and endemic biota due to its complex geological and climatic history and its diversified topography. The continental and insular distributions of land snail genus Acusta in East Asia provide a good opportunity to compare the evolutionary processes in this group under different biogeographical conditions. In this study, we inferred the evolutionary history of the land snail genus Acusta by a molecular phylogeny and investigated how the palaeogeographic events shaped species diversity and the distribution of the Acusta genus within the island arc. A concatenated dataset generated from sequences of one nuclear (ITS2) and two mitochondrial (16S, COI) gene fragments, include most of nominal taxa of the genus, four related species and one outgroup. We constructed the phylogeny and the evolutionary history of the genus through maximum-likelihood and Bayesian inference methods, using a Bayesian molecular clock and ancestral range estimation. Our results suggested that currently recognized species in Acusta are polyphyletic. The traditionally accepted concept of the affinity of Acusta and Bradybaena is not supported. The hypothesis of colonization via land bridges during the Pleistocene glaciations for the biota of East Asian islands is not supported. Instead, the origin and diversification of the genus Acusta was dated to the late Miocene–Pliocene from an area around North and Northeast China to South China and East Asian islands Three major evolutionary lineages were identified. Two of the major lineages demonstrate distinct evolutionary histories, as sympatric speciation is the major speciation process for the continental clade, while the insular clade originated from founder events. Taiwan functioned as an important source of diversification for species on the East Asian islands possibly through passive dispersal of different mechanisms. The sea level fluctuations caused by the Pleistocene glacial cycles play a role in the subsequent dispersion and diversification of species of the continental clade, such as the more recent range expansion of A. redfieldi from South China to Taiwan and Japan."}