{"doi": "https://doi.org/10.15421/2020_215", "year": 2020, "abstract": "The main goal of this paper was to analyze intrapopulation variation of both morphological traits and shell banding polymorphism using the example of a continuous population (a metapopulation) of the land snail Cepaea vindobonensis (Férussac, 1821). A total of 14 samples of the land snail C. vindobonensis from a population located in the “Dubki” Park (Ukraine, Mykolayiv) were collected in May-July 2007. The land snail collection sites are divided into three areas by buildings and asphalt roads, indicated by the Latin letters A, B and C. The major diameter of shell (MJD), the minor diameter of shell (MID) and the shell height (SH) were measured with a digital calliper to the nearest 0.05 mm. Two shell shape indices (SF1 and SF2) were also computed. A high level of the intrapopulation variation of the land snail C. vindobonensis was found in our study. Significant differences between sample means were found for all shell traits and indices used (except for SF1), however, maximum difference was noted for SH and SF2 (in both cases: P ≤ 0.001). About 80% of the total variation of the variance-covariance matrix was explained by the 1st and 2nd Principal Components (PC1 and PC2). The PC1 was characterized by high positive factor loadings of MJD, MID and SH and thus can be interpreted as “shell size dimension” and the PC2 had a high correlation with SF2 and thus it can be interpreted as “shell globularity”. The PC1 and PC2 determined a high level of spatial differentiation of intrapopulation morphological variation of the land snail C. vindobonensis. Samples with small (area A) and large (areas B and C) shells were separated from each other according to the PC1. Areas B and C were characterized by individuals with flatness and globularity shells, respectively. The areas A, B and C differed significantly in the total number of morphs, average number of morphs and frequency of rare morphs (Kruskal-Wallis H-test; in all cases P ≤ 0.010). At the same time, the highest value of phenetic diversity was noted for samples collected within A and C areas. In general all phenetic diversity estimators showed a positive correlation with sample size (Spearman's correlation coefficient; in all cases P ≤ 0.05). It was found that the type of biotope did not likely affect the frequency of individual morphs with respect to the shell banding polymorphism pattern. With regard to the most common morphs two patterns of the spatial arrangement of the intrapopulation variation were found – clinal pattern was for the frequency of pallescens morph and chaotic pattern was for frequency of “12345” morph."}