{"doi": "https://doi.org/10.21608/ajs.2020.46604.1280", "year": 2020, "abstract": "This study was carried out to clarifyThe beneficial and safe use of the Eobania vermiculata, which is considered an agricultural pest, to improve the attractiveness and consumption of Rattus norvegicus for baits by adding it to the bait alone or mixed with other materials, as it is an available method, cheap and easy to obtain and use, which ultimately leads to the use of less than rats pesticides in baits, thus increasing the safety ratio for other organisms. the effect of adding Eobania vermiculata ground to improve the properties of baits used against different ages of Rattus norvegicus (immature males and females, mature males and females, pregnant and lactating females). Obtained results confirmed that this addition of ground snail had a clear and effective effect on the attractiveness of the bait for all tested ages as the number of visits and the time spent next to the baits were increased. Different concentrations (10, 15 and 20%) of grinded E. vermiculata were mixed with the formulated feed of R. norvegicus. Our results showed that there was a positive relationship between the increasing in concentration and the amount of bait consumption by all tested ages. The effect of 4-ethyl phenol and E. vermiculata on the properties of rat's baits was compared. The higher effect on attractiveness was recorded for 4-ethyl phenol, but the mature male and female of R. norvegicus rats preferred feeding more on the snail baits. Formulated feed baits with 20% E. vermiculata ground were mixed with 1 and 2.5% of 4-ethyl phenol, this led to positive results as the amount of food consumed increased compared to the control, but when the concentration of this substance increased to 5%, this led to decreasing in consumption from baits for male and female individuals. An analysis was made of some of the chemical components of E. vermiculata, and it was found that it contains large amounts of protein, carbohydrates, sugars and calcium."}