{"doi": "https://doi.org/10.24925/turjaf.v9i1.166-171.3777", "year": 2021, "abstract": "In this study, the hypometabolism behavior, epiphragm formation process, and the mineral composition of the epiphragmal structure of the Helix pomacella, Eobania vermiculata, Helix melanostoma, and Helix asemnis land snails were investigated during the hibernation period. 100 snails selected among mature individuals, 25 from each species, were collected from nature for the research. The snails were placed in four 50x50x5 cm pans containing 20-cm-deep humus soil. Snails were fed with lettuce by free feeding until the hibernation period. Hypometabolism behavior of snails that had hibernated between November and December 2018, and January and February 2019 were examined as entering the hibernation stage, hibernation stage, and leaving the hibernation stage. The ionic concentration (Calcium, Iron, and Phosphorus) of the epiphragm layer formed during the hibernation process was analyzed, its formation duration, and its degradation at the end of the hibernation period were examined. In the study, it was determined that the weight before hibernation reduced by 18-22% in all examined species (H. pomacella, E. vermiculata, H. melanostoma, and H. asemnis). The highest values in terms of epiphragm formation duration (19±0.30 days), weight (0.41±0.26 g), and thickness (0.310±0.22 mm) were determined in H. asemnis. In terms of the ionic concentration, the highest Calcium level was determined in H. asemnis (29.96±0.12 mg/g) while the highest Phosphorus level (4.02±0.20 mg/g) was determined in E. vermiculata, and the highest Iron content was found in H. pomacella (19.50±0.33 mg/g). The degradation duration of the epiphragm layer at the end of hibernation was determined the longest in E. vermiculata (7 days) whereas the shortest in H. pomacella (3 days). As a result of the present research, it was seen that the epiphragm layer is important for snails in terms of a sustainable life cycle and that the ecological tolerances of snails depend on the epiphragmal structure."}