{"doi": "https://doi.org/10.26456/vtbio171", "year": 2020, "abstract": "Древесная улитка Arianta arbustorum, в последние десятилетия распространившаяся в центре Русской равнины, стала опасным вредителем сельского хозяйства. Заселяя природные биотопы, она вытесняет аборигенные виды как растений, так и моллюсков. Эффективные меры борьбы с A. arbustorum не разработаны. Даётся оценка жизнедеятельности водяной полёвки Arvicola amphibius по отношению к древесной улитке. Плотность A. arbustorum в саду около нор водяной полёвки 2433 экз/м2, а на удалении 5 метров от нор - 5231 экз/м2. Разница статистически достоверна. Показано, что поедание водяной полёвкой древесных улиток локально снижает их плотность. Водяная полёвка выступает как природный агент биологического контроля A. arbustorum, поддерживающий видовое многообразие в природе. Установлено, что осенью 65% всех взрослых A. arbustorum закапываются в землю, и уже недоступны для поедания водяными полёвками. Кормовые запасы водяной полёвки на зиму из моркови и картофеля обнаружены в 45 м от ближайшего огорода. The Wood snail Arianta arbustorum, which in recent decades has spread in the center of the Russian Plain, has become a dangerous pest of agriculture. Settling natural biotopes, it crowds out indigenous species of both plants and mollusks. Effective control measures against A. arbustorum have not been developed. Here we assess the activity of the water vole Arvicola amphibius in relation to the Wood snail. The density of A. arbustorum in the garden near the water vole burrows is 2433 ind./m2, while at a distance of 5 meters from the burrows it becomes 5231 ind./ m2. The difference is statistically significant. Water vole eating wood snails locally reduce their density. Voles thus act as a natural biological control agent of A. arbustorum, preserving species diversity. In the fall around 65% of A. arbustorum adults burrow into the ground and are no longer available for water voles. Winter fodder stocks of a Water vole with carrots and potatoes were found 45 m from the nearest garden."}