{"doi": "https://doi.org/10.1016/b978-0-12-821139-7.00023-4", "year": 2022, "abstract": "At least 4000 land snail species are known from the islands of the tropical and subtropical Pacific, and if New Guinea and New Zealand are included, the number is probably closer to 6000. Most of these species are single island or at least single archipelago endemics. The geographic origins of most lineages of these island land snails can be traced to Asia and Australasia. Rafting on terrestrial debris, transport by birds and being blown on the wind have all been suggested as mechanisms by which the first individuals dispersed from these regions to the oceanic islands of the central Pacific, most of which have never been connected to a continental land mass. The extraordinary numbers of species on many islands then arose via evolutionary diversification in situ. Much of the fauna, however, is now extinct, as a result of habitat destruction and predation by introduced invasive species. Yet there remain many species still to be discovered, although many of these will also already be extinct, only their shells remaining as records of past diversity. Conservation of the remaining living species of this immensely diverse fauna has focused primarily on some of the larger and more attractive species, notably the achatinelline tree snails in Hawaii, the partulid tree snails in French Polynesia, and the radiation of species of Mandarina in the Ogasawara Islands. Efforts have involved building small scale, predator-free reserves (exclosures) with suitable habitat in which snails are protected, and ex situ captive breeding to preserve species in the hope of their eventual release back into the wild. However, the prognosis is not good, and to understand fully the immense diversity of Pacific island land snails will yet require intensive and extensive survey work so that those species, as yet undiscovered but that will be lost from the wild, can at least be collected and preserved in museums for future generations to study and marvel at."}