{"doi": "https://doi.org/10.1002/ece3.7002", "year": 2021, "abstract": "Abstract In terrestrial snails, thermal selection acts on shell coloration. However, the biological relevance of small differences in the intensity of shell pigmentation and the associated thermodynamic, physiological, and evolutionary consequences for snail diversity within the course of environmental warming are still insufficiently understood. To relate temperature‐driven internal heating, protein and membrane integrity impairment, escape behavior, place of residence selection, water loss, and mortality, we used experimentally warmed open‐top chambers and field observations with a total of &gt;11,000 naturally or experimentally colored individuals of the highly polymorphic species Theba pisana (O.F. M ÜLLER , 1774). We show that solar radiation in their natural Mediterranean habitat in Southern France poses intensifying thermal stress on increasingly pigmented snails that cannot be compensated for by behavioral responses. Individuals of all morphs acted neither jointly nor actively competed in climbing behavior, but acted similarly regardless of neighbor pigmentation intensity. Consequently, dark morphs progressively suffered from high internal temperatures, oxidative stress, and a breakdown of the chaperone system. Concomitant with increasing water loss, mortality increased with more intense pigmentation under simulated global warming conditions. In parallel with an increase in mean ambient temperature of 1.34°C over the past 30 years, the mortality rate of pigmented individuals in the field is, currently, about 50% higher than that of white morphs. A further increase of 1.12°C, as experimentally simulated in our study, would elevate this rate by another 26%. For 34 T. pisana populations from locations that are up to 2.7°C warmer than our experimental site, we show that both the frequency of pigmented morphs and overall pigmentation intensity decrease with an increase in average summer temperatures. We therefore predict a continuing strong decline in the frequency of pigmented morphs and a decrease in overall pigmentation intensity with ongoing global change in areas with strong solar radiation."}