{"doi": "https://doi.org/10.1186/s12862-020-01741-1", "year": 2021, "abstract": "Abstract Background How land use shapes biodiversity and functional trait composition of animal communities is an important question and frequently addressed. Land-use intensification is associated with changes in abiotic and biotic conditions including environmental homogenization and may act as an environmental filter to shape the composition of species communities. Here, we investigated the responses of land snail assemblages to land-use intensity and abiotic soil conditions (pH, soil moisture), and analyzed their trait composition (shell size, number of offspring, light preference, humidity preference, inundation tolerance, and drought resistance). We characterized the species’ responses to land use to identify ‘winners’ (species that were more common on sites with high land-use intensity than expected) or ‘losers’ of land-use intensity (more common on plots with low land-use intensity) and their niche breadth. As a proxy for the environmental ‘niche breadth’ of each snail species, based on the conditions of the sites in which it occurred, we defined a 5-dimensional niche hypervolume. We then tested whether land-use responses and niches contribute to the species’ potential vulnerability suggested by the Red List status. Results Our results confirmed that the trait composition of snail communities was significantly altered by land-use intensity and abiotic conditions in both forests and grasslands. While only 4% of the species that occurred in forests were significant losers of intensive forest management, the proportion of losers in grasslands was much higher (21%). However, the species’ response to land-use intensity and soil conditions was largely independent of specific traits and the species’ Red List status (vulnerability). Instead, vulnerability was only mirrored in the species’ rarity and its niche hypervolume: threatened species were characterized by low occurrence in forests and low occurrence and abundance in grasslands and by a narrow niche quantified by land-use components and abiotic factors. Conclusion Land use and environmental responses of land snails were poorly predicted by specific traits or the species’ vulnerability, suggesting that it is important to consider complementary risks and multiple niche dimensions."}