{"doi": "https://doi.org/10.51791/njap.v47i6.2861", "year": 2021, "abstract": "Prediction of body weight using morphometric indices in giant African land snail (Achatina marginata) was studied for the three (3) agro-ecological zones in Imo State (Owerri, Okigwe and Orlu zones). One hundred and sixty (160) snails in Imo State were surveyed in course of this study. Data were generated through measurement of body weight, shell length, shell width, shell thickness, mouth length, weight of shell, weight of visceral, length of foot and thickness of foot. Data collected were subjected to regression analysis using SPSS statistical package. Results showed generally highly significant value (P&lt;0.01) R2 value and R-value across the zoness. Highly significant difference (P&lt;0.01) was observed in Owerri zone for the weight of shell, and the shell length. In Okigwe zone, only the weight of visceral showed a significant effect (P&lt;0.01), whereas, in Orlu zone also, the shell width, shell mouth length and foot thickness showed a significant effect (P&lt;0.01). The study therefore recommends that the linear model used, fits the data. Hence a comprehensive selection program for improvement of A. marginata in Imo State could be planned using the regressions coefficients obtained from the study. La prédiction du poids corporel à l'aide d'indices morphométriques chez l'escargot terrestre géant africain (Achatina marginata) a été étudiée pour les trois (3) zones agro-écologiques de l'État d'Imo (zones Owerri, Okigwe et Orlu). Cent soixante (160) escargots de l'État d'Imo ont été étudiés au cours de cette étude. Les données ont été générées en mesurant le poids corporel, la longueur de la coquille, la largeur de la coquille, l'épaisseur de la coquille, la longueur de la bouche, le poids de la coquille, le poids du viscéral, la longueur du pied et l'épaisseur du pied. Les données collectées ont été soumises à une analyse de régression à l'aide du progiciel statistique SPSS. Les résultats ont montré une valeur R2 et une valeur R généralement très significatives (P &lt;0,01) dans les zones. Une différence très significative (P &lt;0,01) a été observée dans la zone d'Owerri pour le poids de la coquille et la longueur de la coquille. Dans la zone Okigwe, seul le poids des viscéraux a montré un effet significatif (P&lt;0,01), alors que, dans la zone Orlu, la largeur de la coque, la longueur de la bouche de la coque et l'épaisseur du pied ont également montré un effet significatif (P &lt;0,01) que le modèle linéaire utilisé, ajuste les données. Par conséquent, un programme de sélection complet pour l'amélioration d'A. Marginata dans l'État de l'Imo pourrait être planifié en utilisant les coefficients de régression obtenus à partir de l'étude."}