{"doi": "https://doi.org/10.51791/njap.v47i5.1267", "year": 2020, "abstract": "The albumen gland is a vital part of visceral mass of giant African land snail (GALS) and its very rich in nutrients. As with other parts of snails, its composition is influenced by diet, location, age and species. The chemical compositions of albumen gland of GALS across the south western states of Nigeria have not been evaluated despite their diverse climatic conditions. Three hundred and sixty (360) Archachatina marginata were obtained from six south west states (60 snails/ state) and the albumen gland samples were analyzed for their proximate composition (crude protein, fat, ash, fibre and carbohydrate), minerals content (K+, Ca2+, P, Na+, Mg2+, Cl-, Fe2+), anti-nutrients and vitamins composition. The crude protein of the gland ranged between 12.93% and 24.40% with Ekiti state recording the highest value and Osun the least. The fat content was low (1.14%-2.29%) and no fibre was detected in the albumen gland. Snails from Ekiti and Ondo states had significantly higher Ca2+, P and Mg2+ than other states. No Vitamin C was detected in the gland across the states while Vitamin A values ranged from 38.68 (Lagos) to 45.51 (Ondo). Least anti-nutrient concentrations were recorded by snails from Ondo and Ekiti states, while Lagos state recorded the highest (except flavonoid and oxalate). Albumen glands of snails from Ekiti and Ondo states are thus more nutritious than that from other states and can be safely consumed by both man and farm animals. La glande albumen est une partie vitale de la masse viscérale de l'escargot terrestre géant africain (le 'GALS') et elle est très riche en nutriments. Comme pour d'autres parties d'escargots, sa composition est influencée par le régime alimentaire, l'emplacement, l'âge et l'espèce. Les compositions chimiques de la glande albumine de 'GALS' dans les États du sudouest du Nigéria n'ont pas été évaluées malgré leurs conditions climatiques diverses. Trois cent soixante (360) Archachatinamarginata ont été obtenus de six états du sud-ouest (60 escargots / état) et les échantillons de glande albumen ont été analysés pour leur composition immédiate (protéines brutes, graisses, cendres, fibres et glucides), teneur en minéraux (K+, Ca2+, P, Na+, Mg2+, Cl-, Fe2+), composition anti-nutriments et vitamines. La protéine brute de la glande variait entre 12,93% et 24,40%, l'état d'Ekiti enregistrant la valeur la plus élevée et Osun le moins. La teneur en matières grasses était faible (1,14% -2,29%) et aucune fibre n'a été détectée dans l'albumen. Les escargots des états d'Ekiti et d'Ondo avaient des Ca2+, P et Mg2+ significativement plus élevés que les autres états. Aucune vitamine C n'a été détectée dans la glande à travers les États alors que les valeurs de vitamine A variaient de 38,68 (Lagos) à 45,51 (Ondo). Les plus faibles concentrations d'anti-nutriments ont été enregistrées par les escargots des états d'Ondo et d'Ekiti, tandis que l'état de Lagos a enregistré les plus élevées (sauf les flavonoïdes et l'oxalate). Les glandes d'albumen des escargots des états d'Ekiti et d'Ondo sont donc plus nutritives que celles des autres états et peuvent être consommées en toute sécurité par l'homme et les animaux de ferme."}