{"doi": "https://doi.org/10.51791/njap.v47i5.1280", "year": 2020, "abstract": "Six (6) species of small African land snails (SALS) were picked from bushes and home gardens in seven (7) locations in Benin metropolis. The SALS were identified by means of a picture chart and examined for their physical characteristics, shell properties, population pattern and relative abundance during season in the locations. Chemical analysis was performed to determine the proximate and mineral compositions of the SALS and to compare these with those of the common GALS, Achatina marginata. Along with the GALS, the SALS found in the metropolis belong mainly to the genus – Lumicolaria. They are rainy season gastropods; their presence became visible in April; population became significant in May; and then increased significantly to reach their peaks in July; and thereafter reduced significantly in August. There were no differentials respecting relative abundance of various species based on location in Benin metropolis. Instead the different locations sampled, fittingly represented replications of measurements and figures rather than differential biodiversity of snail species. The six species of SALS identified were L. flamnae (black and white), L.numidica, (yellow brown), L.martesiana (brown), L.aethiops (brown), L. feline (white), L.aurora (white and black). Morphologically the SALS measured 5.0 – 7.5cm in length, and 2.0 – 2.1cm in diameter. The number of whorls on shell varied from 6 – 9 between the species. There were variabilities in shell colors, sizes and relative standard live weight of the snails. The SALS and GALS showed similarity in physical characteristics and chemical composition, except in size. This means that SALS, like the GALS, also have high potential food value. Studies on the production and utilization of SALS were thus recommended. Six (6) espèces de petits escargots terrestres africains (le 'SALS') ont été cueillies dans des buissons et des jardins potagers dans sept (7) localités de la métropole du Benin. Les 'SALS' ont été identifiés au moyen d'une carte illustrée et examinés pour leurs caractéristiques physiques, les propriétés de la coquille, la structure de la population et l'abondance relative pendant la saison dans les emplacements. Une analyse chimique a été réalisée pour déterminer les compositions proximales et minérales du 'SALS' et pour les comparer avec celles du 'GALS' commun, Achatinamarginata. Avec les 'GALS', les 'SALS' trouvés dans la métropole appartiennent principalement au genre - Lumicolaria. Ce sont des gastéropodes de saison des pluies; leur présence est devenue visible en avril; la population est devenue importante en mai; puis a augmenté de manière significative pour atteindre leurs sommets en juillet; et par la suite considérablement réduit en août. Il n'y avait pas de différentiels concernant l'abondance relative des diverses espèces en fonction de l'emplacement dans la métropole béninoise. Au lieu de cela, les différents emplacements échantillonnés représentaient de manière appropriée des réplications de mesures et de chiffres plutôt que la biodiversité différentielle des espèces d'escargots. Les six espèces de SALS identifiées étaient L. flamnae (noir et blanc), L.numidica, (jaune brun), L.martesiana (brun), L.aethiops (brun), L. feline (blanc), L.aurora (blanc et noir). Morphologiquement, le SALS mesurait 5.0 à 7.5 cm de longueur et 2.0 à 2.1 cm de diamètre. Le nombre de verticilles sur coquille variait de 6 à 9 entre les espèces. Il y avait des variations dans la couleur de la coquille, la taille et le poids vif standard relatif des escargots. Les 'SALS' et 'GALS' ont montré des similitudes dans les caractéristiques physiques et la composition chimique, sauf en taille. Cela signifie que les 'SALS', comme les 'GALS', ont également une valeur alimentaire potentielle élevée. Des études sur la production et l'utilisation des 'SALS' ont donc été recommandées."}