{"doi": "https://doi.org/10.51791/njap.v47i3.150", "year": 2020, "abstract": "A comparative study was carried out on three breeds of snails in southeastern Nigeria to assess their carcass characteristic and carcass nutrient compositions. The three breeds used were Achatina fulica, Achatina achatina and Archachatina marginata. Four experimental diets were formulated to contain concentrate + pawpaw (Diet I), concentrate + Moringa oleifera (Diet II), concentrate + Moringa oleifera+ African spinach + Amaranthus hybridus (Diet III) and concentrate + Moringa oleifera+Amaranthus spinosus (Diet IV). Fifteen 6-month old growing snails of each breed was assigned per dietary treatment and each dietary treatment was replicated three times to contain five snails per replicate, given a total of one hundred and eighty snails. The experiment involved a 3 x 4 factorial experiment in a completely randomized design (CRD). Feed and water were given ad libitum throughout the duration of the experiment which lasted (56 days). At the end of the experiment, a total of seventy-two (72) snails were starved and slaughtered for carcass evaluation. Carcass nutrient compositions were measured including dry matter, moisture content, ash, crude fibre, crude protein, fat and nitrogen free extract. The results showed that the highest foot weight (57.50%) was observed in snails fed diet I, associated with relatively high live weight and highly reduced offal weight, which makes it comparatively better in improving carcass. The A. fulica, A achatina and A. marginata obtained best carcass composition respectively on diets I, III and II due to interaction effect of breed x diet. The A. achatina and A. marginata had higher dry matter (91.64 and 92.07 respectively) than the A fulica (90.09). The A. marginata carcass had the higher (p&lt;0.05) crude protein (32.78%), highest ash (9.17%) and a moderate fat content (1.59%). Based on overall interaction effects, diet I is recommended for A. fulica, while diet III for A. marginata and diet II for A. marginata. The A. marginata performed better than the A. achatina and A. fulica in highest crude protein, highest ash and a moderate fat content and is thus recommended."}