{"doi": "https://doi.org/10.1371/journal.pone.0248040", "year": 2021, "abstract": "Invertebrates in general have long been underrepresented in studies on biodiversity, biogeography and conservation. Boundaries of biodiversity hotspots are often delimited intuitively based on floristic endemism and have seldom been empirically tested using actual species distributions, and especially invertebrates. Here we analyse the zoogeography of terrestrial malacofauna from south-eastern Africa (SEA), proposing the first mollusc-based numerical regionalisation for the area. We also discuss patterns and centres of land snail endemism, thence assessing the importance and the delimitation of the Maputaland-Pondoland-Albany (MPA) biodiversity hotspot for their conservation. An incidence matrix compiled for relatively well-collected lineages of land snails and slugs (73 taxa in twelve genera) in 40 a priori operational geographic units was subjected to (a) phenetic agglomerative hierarchical clustering using unweighted pair-group method with arithmetic means (UPGMA), (b) parsimony analysis of endemicity (PAE) and biotic element analysis (BEA). Fulfilling the primary objective of our study, the UPGMA dendrogram provided a hierarchical regionalisation and identified five centres of molluscan endemism for SEA, while the PAE confirmed six areas of endemism, also supported by the BEA. The regionalisation recovers a zoogeographic province similar to the MPA hotspot, but with a conspicuous westward extension into Knysna (towards the Cape). The MPA province, centres and areas of endemism, biotic elements as well as the spatial patterns of species richness and endemism, support the MPA hotspot, but suggest further extensions resulting in a greater MPA region of land snail endemism (also with a northward extension into sky islands-Soutpansberg and Wolkberg), similar to that noted for vertebrates. The greater MPA region provides a more robustly defined region of conservation concern, with centres of endemism serving as local conservation priorities."}