{"doi": "https://doi.org/10.1002/ece3.7443", "year": 2021, "abstract": "Abstract Over the past century, the study of animal color has been critical in establishing some of the founding principles of biology, especially in genetics and evolution. In this regard, one of the emerging strengths of working with the land snail genus Cepaea is that historical collections can be compared against modern‐day samples, for instance, to understand the impact of changing climate and habitat upon shell morph frequencies. However, one potential limitation is that prior studies scored shell ground color by eye into three discrete colours yellow, pink, or brown. This incurs both potential error and bias in comparative surveys. In this study, we therefore aimed to use a quantitative method to score shell color and evaluated it by comparing patterns of C. nemoralis shell color polymorphism in the Pyrenees, using both methods on present‐day samples, and against historical data gathered in the 1960s using the traditional method. The main finding was that while quantitative measures of shell color reduced the possibility of error and standardized the procedure, the same altitudinal trends were recovered, irrespective of the method. The results also showed that there was a general stability in the local shell patterns over five decades, including altitudinal clines, with just some exceptions. Therefore, although subject to potential error human scoring of snail color data remains valuable, especially if persons have appropriate training. In comparison, while there are benefits in taking quantitative measures of color in the laboratory, there are also several practical disadvantages, mainly in terms of throughput and accessibility. In the future, we anticipate that genomic methods may be used to understand the potential role of selection in maintaining shell morph clines. In addition, photographs generated by citizen scientists conducting field surveys may be used with deep learning‐based methods to survey color patterns."}