{"doi": "https://doi.org/10.51791/njap.v45i2.476", "year": 2020, "abstract": "Six hundred adult mature black-skinned snails with four and five whorls on the shellcomprising of 200 each of the breeds; Archachatina marginata, Achatina achatina and Achatina fulica were used for the study. Phenotypic traits measured from the snails included body weight (BDW), shell length (SHL), shell width (SHW), aperture length (APL), aperture width (APW), spiral length (SPL), spiral width (SPW), diagonal length (DAL), length between the aperture and first spiral (LAS). The data obtained were used to estimate simple statistics (mean, standard error and coefficient of variations) and correlation oefficients. The results showed high significant (p&lt;0.01) breed effects on phenotypic traits as A.nmarginata snails with four (288.700g) and 5(394.500g) whorls were phenotypically and genotypically heavier, larger and wider than A. achatina (127.0g and 182.000g) and A. fulica (48.850g and 65.050g) with four and five whorls respectively. There were also high significant (p&lt;0.01) disparity number of whorls effects on body weight and other phenotypic traits studied. There was only one strong, negative and significant (p&lt;0.01) phenotypic correlation (r ) between SHL and LAS (r = – 0.650) recorded for A. achatina snails with four whorls while A. achatina snails with five whorls recorded few strong, negative and significant(P&lt;0.01) phenotypic correlations between BDW and SHW (r = – 0.613), SHL and LAS (r = –0.641), SHW and APW (r = – 0.602). Similarly, A. fulica snails with four whorls recorded few strong, negative and significant (p&lt;0.01) phenotypic correlations between BDW and SHW (r = – 0.627), SHL and APL (r = – 0.639), SHW and APW (r = – 0.657) and only one strong, negative and significant (p&lt;0.01) phenotypic correlation between SHL and LAS (r = – 0.605) for A. fulica snails with five whorls. Again, Am snails with four whorls had only one strong, negative and significant(p&lt;0.01) phenotypic correlation between BDW and SHL (r = – 0.720). The only two low, positive and significant (p&lt;0.05) phenotypic correlations recorded in this study were between APL and APW ((r = 0.544) and between SPL and DAL (r = 0.583) for A. marginata snails with four and five whorls respectively. Thus, the breed type and number of whorls on snail shells strongly influenced estimates of phenotypic traits and correlation coefficients of giant African land snails in Nigeria. Also, that estimates of correlation coefficients of mature giant African land snails with higher whorls were (4 and 5) are scarcely strong, positive and significant. The study revealed and confirmed that A. marginata snails are phenotypically and genotypically heavier, larger and wider than A. achatina and A. fulica snails with 4 and 5 whorls. These estimates are recommended as strong and efficient tools for selection and up grading or improvement of giant African land snails genetic traits in Nigeria."}