{"doi": "https://doi.org/10.51791/njap.v44i4.614", "year": 2020, "abstract": "A number of studies have been carried out on the reproductive and growth performance of these breeds of giant African land snails, but not much is documented on chromosome, evolutionary relationships and divergence studies. Forty snails and 10 of each breed of giant African land snails Archachatina marginata (AM), Achatina achatina (AA) and Achatina fulica (AF) and two varieties of A. marginata [A. marginata var. saturalis (AMS) and A. marginata var. ovum (AMO)] were used for the chromosomes numbers analyses. Slides for chromosome identification were prepared using the ovotestes and the cells were examined for spread atmetaphase. The haploid (n) chromosome numbers obtained revealed and confirmed that AF, AA, AMS and AMO snails have 27, 30, 28 and 28 chromosomes respectively. Also 13 amino acid sequences were retrieved from the National Centre for Biotechnology Information with accession numbers: ALD09273, AAY62497, ACA 10148 and AKQ 76237 for AM; AKQ 76253, AKQ 76250, CDL 67813, CDL 67813 and AKQ 76249 for AA and SP/P35903, PDB/5CZL, KZM 80032 and YP009049167 for AF snails. The evolutionary history was inferred using the Neighbour-Joining method. Phylogenetic tree analysis by Neighbour- Joining (NJ) was constructed using 10 out of the 13 amino acid sequences. The reliability of the tree was calculated by boostrap confidence value with 1000 boot strapiterations using MEGA 7 software.The phylogenetic trees showed that these snail breeds are highly divergent. A. achatina was separately related to itself; whereas A. marginata slightly mingled with A. fulica. The degrees of divergence obtained signified that they have evolved from different ancestors. The evolutionary distances were computed with the remaining three amino acid sequences using the Poisson Correction method. Very high and far apart average genetic distances of 0.923±0.018, 0.926±0.018 and 0.926±0.017 were obtained for AA vs AF, AF vs AM and AA vs AM snails respectively, confirming that these snail breeds are genetically far apart between themselves. The results obtained for chromosome numbers, evolutionary relationship and average genetic distances might be apanacea in further selection and molecular classification of giant African land snails (GALS) in Nigeria."}