{"doi": "https://doi.org/10.51791/njap.v45i2.478", "year": 2020, "abstract": "A comparative study was carried out on three breeds of snails in South Eastern Nigeria to assess their growth performance and body morphology. The three breeds used were A. Fulica, A. achatina and A. marginata. Four experimental diets were formulated to contain Concentrate + Pawpaw (Diet I), Concentrate + Moringa oleifera (Diet II), Concentrate + Moringa oleifera + African spinach + Amaranthus hybridus (Diet III) and Concentrate + Moringa oleifera + Amaranthus spinosus (Diet IV). Fifteen 6-month old growing snails of each breed were assigned per dietary treatment and each dietary treatment was replicated three times to contain five snails per replicate, given a total of one hundred and eighty snails. The experiment involved a 3 x 4 factorial experiment in a Completely Randomized Design (CRD). Feed and water were given ad libitum throughout the duration of the experiment which lasted (56 days). Parameters measured were body parameters which include body weight, body width, body length, aperture length and aperture width; growth performance parameters obtained were initial weight, final weight, average weekly weight gain, average weekly feed intake and feed conversion ratio. The results showed that the A. achatina and A. marginata similarly recorded higher values in body parameters than the A. fulica. The A. marginata however was longer (12.69 cm) than the 8.95 and 12.32 cm recorded for A. fulica and A. marginata gain was only influenced by interaction effect of the breed x diet. The A. marginata and A. fulica revealed higher foot weight 58.81% and 57.59% respectively in relation to their live weight, which was associated with lower % shell weight (17.17 and 22.33% respectively), whereas, the higher shell weight (36.18%). The highest foot weight (57.50%) was observed in snails fed diet I, associated with relatively high live weight and highly reduced offal weight, which makes it comparatively better in improving carcass. Based on overall interaction effects, diet I is recommended for A. fulica, while diet III for A. marginata and diet II for A. marginata. The A. marginata performed better than the A. achatina and A. fulica in body size (body length) and foot weight, thus recommended."}