{"doi": "https://doi.org/10.1016/j.scitotenv.2021.146910", "year": 2021, "abstract": "Human activities have enormous impact on current biodiversity distribution across all spatial scales. Despite the numerous studies showing the difference between preserved and impaired sites, only little is known about the regional scale. Therefore, we selected four European regions differing in habitat conservation status (HCS) to explore if the variation in land snail communities reflects regional differences. We collected quantitative land snail samples at 169 isolated spring fen sites and measured environmental parameters. The species richness of habitat specialists expressed low variation and weak associations with local conditions in the two regions of adequate HCS, presumably because of their common occurrence throughout most sites. In contrast, the richness of matrix-derived species, i.e. predominantly habitat generalists, was highly variable in these two regions and also tightly associated with local conditions, especially moisture. In both the intermediate and the inadequate HCS region, these associations were much weaker as the fens are less extreme and allow for penetration of matrix-derived species. Population densities of Vertigo geyeri, an umbrella species internationally protected by the EU Habitats Directive, were highest in the two adequate HCS regions. Species composition was primarily controlled by moisture in the regions of adequate HCS, while in the remaining regions, those predictors that are less easily jeopardized by human impact, such as climate, water chemistry and terrain topography, gained importance. In the inadequate HCS region, none of the analysed predictors was associated with the main compositional gradient, suggesting a complete disruption of community-environment relationships. Our results suggest that the species richness and community responses to natural gradients might be substantially modified by human impact, although the effect of some other region-specific factors cannot be easily disentangled because of inevitably low number of studied regions."}