{"doi": "https://doi.org/10.1016/j.aqrep.2021.100695", "year": 2021, "abstract": "A study was conducted on the effect of common salt (NaCl) on reproductive tract dimension, haemolymph haemocyte count and biochemical parameters of Giant African Land snail (GALs), Archachatina marginata during the dry season. Forty (40) snails with a weight range of 150 g–180 g were used for this study. Four (4) treatment with each consisting of ten (10) replicates were assigned as follows: T1 (Control: concentrate +0 g of salt (NaCl)), T2 (concentrate +0.05 g of salt (NaCl)), T3 (concentrate+0.15 g of salt (NaCl) and T4 (concentrate + 0.25 of salt (NaCl)). The experiment lasted 13 weeks. Haemolymph was collected at the end of 13 weeks to assess haemocyte count, total protein, albumin, globulin, alanine transaminase (ALT) and aspartate transaminase (AST). The haemocyte count was determined using a Neubeur haemocytometer, while haemolymph biochemical parameters were determined using spectrophotometric methods with the appropriate kit. The snails were also dissected for complete isolation of the reproductive tract for morphometric measurements. Key organs concerned were: Ovo-testis, albumen, little hermaphrodite duct and hepatopancreas. The weight and length of each of these organs were taken together with complete tract weight. Ovo-testis from each treatment was also harvested for histology. A mortality record was taken as the experiment progresses. The result showed that serum biochemical parameters were not significantly (P > 0.05) affected by a various inclusion level of salt used. But it had a significant effect on ovotesis length, albumen weight, little hermaphrodite weight and reproductive tract weight. However, no significant effect was seen in ovotestis weight, albumen length, little hermaphrodite length and hepatopancreas weight and length. It was also discovered that common salt (NaCl) significantly affected (P < 0.01) haemocyte count and mortality record of GALS. Snails fed 0.25 g NaCl had the highest haemocyte count, followed by those fed 0.15 g, while snails fed 0 g and 0.05 g recorded the least value. It was also discovered that 0 g NaCl inclusion into the diet of snail (A. marginata) recorded the highest mortality (60 %) followed by 0.05 g NaCl inclusion level which gave 30 % mortality. However, the inclusion level of 0.15 g and 0.25 g NaCl into snail feed recorded no mortality. Histological evaluation of the ovotestis revealed that snail given 0.25 g inclusion into the concentrate diet had active acini with spermatogonium and well-formed oocyte, followed by those group with 0.15 g with active acini with several ova. It is obvious from this study that NaCl had an immune-modulatory influence on GAS during the dry season via mitigation of mortality without negatively affecting the haemolymph biochemical parameter. Inclusion used in this study also boost reproductive apparatus functions which are usually not active during this period. It is therefore recommended that both 0.15 g and 0.25 g/kg be included into the diet of A. marginata during the dry season to mitigate challenges that confront snail farming during the period to boost production and reduce economic losses due to mortality during this season."}