{"doi": "https://doi.org/10.2478/aoas-2020-0090", "year": 2021, "abstract": "Abstract The aim of this study was to compare the quality of clutches and reproduction results of two groups of Roman snails (Helix pomatia) from the same local population, laying eggs simultaneously in semi-natural farm conditions and in a natural habitat. The study material were Roman snails aged 2 or more years which had entered the third phenological season of their life and thus the first season of sexual maturity. Observations were conducted at an earthen enclosure in a greenhouse belonging to the experimental farm for edible snails at the National Research Institute of Animal Reproduction in Balice near Kraków (Poland) as well as at a site where a local population naturally occurs in the uncultivated park surrounding the Radziwiłł Palace. In the June-July season, differences among such parameters as weight of clutch, number of eggs in clutch, mean egg weight, and hatchling percentage when compared to the total number of eggs in the clutch were compared. It was determined that clutches of eggs from the natural population laid in the greenhouse were of lesser weight (P&lt;0.01), contained fewer eggs (P&lt;0.05), and the mean weight of individual eggs was less (P&lt;0.05) than in clutches laid simultaneously in a natural habitat. Both in the greenhouse and the natural habitat, in the first phase of laying eggs (June) the weight of the clutch and number of eggs its contained were greater than in the second phase (July). However, only for snails laying eggs in the greenhouse were these differences statistically significant (P&lt;0.05) and highly significant (P&lt;0.01), respectively. Statistically significant differences were not observed in hatchling percentage between eggs laid in the greenhouse and the natural habitat. The lower number of eggs laid in the farmed conditions of the greenhouse was successfully compensated for by the absence of mass destruction by rodents which occurred in the natural habitat."}