{"doi": "https://doi.org/10.1093/sysbio/syab050", "year": 2021, "abstract": "Delimiting species in radiations is notoriously difficult because of the small differences between the incipient species, the star-like tree with short branches between species, incomplete lineage sorting, and the possibility of introgression between several of the incipient species. Next-generation sequencing data may help to overcome some of these problems. We evaluated methods for species delimitation based on genome-wide markers in a land snail radiation on Crete. Species delimitation in the Albinaria cretensis group was based exclusively on shell characters until now and resulted in classifications distinguishing 3-9 species. We generated sequences of 4270 loci for 140 specimens of the A. cretensis group from 48 populations by double-digest restriction site-associated DNA sequencing. We evaluated three methods for species discovery. The multispecies coalescent approach implemented in the program Bayesian Phylogenetics and Phylogeography resulted in a drastic overestimating of the number of species, whereas Gaussian clustering resulted in an overlumping. Primary species hypotheses based on the maximum percentage of the genome of the individuals derived from ancestral populations as estimated with the program ADMIXTURE moderately overestimated the number of species, but this was the only approach that provided information about gene flow between groups. Two of the methods for species validation that we applied, BFD* and delimitR, resulted in an acceptance of almost all primary species hypotheses, even such based on arbitrary subdivisions of hypotheses based on ADMIXTURE. In contrast, secondary species hypotheses, resulting from an evaluation of primary species hypotheses based on ADMIXTURE with isolation by distance tests, approached the morphological classification, but also uncovered two cryptic species and indicated that some of the previously delimited units should be combined. Thus, we recommend this combination of approaches that provided more detailed insights in the distinctness of barriers between the taxa of a species complex and the spatial distribution of admixture between them than the other methods. The recognition and delimitation of undersampled species remained a major challenge. [ADMIXTURE; Clausiliidae; delimitR, Gaussian clustering; isolation-by-distance; land snails; multispecies coalescent; species delimitation.]."}