{"doi": "https://doi.org/10.51406/jagse.v17i2.1837", "year": 2019, "abstract": "Aestivation is a process of metabolic suspension which plays a key role in the survival of land snails during a period of drought. Human shave also used this process to transport the animal for commercial purpose. To examine the effect of this physiological process on reproductive apparatus, thirty (30) Giant African Land snail (Archachatinamarginata) with average weight of 130 -150g were used for this study. The snails were allotted to three different treatments with ten (10) replicate each after four weeks of acclimatization period which include: zero (0) week, three (3) weeks and six (6) weeks of aestivation. Parameters measured were: Internal organ weight, ovo-testis weight, reproductive tract length (cm) and weight (g). Also gonado-somatic index and spermatozoa concentration were also determined. Results showed that aestivation duration had significant influence on organ weight, ovo-testis weight, reproductive tract length and weight and spermatozoa concentration. However, gonado-somatic index (GSI) was not significantly influenced. It was observed that organ weight decreased as aestivation duration increased. For ovo-testis, snails with aestivation duration of six weeks had smaller weight compared to the control (0 week) while those at three weeks aestivation duration were not significantly different from the control group and those of six weeks aestivation duration. For reproductive tract weight, there was a significant(P&lt;0.01)decrease in weight of the tract for both snails under three and six weeks aestivation duration compared to the control group (0 week). Spermatozoa count also decreased as aestivation duration increased. It can therefore be concluded that aestivation duration had significant effect on organ weight, ovo-testis weight, reproductive tract weight and spermatozoa concentration. For quick target of reproduction and snail economic value, it is recommended that aestivation duration should not be allowed to reach three weeks and above for whatever reason.&#x0D; &#x0D; &#x0D;"}