{"doi": "https://doi.org/10.12681/eadd/49124", "year": 2021, "abstract": "Η νησιωτική βιοποικιλότητα εξάπτει την περιέργεια και το θαυμασμό των επιστημόνων εδώ και αιώνες, καθώς η μελέτη της έχει προσφέρει γνώσεις ζωτικής σημασίας για την κατανόηση των μηχανισμών που καθορίζουν την εμφάνιση μακρο-οικολογικών προτύπων ποικιλότητας. Ωστόσο, τέτοια πρότυπα έχουν διαχρονικά περιγραφεί και μελετηθεί χρησιμοποιώντας – κατά κύριο λόγο – μια στενή γκάμα σπονδυλωτών και – σε μικρότερο βαθμό – φυτικών οργανισμών. Τα ασπόνδυλα είδη, τα οποία συγκροτούν την συντριπτική πλειοψηφία των καταγεγραμμένων ειδών του πλανήτη, απουσιάζουν εμφατικά από παγκόσμιες μακρο-οικολογικές μελέτες, τόσο εξαιτίας της έλλειψης εμπεριστατωμένων δεδομένων μεγάλης γεωγραφικής κλίμακας όσο και εξαιτίας μιας γενικευμένης – για πολλούς – προτίμησης στην έρευνα των πιο ελκυστικών σπονδυλωτών και φυτικών taxa. Στην διατριβή αυτή επιχειρείται η γεφύρωση αυτού του κενού για τα χερσαία σαλιγκάρια, μια ομάδα ασπόνδυλων οργανισμών που χρησιμοποιείται ευρέως σε μελέτες νησιωτικής βιογεωγραφίας. Τα χερσαία σαλιγκάρια αποτελούν μια εξαιρετική ομάδα οργανισμών για τη διερεύνηση μακρο-οικολογικών προτύπων ποικιλότητας. Είναι πολυάριθμα – με περίπου 23.000 περιγραμμένα είδη – παρουσιάζουν υψηλά επίπεδα ενδημισμού, απαντώνται σε πληθώρα χερσαίων οικοσυστημάτων και διαθέτουν ένα ευρύ φάσμα μορφολογικών παραλλαγών. Επιπλέον, τα χερσαία σαλιγκάρια αποτελούν μία από τις πιο απειλούμενες ομάδες ζωικών οργανισμών παγκοσμίως, καθώς πολλά από τα έως τώρα γνωστά είδη έχουν ήδη εξαφανιστεί ως αποτέλεσμα ανθρώπινων παρεμβάσεων. Τα χαρακτηριστικά αυτά, τα καθιστούν οργανισμούς-μοντέλα για την κατανόηση των οικολογικών και εξελικτικών διαδικασιών που διαμορφώνουν τη σύνθεση και την κατανομή νησιωτικών βιοκοινοτήτων καθώς και των παραγόντων που επηρεάζουν την πιθανότητα εξαφάνισής τους. Ο στόχος της διατριβής αυτής είναι διττός. Πρώτον, η εξέταση των κύριων περιβαλλοντικών παραγόντων που διαμορφώνουν τον πλούτο ειδών και τον ενδημισμό των νησιωτικών πανίδων χερσαίων σαλιγκαριών παγκοσμίως. Δεύτερον, η διερεύνηση των εγγενών ενδοειδικών μορφολογικών και οικολογικών χαρακτηριστικών ως παράγοντα που καθορίζει το βαθμό ευαλωτότητας και κατ’ επέκταση τον κίνδυνο εξαφάνισης ενός είδους. Στο Κεφάλαιο 1 περιγράφεται η ανάπτυξη της βάσης δεδομένων GlobaLSnails – μιας παγκόσμιας απογραφής δεδομένων παρουσίας/απουσίας νησιωτικών χερσαίων σαλιγκαριών – μέσα από την οποία προκύπτει ότι η νησιωτική ποικιλότητα ειδών χερσαίων σαλιγκαριών σε 727 ηπειρωτικά και ωκεάνια νησιά από 86 αρχιπελαγικά νησιωτικά συγκροτήματα της υφηλίου αντιπροσωπεύει σχεδόν το ήμισυ του παγκόσμιου πλούτου γνωστών ειδών –- 11.139 είδη – με τη συντριπτική πλειοψηφία αυτών να απαντώνται ως νησιωτικά (75%) ή αρχιπελαγικά (91%) ενδημικά είδη. Στο Κεφάλαιο 2 διερευνώνται i) η πηγή και ii) o βαθμός διακύμανσης του πλούτου ειδών σε καθένα από αυτά τα νησιά, μέσα από την εξέταση των επιδράσεων της φυσικής γεωγραφίας (π.χ. έκταση και απομόνωση από ηπειρωτικές μάζες), της περιβαλλοντικής ετερογένειας (π.χ. μέσες κλιματικές συνθήκες, διαθέσιμη παραγωγική ενέργεια, βιοτοπική ποικιλότητα και τοπογραφική περιπλοκότητα) και της επίδρασης του ανθρώπου (π.χ. παρουσία μόνιμων πληθυσμών και οδικού δικτύου). Συνολικά, η διακύμανση του νησιωτικού πλούτου ειδών εξηγείται σε σημαντικό βαθμό από αυτό το σύνολο περιβαλλοντικών παραμέτρων (R2= 80-84%), ενώ καθένας από τους χωρότυπους που εξετάζονται (δηλ. νησιωτικά ενδημικά, αρχιπελαγικά ενδημικά και ιθαγενή μη ενδημικά είδη) αποκρίνεται σε διαφορετικό βαθμό στις διάφορες περιβαλλοντικές παραμέτρους, κάτι που υποδεικνύει τη διαφορετική σχετική συνεισφορά των υποκείμενων βιογεωγραφικών διεργασιών – δηλ. της ειδογένεσης, του εποικισμού και της εξαφάνισης – στην εμφάνιση χωροτυπικά-εξαρτημένων προτύπων ποικιλότητας. Στο Κεφάλαιο 3, εξετάζεται η διαχρονική επίδραση των μεταβολών της θαλάσσιας στάθμης στα πρότυπα του πλούτου ειδών που παρατηρούμε σήμερα. Συγκρίνοντας το ρόλο των πιο μακροχρόνιων αρχιπελαγικών διατάξεων της Πλειστόκαινου γεωλογικής περιόδου με αρχιπελαγικές διατάξεις μικρότερης διάρκειας, όπως αυτές της Τελευταίας Παγετώδους Περιόδου (Last Glacial Maximum) και της σημερινής, συμπεραίνεται ότι αρχιπελαγικές διατάξεις που αντιστοιχούν σε ενδιάμεσα επίπεδα θαλάσσιας στάθμης (δηλ. από -65 έως -85 μ. Μέσης Θαλάσσιας Στάθμης σε σχέση με τη σημερινή) – τα οποία είναι πιο αντιπροσωπευτικά της Πλειστόκαινου γεωλογικής περιόδου – έχουν αφήσει ισχυρότερο αποτύπωμα στα σημερινά πρότυπα ενδημισμού, συγκριτικά με διατάξεις που επικράτησαν για μικρότερα χρονικά διαστήματα (όπως π.χ. αρχιπελαγικές διατάξεις της Τελευταίας Παγετώδους Περιόδου, στα -122 μ. Μέσης Θαλάσσιας Στάθμης). Το Κεφάλαιο 4, εστιάζει στα ταξινομικά και χωρικά πρότυπα της κατάστασης διατήρησης (IUCN conservation status) ενός υποσυνόλου ειδών με διαθέσιμα σχετικά δεδομένα, επιχειρώντας παράλληλα να ποσοτικοποιήσει την επίδραση εγγενών ενδοειδικών χαρακτηριστικών, όπως η μορφολογία κελύφους και το εύρος γεωγραφικής εξάπλωσης, στην πιθανότητα εξαφάνισης ενός είδους. Τα αποτελέσματα δείχνουν ότι οι καταγεγραμμένες εξαφανίσεις ειδών δεν είναι τυχαίες, με ορισμένες οικογένειες σε ορισμένα νησιωτικά συστήματα να έχουν επηρεαστεί από την ανθρώπινη δραστηριότητα περισσότερο από άλλες σε άλλα σημεία του πλανήτη. Επιπλέον, καταδεικνύεται ότι η πορεία ενός είδους προς εξαφάνιση δεν είναι μία τυχαία διαδικασία αλλά σχετίζεται με συγκεκριμένα βιολογικά, βιογεωγραφικά και οικολογικά χαρακτηριστικά. Συνολικά, η παρούσα διατριβή αποτελεί μία από τις λίγες, μέχρι σήμερα, προσπάθειες για την ενσωμάτωση ασπόνδυλων οργανισμών σε βιογεωγραφικές αναλύσεις ευρείας κλίμακας, προσφέροντας μια συμπληρωματική θεώρηση για την κατανόηση των μηχανισμών που διέπουν την εμφάνιση χωρικών και χρονικών προτύπων διάρθρωσης της παγκόσμιας βιοποικιλότητας."}