{"doi": "https://doi.org/10.3398/064.081.0309", "year": 2021, "abstract": "The biogeography and habitat affinities of the Recent taxa of terrestrial mollusks of Nevada, western USA, are discussed herein. A total of 52 land snails and slug species were found in Nevada, of which 21 are newly reported records. Two native land snails found previously were not found by this author, and 6 additional species are possible for the state. Of the 47 species of land snail found in the state, 42 are considered native, while 5 are introduced. Only one slug, Deroceras laeve, is considered native, while 4 others are introduced. Land mollusks in eastern and central Nevada are derived from the Rocky Mountain Molluscan Province, such as Pupilla hebes, Microphysula ingersolli, and Oreohelix strigosa depressa (9 species, 18%), while southern Nevada supports species derived from the Southwestern Province, such as Gastrocopta spp., Striatura meridionalis, and Eremarionta rowelli (8 species, 16%). A Californian and Oregonian influence includes Pristiloma chersinella and Punctum californicum. Introduced land snails and slugs such as Deroceras reticulatum, Lehmannia valentiana, Cepaea nemoralis, and Rumina decollata are found in the gardens and parks of urban areas in Nevada. The present native land snail distributions in Nevada result from Miocene and Pliocene dispersal and establishment in the mountains of the Great Basin followed by Pleistocene and Holocene fragmentation and isolation. Xeric habitats such as sagebrush steppe, Pygmy conifer woodlands, and dry alkaline lake beds dominate much of the state and support very few or no land mollusks. Nine habitats are identified as being used by terrestrial mollusks in Nevada. Mountain woodlands, springs, and chaparral support 71% of the total fauna, which includes 36 land snail species and the slug Deroceras laeve where water, coniferous and deciduous vegetation, and moist litter are available between 1400 and 2800 m elevation. The more xeric Mojave Desert in the south (165–1100 m) and sagebrush steppe of the Great Basin (800–2000 m) support 3 and 4 species, respectively. The Pygmy coniferous woodlands occasionally support 2 species, except when the woodlands are associated with limestone cliffs and shrubs, where 5 species may be present (1600–2200 m). River valleys, perennial streams, and meadows (800–2000 m) make up only 1% of the state's land area but support 19 species of land mollusks. Subalpine and alpine habitats in the high mountains (2800–3400 m) support 13 species of land snails. Urban areas with greenhouses, parks, and casino gardens support 9 species of introduced land snails and slugs."}