{"doi": "https://doi.org/10.1130/abs/2021am-368379", "year": 2021, "abstract": "The oxygen isotope composition (δ18O) of land snail shells has been used to reconstruct paleoenvironmental conditions, especially in middle latitudes of the Northern Hemisphere. However, polar environments, which are vanishing due to accelerated warming, have been overlooked and little is known about snail species living in these regions and their potential as paleoclimate proxies. This project aims to further develop the use of land snail shells as a paleoclimate proxy by calibrating the oxygen isotope values of modern land snail shells along a north-to-south transect (from 60° to 70°N) in Alaska so they can later be used to interpret the fossil record. We tested the hypothesis that land snail shell δ18O values would primarily track summer precipitation δ18O, when snails are expected to be most active and grow shell. Collectively, Alaska shell δ18O values ranged from -14.0 to -9.1‰, averaging -11.3 ±1‰. Snail shell δ18O values significantly increased with increasing air temperature and precipitation δ18O values along the north-to-south transect. Interestingly, shell δ18O values were found to most closely track precipitation δ18O from an extended summer season, months April-October, rather than the summer months alone, suggesting that snails in Alaska are active for part of the fall and spring, and not just months June-August. Additionally, we found shell δ18O values differed significantly among sympatric species, with larger size species consistently exhibiting higher δ18O values. This work indicates that species isotopic variations should be considered at the local and microhabitat scale in future paleoclimate investigations in Alaska. Combining snail shell δ18O values from this study with previously published data from lower latitudes confirms that land snail shells are a valid and useful proxy for precipitation δ18O at coarse spatial scales, even when multiple species are combined."}