{"doi": "https://doi.org/10.1186/s41936-021-00258-3", "year": 2021, "abstract": "Abstract Background The ovotestis gland (the hermaphrodite gland) is a reproductive system organ that affects fertility of land snails. Thus, the present study was conducted to evaluate the effect of three inorganic salts (sodium carbonate, sodium benzoate, and sodium nitrate) against the land snail, Massylaea vermiculata under laboratory and field conditions. Snails were treated with serial concentrations of the tested salts for seven days using thin-layer film technique. The LC 50 of each salt was determined, and the effect of ½ LC 50 of each was tested on egg-laying. In addition, LPO enzyme was determined, and the histological effect of the ovotestis gland was inspected. The field efficiency of sodium carbonate and sodium nitrate were evaluated as a spray for 21 days on pomegranate nursery trees at Giza Governorate. The effects of inorganic salts were compared with methomyl (the compound recommended by the Egyptian Ministry of Agriculture against land snails in the field). Results The laboratory results revealed that sodium carbonate and sodium nitrate were more toxic than sodium benzoate, whereas the LC 50 were 2.4, 9.6, and 11.8% for the three inorganic salts, respectively. Sodium carbonate and sodium nitrate achieved complete inhibition for egg production, while sodium benzoate gave 37.7% compared to 96.8% for hatchability control. Sodium carbonate and sodium benzoate exhibited significant effect on LPO enzyme, while a non-significant effect was recorded by sodium nitrite compared with control. Regarding the histological effect, sodium carbonate and sodium nitrate had the same effect on ovotestis, as a necrobiotic change was observed in the ova, and diminishing in spermatozoal concentration, while sodium benzoate caused decreasing in spermatozoal concentration without any alteration in the ovarian compared with control. Regarding the field results, sodium carbonate and sodium nitrate achieved 78.4 and 79.0% reduction in land snail populations, respectively, compared with 75% for methomyl compound. Conclusions The tested inorganic salts have highly toxic effect against the land snail, M. vermiculata, and they can be used in field control programs, after conducting more studies on their effect on the soil and other environmental components."}