{"doi": "https://doi.org/10.1016/j.ympev.2022.107402", "year": 2022, "abstract": "Fruticicola fruticum (O. F. Müller, 1774), a medium-sized helicoid snail in the Camaenidae, has a wide range in Europe, reaching from the Urals and the Caucasus to the Balkans, and from the southern part of Scandinavia, through Central Europe to eastern and central France and northern Italy. There are numerous studies on its distribution, biology, life cycle, etc., but little is known about the genetic diversity of this taxon. Here, we studied the phylogeny and phylogeography of F. fruticum using two mitochondrial markers: cytochrome oxidase subunit I (COI) and 16S ribosomal RNA (16S); and four nuclear markers: 18S ribosomal RNA (18S), 28S ribosomal RNA (28S), internal transcribed spacer (ITS-2), and histone 3 (H3). The study was based on 59 populations sampled across the range. Whereas nuclear markers showed little differentiation, phylogenetic analysis of COI sequences clearly confirmed the distinctness of the European Fruticicola and Asian Bradybaena (p-distance 0.229). Within Fruticicola 54 haplotypes were detected, haplotype diversity (Hd) = 0.973 ± 0.006, nucleotide diversity (π) = 0.137 ± 0.005. ABGD and PTP delimitation analyzes distinguished eight mOTUs. Two sequences (our mOTU C) from Russia were published in the GenBank as two distinct species: F. schrenckii and F. transbaicalia. Seven further mOTUs identified in our study formed three distinct lineages, regarded as species. The first (mOTU A and mOTU B), represented by 40 populations, occupies a wide range across northern and central Europe, extending east to Ukraine and south to northern Croatia (mOTU B). It encompasses the type locality of F. fruticum, and can be recognized as F. fruticum sensu stricto. Another lineage (mOTU D and mOTU E), represented by six populations in central Romania, appears to form another species. Both mOTUs were found together in one population. A third lineage, containing mOTUs F, G and H, represented by 14 populations, was distributed across the Balkans from N.E. Croatia to Bulgaria. p-distances between the three species ranged from 0.172 to 0.219, and between all the mOTUs, pooled together, from 0.172 to 0.258. The highest genetic diversity was found in species 3 (0.112) and the lowest in species 1 (0.025), despite its largest geographic distribution. Pairwise p-distances, Tamura 3-parameter distances, composite likelihood distances, as well as the coancestry coefficient FST, calculated for all populations pooled together were significantly associated with geographic distance, but this was not the case within each of these three species. The significant association for all populations reflected high diversity between the species coupled with high geographic distances between their populations, not the character of intraspecies diversity. With a few exceptions, there hold a rather infinite island model with low migration. AMOVA detected 78% of the variance between the three species, 18% among populations within the species, and only 3.6% within the populations. The low genetic diversity of widespread F. fruticum s. stricto, compared with much higher diversity of two narrowly distributed newly found species of Fruticicola, may reflect the rapid spread of the former into previously uninhabitable regions, while the latter were able to maintain populations in glacial refugia. The estimated time of divergence between the three species, 1.7-2.19 mya, suggests their ancestors' isolation in southern European refugia during the lower Pleistocene, the Gelasian/Calabrian. There was no clear association of variation in shell morphology and lineage or mOTU identity; on external characters, these species are semicryptic, subtle differences in reproductive anatomy among them were found."}