{"doi": "https://doi.org/10.3390/su132413719", "year": 2021, "abstract": "Land snails are crucial consumers in the terrestrial environment and beneficial significant bioindicators to evaluate the chemical impact in the ecosystem, especially on urban lands. The present study aimed to investigate the concentration of heavy metals such as As, Cr, Ni, Pb, and Zn in urban soil and study whether Eobania vermiculata acts as a bioindicator for heavy metal contamination in an urban area. Thirty soil and snail samples in triplicate from each sampling site were taken from the urban areas of Suliamani. After a microwave-assisted digestion procedure, every sample was analyzed by inductively coupled plasma-optical emission spectrometry. Results showed that the concentration of chromium (Cr) in each snail sample was significantly high. The maximum Cr concentration (15.87 mg kg−1) was recorded in the snail sample collected from Ali Kamal Park, which was adjacent to a very crowded traffic road. The As concentration in snail samples ranged from 0.08 to 1.004 mg kg−1, and it was below the permissible limits. However, the concentrations of heavy metals in urban soil locations were below their background measurements, except for nickel (Ni) which was above the permissible limits. The safest site in the study area was Chaviland 1, while the most contaminated site was the Ha-wary Shar Park. The snails bioaccumulated metals in their tissues in the following order, Cr &gt; Zn &gt; Ni, and this bioaccumulation occurred more on the main road locations, which represented potentially contaminated places due to anthropogenic activities. Moreover, there was no correlation among the heavy metals within the soil samples when compared to the similar metals in the snail samples, due to the low concentration of heavy metals in soil, excluding Ni, from where the snail samples were collected. Consequently, the land snail, E. vermiculata, is an appropriate sentinel organism for some metals, mainly for Cr, and the bioindicator monitoring with this snail should be extended to mixtures of heavy metals, since such relationships frequently occur in soil."}