{"doi": "https://doi.org/10.2478/ats-2021-0025", "year": 2021, "abstract": "Abstract The study examined the marketing and uses of two species of Giant African Land Snails ( Archachatina marginata and Achatina achatina ) in four (4) different market locations in Ibadan Oyo state, Nigeria. The data were collected using a structured and validated questionnaire administered interpersonally to 160 snail marketers in four randomly selected markets in selected Local Government Area (LGA) situated in Ibadan. Data collected were analysed using descriptive and inferential statistical tools; these include frequencies, mean, median, mode and multiple regression. Findings from the socioeconomic characteristics revealed that majority (98.1 %) of the respondents were female and only 1.9 % were male. Majority (91.9 %) of marketers were married with 27.5 % in the 31–40 years age group. Majority (89.4 %) raised their capital through personal savings and had over 16 years of marketing experience. All respondents (100 %) were involved in wholesale marketing of different species of snail whereas 65 % of them were into both wholesale and retail marketing. Also, 88.8 % were engaged in marketing of both species only. Most (70 %) of the respondents’ generated income per year was between ₦10,000–₦49,999 ($26–$130). All marketers ascertained that the major purpose of snail is for consumption. Also, the budgetary analysis (costs and returns) revealed that marketing of Archachatina marginata and Achatina achatina is a profitable business among the marketers with a high rate of return on investment. The most efficient market for both snail species was Sango market with efficiency values 1.77 and 1.82 for A. achatina and A. marginata, respectively. The coefficient of multiple determination, R 2 value of 0.689 indicated that 68.9 % of the variation in the marketing price of snail is explained by transportation cost, cost price of snail and market tariff. The marketing efficiency was greater than one in all markets which showed that the markets were efficient in the marketing of Archachatina marginata and Achatina achatina. The study concluded that snail marketing is profitable given the market efficiencies and rate of returns on investment. Policy recommendation towards reduction in cost of transportation and market tariff is suggested as this would bring about improved market efficiencies and more returns."}