{"doi": "https://doi.org/10.4003/006.038.0209", "year": 2021, "abstract": "Natural history collections are an invaluable resource that can inform systematic studies and biodiversity discovery, and also contribute to understanding changes in species abundance and distributions over time. The decline in abundance and diversity of Pacific Island land snails has been a major conservation concern for more than six decades, but only the largest and most colorful snails are protected under the US Endangered Species act, and few are listed as critically endangered on the IUCN Red List. Like most invertebrates, the conservation status of many Hawaiian land snails still need assessment. Molecular data are highly informative for revising species limits and understanding evolutionary patterns and processes, but with as much as 70% of Hawaiian land snails already extinct, few fresh samples are available from which to extract DNA. To overcome the lack of material suitable for DNA barcoding, we test whether short DNA fragments of 225 to 355 bp can be sequenced from museum snail shells containing dried tissues collected more than 50 years ago. Short DNA sequences (225 bp) were obtained from 66.7% of lots, while longer DNA sequences (355 bp) were successfully sequenced from 24.2% of lots. Snail specimens stored in natural history cabinets for more than 100 years were successfully sequenced, supporting the inclusion of these materials for modern biodiversity studies. Molecular data from this study represents a small proportion of Hawaiian microsnail species housed among the millions of specimens in the Bishop Museum in Hawaii and other natural history collections. Additional resources and focused efforts are needed to scale this approach to incorporate many more of the hundreds of snail species in need of assessment in Hawaii. More broadly, there are large representative collections of endangered Pacific Island non-marine snails in many natural history museums that may be suitable for molecular work, either with DNA barcoding or other genomic approaches."}