{"doi": "https://doi.org/10.1186/s12862-022-01972-4", "year": 2022, "abstract": "Species-rich semi-natural grasslands are impacted by the severe land-use changes that are affecting mountain regions, compromising their high biodiversity value. In particular, sprinkler irrigation and increased fertilisation stimulate vegetation growth, modifying and homogenising habitat conditions for ground-dwelling invertebrates. Among them, land snails have been largely understudied despite their commonness and vulnerability to small-scale habitat alteration. This study investigated the mid- and long-term responses of land snail communities to management intensification of montane and subalpine hay meadows. Mid-term effects were studied using a randomised block design experiment, mimicking an intensification gradient with different levels of irrigation and fertilisation applied during 5 years. Long-term effects were examined relying on an observational approach that consisted in comparing snail communities in meadows managed intensively for > 20 years with those from the 5-year experimental module.We show that management intensification initially boosts snail densities, but erodes species richness by - 35% in intensively-managed meadows in the long term. Contrary to our expectations, drought-tolerant (xerophilous) snails benefitted from grassland intensification, whereas mesophilous species accounted for most species losses due to intensification in the long run, indicating that the latter may be especially sensitive to the hostile microclimate conditions abruptly prevailing in a meadow after mowing. Soil pH was also a principal determinant of land snail occurrence, with almost no specimen recorded in acidic meadows (pH < 5.5), while plant diversity favoured overall snail abundance.Despite the fact that xerophilous snails appear tolerant to management intensification, we found that several drought-sensitive species are lost in the long term. We conclude that the preservation of species-rich land snail communities in mountain hay meadows requires the conservation and restoration of low-input grasslands on basic soils for preventing further species losses of gastropod fauna."}