{"doi": "https://doi.org/10.36885/nzdpm.2021.37.173-180", "year": 2022, "abstract": "The first finding of Cepaea nemoralis, an introduced species of land molluscs with polymorphic shell colouration, in the Ternopil region of Ukraine is described. Juveniles of this species were observed in Chortkiv already in 2017, but only in 2020 their exact species affiliation was identified, the presence of an established colony was confirmed and the peculiarities of its phenotypic composition were analyzed. The obtained data were compared with other colonies of the grove snail, which were found in Western Ukraine (Lviv and its environs, Bohorodchany in Ivano-Frankivsk region) in 2019-2020 and described in previous publications. Most of the conchological material collected in Chortkiv is deposited in the malacological collection of the State Museum of Natural History of the National Academy of Sciences of Ukraine in Lviv. In the Chortkiv colony of C. nemoralis, a hereditary trait was found, which occurs sporadically in the natural range of the grove snail, but has not yet been registered in Ukraine. This feature is manifested in the uneven pigmentation of dark spiral bands on the shell, the alternation of lighter and darker fragments on them, which can create the impression of spotted, interrupted bands. In the analyzed sample, such bands had 25.6% of banded shells, and they occurred twice as often in yellow (41.2%) than in pink (18.5%) shells. This agrees well with the known data on the linked inheritance of this trait and the ground colour of the shell. However, the shells with fused bands, regardless of their ground colour, almost always had normally pigmented bands, dark along their entire length. In some individuals with unevenly pigmented bands, the splitting of the fourth or fifth band into 2-3 narrow longitudinal bands was also observed. Another feature of the Chortkiv colony of C. nemoralis compared to other known Western Ukrainian colonies of this species is the very low frequencies of all lighter variants of the shell colouration (yellow and pink unbanded or with one central band) and a very high proportion of phenotypes with 3 lower bands (49.6%). The ratio of the main variants of the shell colouration of C. nemoralis in Chortkiv, which is not typical for Western Ukraine, makes the found colony a valuable object for studying potential adaptive changes in its phenotypic composition in the future."}