{"doi": "https://doi.org/10.21203/rs.3.rs-1328491/v1", "year": 2022, "abstract": "Abstract Background Oreohelix strigosa (Rocky Mountainsnail) is a land snail found in the talus slopes of the Rocky Mountains. The University of Colorado’s Museum of Natural History has densely sampled Oreohelix for the past century; many are preserved in ethanol and available for molecular research. While microbiome compositions in other systems are not affected by short-term field season preservation, the effects of decades-long preservation have yet to be assessed. Results We used 16S rRNA (ribosomal ribonucleic acid) gene amplicon sequencing to examine Oreohelix strigosa gut microbiomes from museum specimens across a 98-year range, as well as within short term preservation treatments collected in 2018. Treatment groups included samples extracted fresh, without preservation; samples starved prior to extraction; and samples preserved for 1 month, 6 months, and 9 months. General microbiome composition was similar across all years. Sample groups belonging to specific years, or specific short-term treatments, showed unique associations with select bacterial taxa. Collection year was not a significant predictor of microbial richness, though unpreserved short-term treatments showed significantly higher richness than preserved treatments. While year was a significant factor in microbiome composition, it did not explain much of the variation across samples. Other factors like location collected and drought index were also significant drivers of community composition and explained as much or more of the variability. Conclusions This study is the first to examine animal host associated microbiome change across a period of nearly one century. Generally, geographic location was a greater factor in shaping gut microbiome composition, rather than year collected. Consistent patterns across this temporal range indicate that historic specimens can answer many ecological questions surrounding the host associated microbiome."}