{"doi": "https://doi.org/10.5194/egusphere-egu22-5061", "year": 2022, "abstract": "&amp;lt;p&amp;gt;Like many of our fellow geoscientists, the early 2020 outbreak of the COVID pandemic caught us moving countries and universities. With field work cancelled and access to laboratories restricted, many research projects came to a pause. Working from home in a new, and not yet explored scientific and (sub)urban landscape presented serious challenges but also previously overlooked opportunities.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Here we report the results of a nearly two-year long monitoring of local temperature and isotopic composition of precipitation coupled with observations on the activity of the brown garden snail (&amp;lt;em&amp;gt;Cornu aspersum&amp;lt;/em&amp;gt;) in Great Park, Newcastle upon Tyne, northeastern UK. Land snail shells are often used as archives of past environmental conditions (temperature and/or precipitation), but untested assumptions on when they form their shells might bias the interpretation. Snails precipitate their carbonate shell only during the active growth phases, while they remain dormant when conditions are too cold (hibernation) or too dry (aestivation). Thus, depending on the regional/ local conditions snail shells constitute a seasonally biased environmental archive, but this fact is often either oversimplified or completely overlooked.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;The K&amp;amp;#246;ppen-Geiger climate classification defines UK climate as oceanic (Cfb temperate climate without dry season, but warm summers). Northeast England experiences maximum temperatures in summer (JJA) and lowest in winter (DJF), whereas precipitation is relatively homogenously distributed throughout the year, with highest rainfall in autumn and winter (SONDJF). Our local observations confirm that &amp;lt;em&amp;gt;C. aspersum&amp;lt;/em&amp;gt; is most active during the night and directly after rainfall. As expected, the Great Park snail population does not aestivate during summer but hibernates in winter, starting when temperatures drop below ca. 7&amp;amp;#176;C in late November. Contrary to expectations, the emergence from hibernation does not seem to be temperature- but precipitation-driven, and commences after the first heavy rainfall in May, independent of air temperature. Our ongoing monitoring work calls for careful assessment when interpreting the isotopic composition of fossil shells in terms of mean annual conditions.&amp;lt;/p&amp;gt;"}