{"doi": "https://doi.org/10.1101/2022.03.04.482990", "year": 2022, "abstract": "Abstract Host behaviour can be influenced by parasitic risk and infection through a variety of direct and indirect mechanisms. We can expect individuals expressing different phenotypes to also differ in the ways their behaviour is altered by parasites. We used the land snail Cepaea nemoralis , a species with various shell colour morphs differing in behaviour and physiology, as a model to study the link between parasite response and individual behaviour variation. We analysed metazoan parasite abundance and its relation to behaviour (movement and food intake) in snails from three shell morphs (from light unbanded to darker five-banded) and from two neighbouring populations from contrasted environments. Snails were parasitized by mites, trematodes and nematodes, from rarest to most frequent. We confirm that terrestrial gastropods can defend against infection by trapping parasitic nematodes in their shell. We show that nematode encapsulated in shells can uncover past infections even when a snail population is currently nematode-free, possibly due to parasite seasonality. We present new observations suggesting that not only nematodes but also mites might be encapsulated in shells. Infection levels varied between morphs, with darker snails harbouring fewer nematodes. Behaviour (movement and food intake) was linked to nematode, but not trematode infection. Individuals with higher nematode load ate less, irrespective of morph and population. The most-infected morph (unbanded snails) showed reduced activity in the nematode-infected population compared to the one that was nematode-free at sampling time. As a result, parasites may cancel previously described behavioural differences between morphs. We discuss the possible mechanisms explaining morph-dependent responses to parasites, and how parasite risk may be an unseen force shaping C. nemoralis morph variation in space and time. We conclude on the possible ecological consequences of the link, mediated by shell colour, between thermal and immune responses."}