{"doi": "https://doi.org/10.1111/ecog.06063", "year": 2022, "abstract": "Accurate ecological assemblage analysis requires that underlying taxonomic divisions reflect biological reality. However, the validity of many taxonomic hypotheses have never been rigorously confronted with replicable data. As a result, these categories might say more about human psychology than biology. We consider here the ways that statistically unchallenged taxonomic concepts can bias observed ecological pattern across multiple spatial scales. We compared assemblage lists for a group of Holarctic land snail species/subspecies hypotheses both before and after empirical confrontation. Of the 124 taxa initially believed to exist, only 105 were validated, with 34 being oversplit, another 15 being incorrectly lumped within 11 taxa and a final 33 having incorrect identification features. This led to considerable scale‐dependent alteration in assemblage patterns across 2528 sites within 42 regions and 9 biogeographic zones: depending upon location up to 90% of sites had revised composition with 10% showing a reduction in richness. Additionally, 6–60% of site pairs had altered turnover. These impacts became larger and more frequent with increasing sample grain and extent: 80–90% of regions and 100% of global biogeographic zones demonstrated altered composition, with 70–80% of regions and 100% of zones having changed richness. Reductions in richness also became more prevalent with increasing scale. Likewise, 80–94% of regional and zone pairs were found to have altered turnover, with increased similarity predominating at small and decreased similarity at large extents. Because these issues appear general and are not limited to land snail taxonomy, it is crucial for macroecologists to consider how unchallenged taxonomic concepts might bias their results. The use of objective and replicable data‐driven validation of all recognized taxonomic concepts is thus an essential foundation for accurate ecological hypothesis testing."}