{"doi": "https://doi.org/10.37745/ejafr.2013/vol10no1pp.49-55", "year": 2022, "abstract": "Yam peel is a fall out during processing of yam to pounded yam or yam flour and could be used as alternative means of energy in the nutrient of livestock. The aim was to know the consequence inclusion of dry yam peeling (YP) as substitute for maize in the diet of growing Giant African land snail on feed intake, weight gain, meat qualities and priced benefits. Yam peeled was substitute at 0% (YP1) Control, 25% (YP2), 50% (YP3) and 75% (YP4) as replacement for maize fraction in the nutrient of growing Giant African land snails. Each treatment was repeated thrice with 10 snails per replicate in a completely randomized design. Parameters taken or calculated were feed intake, weight gain, shell length and width, feed conversion ratio and priced per weight gain among others. Significant differences were observed in the mean total feed consumption of the snails fed inclusion levels of yam peel meal in the diets (P&lt;0.05) The main total feed consumed of 544.32 g was taken in YP1, it was relatively similar to YP3 the mean lowest feed consumed of 516.46g was taken in YP4. The result of feed efficiency indicated that snails fed 0% YP as a substitute for maize fraction of the diet has most feed efficiency (P&lt;0.05) and was not significantly different from YP3. The morbidity and mortality percent were very low in all the treatments. The main dressing percentage of 43.57% was taken in YP1 (P&lt;0.05) it was not significantly different from 43.45 % and 43.13 % in YP2 and YP3 accordingly. Mean total no of egg laid was significantly influenced by different inclusion levels (p&lt;0.05). From the study, it was revealed that weight gain, feed efficiency and dressing percentage were relatively similar in the snails fed zero percent diet and Fifty percent yam peel. The mean total number of egg laid and the size were not significantly different in the control and 50% inclusion, also the least cost per weight gain was recorded in YP3 containing 50% YP, hence maize fraction of the diet of snails could be substitute up to 50% of yam peel without any adverse effect."}