{"doi": "https://doi.org/10.1038/051524a0", "year": 1895, "abstract": "THE West Indian Archipelago has long been known to present some interesting problems in the distribution of its land fauna. These peculiarities, it will be remembered, led Wallace to infer the previous existence of a land connection of the greater islands with one another and with the mainland; while others have claimed that the islands have always been distinct, and have been colonised by the agency of currents, winds, and other indirect means of dispersal. An interesting contribution on this subject has recently appeared in the form of a study of the distribution of the West Indian land and fresh-water molluscs, by Mr. C. T. Simpson, of the U.S. National Museum, from whose paper we extract the following conclusions. A considerable portion of the land snail fauna of the Greater Antillean seems ancient and indigenous. There appears to be good evidence of a general elevation of the Greater Antilkan region, probably some time during the Eocene, after most of the important groups of snails had come into existence. At this time the larger islands were united, and were connected with Central America by way of Jamaica and possibly across the Yucatan Channel. There was then a considerable exchange of species between the two regions. At some time during this elevation there was probably a landway from Cuba across the Bahama plateau to the Floridean area, over which certain groups of Antillean land molluscs crossed. The more northern isles of the Lesser Antilles, if then elevated, have probably been since submerged. After the period of elevation there followed one of general subsidence, and first Jamaica, then Cuba, and afterwards Haiti and Puerto Rico were separated. The connection between the Antilles and the mainland was broken, and the Bahama region, if it had been previously elevated above the sea, was submerged, the subsidence continuing until only the summits of the mountains of the four Greater Antillean islands remained above the water. Then followed another period of elevation, which has lasted no doubt until the present time, and the large areas of limestone uncovered (of Miocene, Pliocene, and post-Pliocene age) in the.Greater Antilles have furnished an admirable field for the development of the groups of land snails that survived on the summits of the islands. The Bahamas and the Lesser Antilles were subsequently raised above the surface, and have been colonised by forms chiefly drifted in the former case from Cuba and Haiti, and in the latter case from South America, while a few stragglers have been carried by sea no doubt from the Greater Antilles, and have settled on the more northern of the Windward Islands."}