{"doi": "https://doi.org/10.1111/j.1095-8312.1999.tb01921.x", "year": 1999, "abstract": "Endemic land snails of the genus Mandarina of the oceanic Bonin Islands offer an exceptional example of habitat and character divergence among closely related species. In this study, microhabitat differences between sympatric ground-dwelling species were studied by distinguishing habitats on the basis of vegetation and types of litter. In all sites where two ground species coexisted, segregation occurred with each species showing preference for the microhabitat in which they were found. When they were in sympatry, one species was predominant in relatively wet and sheltered sites and the other in relatively dry and exposed sites. Although most species can live in both types of habitat, occupation by one species is inhibited by occupation by another. This suggests that competitive interaction between sympatric species caused segregation. Except for populations that have undergone interspecific hybridization, no examples were found of sympatric populations of two ground species sharing a similar shell colour. Species that were predominant in relatively wet and sheltered sites possessed shells with dark coloration and their colour patterns were mostly of one type. Species that were predominant in relatively dry and exposed sites possessed shells with bright coloration and their color patterns were polymorphic. Most populations from areas in which single species were distributed had shells with medium coloration. Microhabitat differentiation between sympatric species possibly caused diversification of shell colour, because bright shells are advantageous in sites where snails are largely exposed, and dark shells are advantageous in sites in where they are mostly sheltered from sunlight. In addition, frequency-dependent selection by predators hunting by sight may have operated to maintain colour polymorphism in the populations which are restricted to exposed habitats by competition with other sympatric species. This reveals the importance of interaction among closely related species as a cause of diversification in ecological and morphological traits."}