{"doi": "https://doi.org/10.21203/rs.2.22079/v1", "year": 2020, "abstract": "Abstract Background: Land use and land cover change significantly affects biodiversity, abundance and distribution of intermediate snail host fauna. In Omo-Gibe river basin the extent of land-use change is high due to anthropogenic activities leading to habitat change of freshwater snail intermediate hosts. Most intermediate snail hosts of human Schistosome parasites belong to two genera, Biomphalaria and Bulinus . In Addition, Lymnea spp. is another important host of Fasciola which causes fasciolasis in domestic animals and human. This study aims to assess the effects of land-use on the distribution and abundance of freshwater snail intermediate hosts and cercariae infection rates of fresh water intermediate snail hosts in Omo-Gibe River basin, Ethiopia. Methods: This study was conducted in Omo-Gibe river basin in 130 sampling sites which include rivers, lakes, dams, stream, wetlands and irrigation ditches. At each site data on land use, anthropogenic activities, freshwater snail abundance and species diversity, and water samples were collected. Snails were collected from each sampling sites using a scoop (20cm x 30cm) with a mesh size of 300µm. Snails were sorted by genus on Enamel pan using forceps and preserved in labeled vials containing 75% ethanol. Live snails collected from the same habitat were sorted carefully and put in clean plastic buckets half filled with water. Afterwards, snails were provided with fresh lettuce leaves and maintained in the laboratory. Snails were then identified morphologically to family, genus and to species level. Each snail was examined for cercaria shedding by placing in a petri dish containing water and exposed to the sun for 2 hours. Cercariae were morphologically identified by microscopy. ArcGIS software of version 10.3.1 was used to map snail distribution and data were analysed using SPSS version-20. Results: The results obtained in this study shows clearly that land use change affect the distribution and abundance of fresh water snails in Omo-Gibe river basin. Fresh water snails were more abundant in farmland and settlement areas. Of the total 2,559 freshwater snails collected from 130 surveyed sites in Omo-Gibe river basin, 1749 (68.34%) belongs to medically important snail species. Biomphalaria spp.914 (35.7%),, Lymnea spp.439 (17.1%),, Physa spp. 343(13.4%) and Bulinus spp 53 (2%)) . Sphaeriidae group accounted for 810 (31.6%) of the collected specimens. Biomphalaria pfeifferi was the predominant species of the total snail sampled from lakes, wetlands, rivers and irrigation ditches. Biomphalaria pfeifferi was the most infected snail species by different cercariae. Bulinus globosus and L.natalensis were infected by more than one and same type of cercariae. However, none of B. sudanica and P. acuta specimens was infected by trematode. Conclusions: The results of this study revealed that land use change altered the abundance, distribution and diversity of medically important fresh water snails in the study area. In general medically important freshwater snails which include: Biomphalaria spp, Bulinus spp and Lymnaea spp were collected from lakes, rivers, wetlands, irrigation ditches.. The medically important snail species found infected by cercaria are L. natalensis , B. pfeifferi and B. globosus . Biomphalaria pfefferi was the predominant species and highly infected by cercariae. Higher infection rate was observed in snails collected in Farmland (16.59%) and Grassland (36.6%)."}