{"doi": "https://doi.org/10.1007/978-90-481-9962-4_22", "year": 2011, "abstract": "This paper reports on a study of 892 fossil gastropod specimens from the Laetolil and Upper Ndolanya Beds at Laetoli and other sites on the Eyasi Plateau, Tanzania, collected between 1998 and 2005. The material examined represents a sample of a larger collection of over 5,000 specimens, including a large number of urocyclid slug shells. Sixteen gastropod species have been identified in the material and all can be assigned, with varying degrees of confidence, to recent genera of East African Mollusca. Ten species previously described from the site by B. Verdcourt in 1987 have been identified in the material, and a further six species have been newly recognized. The latter includes two new species that are described formally as Euonyma harrisoni sp. nov. and Halolimnohelix rowsoni sp. nov., and a further four species that can be assigned to generic level only – Cerastus sp., Subuliniscus sp., Streptostele sp. and Gulella sp. Overall the material is dominated by medium to very large shelled species, and, unlike many recent East African land-snail faunas, it contains very few micromollusks. It is considered unlikely that this reflects a methodological bias against small specimens during sampling, so it is probable that small species were absent from the Pliocene fauna or that they have not been preserved. The gastropod data and knowledge about the ecological affinities of the taxa concerned have been used to make inferences about the environmental conditions that prevailed during the Pliocene. Within the Upper Laetolil Beds, specimens have been assigned to one of a series of four stratigraphic subunits, thus enabling finer examination of the variation in environmental conditions over this period. The gastropod fauna from the Lower Laetolil Beds is highly distinctive, being dominated by large, robust achatinids and lacking urocyclid slugs. This suggests that conditions were relatively dry at that time, although not to the extent that they could be classified as semi-arid. Savanna habitats may have been prevalent over this period and large trees were probably absent or scarce. Several taxa vary in frequency across the subunits of the Upper Laetolil Beds, thus suggesting changes in ­environmental conditions over this period. The three lower subunits (up to Tuff 7) are characterized by high frequencies of Euonyma and Subulona, which would indicate the presence of woodland. Based on the gastropod data, woodland in the Upper Laetolil may have peaked between Tuffs 3–5. Above Tuff 7 the gastropod fauna changes to one dominated by Edouardia and Trochonanina, suggesting the return of more xeric conditions, perhaps comprising a savanna or bushland ecosystem associated with scattered trees or patches of woodland. The gastropod fauna of the Upper Ndolanya Beds is characterized by Euonyma and Subuliniscus and a high frequency of urocyclid slugs. This suggests the occurrence of woodland or possibly forest conditions, which appear to have been relatively widespread in the area since the same fauna appears to be present at all of the Upper Ndolanya Bed localities sampled. This conclusion differs from other reconstructions of the Upper Ndolanya environment using alternative lines of evidence, which suggests that the area was dominated by open woodland-bushland and grassland."}