{"doi": "https://doi.org/10.26686/wgtn.16984783.v1", "year": 2021, "abstract": "&lt;p&gt;Key aspects of the captive husbandry of Powelliphanta augusta, a newly-described New Zealand land snail are investigated: how they should be managed and fed to provide individuals for release, and how a long-term captive population can be maintained as an insurance against extinction in the wild. This project arises from almost all members of this species having been brought into captivity due to their displacement in the wild by an opencast coalmine. Powelliphanta (F: Rhytididae) is a genus of endemic carnivorous snails, which includes 10 species, 27 subspecies and numerous undescribed taxa. As well as its diversity, Powelliphanta is renowned for the large size of its members (up to 90mm diameter) and their attractively-patterned shells. Most taxa are threatened due to habitat loss and predation by introduced mammalian predators. The study commences with a literature review to refine husbandry methods and to assess requirements for captive breeding of snails. From this review investigations are made into stocking densities, substrate, reproductive biology, body condition and growth of the P. augusta captive population. To determine an appropriate stocking density for P. augusta groups of six snails were kept at two densities; with either 720cm2, or 1440cm2 per group. Survival and weight gain were compared over 52 weeks. There was no difference in weight gain between treatments, but survival was significantly reduced at the highest density. The agent responsible for mortality was not identified, but previous studies on snails implicate disease. The effect of calcium supplementation on reproductive output was assessed by introducing limestone chip to the captive substrate of sphagnum moss. The experiment was aborted after eight months because of the apparently lethal effects of treatment. Egg production during this time was negligible, probably due to the lack of appropriate environmental cues. P. augusta showed evidence of size-specific fecundity, with a significant increase in clutch size with parental shell volume. Size-specific fecundity is predicted to cause size-assortative mating, but experiments determined that mate-choice is random with respect to shell size.Body condition was studied using the residuals from a regression of mass and size at time of capture. Condition in the wild showed strong seasonal variation, with a high in December and January. Body condition in captive snails remained stable, at a level equivalent to the peak of condition in the wild. The growth of captive snails was modeled using a Gompertz curve. Using a 30mm shell diameter as a reproductive indicator, snails hatching in captivity are predicted to reach maturity in approximately eight years. The study concludes by discussing the implications of the research for husbandry. Updates and expansions to the analyses are suggested, as well as methods for effectively monitoring the captive population.&lt;/p&gt;"}