{"doi": "https://doi.org/10.7287/peerj.preprints.86v1", "year": 2013, "abstract": "Predator-prey interactions are among the main ecological interactions that shape the diversity of biological form. In many cases, the evolution of the mollusc shell form is presumably driven by predation. However, the adaptive significance of several uncommon, yet striking, shell traits of land snails are still poorly known. These include the distorted coiled “tuba” and the protruded radial ribs that can be found in micro-landsnails of the genus Plectostoma. Here, we experimentally tested whether these shell traits may act as defensive adaptations against predators. First, we identified the predators, namely, Atopos slugs and Pteroptyx beetle larvae, and their predatory strategies towards Plectostoma snails. Then, we characterised and quantified the possible anti-predation behaviour and shell traits of Plectostoma snails both in terms of their properties and efficiencies in defending against the Atopos slug predatory strategies, namely, shell-apertural entry and shell-drilling. The results showed that Atopos slugs would first attack the snail by shell-apertural entry, and, should this fail, shift to the energetically more costly shell-drilling strategy. We found that the shell tuba of Plectostoma snails is an effective defensive trait against shell-apertural entry attack. None of the snail traits, such as resting behaviour, shell thickness, shell tuba shape, shell rib density and intensity can protect the snail from the slug’s shell-drilling attack. However, these traits could increase the predation costs to the slug. Further analysis on the shell traits revealed that the lack of effectiveness these anti-predation shell traits may be caused by a functional trade-off between shell traits under selection of two different predatory strategies. Lastly, we discuss our results in the framework of Red Queen predator-prey coevolution and escalation, and propose several key elements for future study."}