{"doi": "https://doi.org/10.1554/04-521.1", "year": 2005, "abstract": "On the small oceanic island of Chichijima, two endemic species of land snails, Mandarina mandarina and M. chichijimana, have discrete distributions separated by a hybrid zone. This study investigates the potential of hybridization as a source of morphological novelty in these snails. Mandarina mandarina possesses a shell with a higher whorl expansion rate and a smaller protoconch than M. chichijimana, relative to shell size. The number of whorls and shell size of M. mandarina do not differ from those of M. chichijimana, because the effect of higher expansion rate on number of whorls and size of the former is compensated for by its smaller protoconch. The whorl expansion rate and protoconch diameter of the individuals from the hybrid populations are intermediate or typical of either of the two species, and their average values show clinal changes along the hybrid zone. However, the hybrid populations include exceptionally high shells with many whorls and flat shells with few whorls, which are never found in the pure populations of either species. In addition, gradual increases in variance in shell height and number of whorls were found from the edges to the center of the hybrid zone. A combination of low expansion rate (typical of M. chichijimana) and a small protoconch (typical of M. mandarina) produces a shell with an extremely large number of whorls because of the geometry of shell coiling. However, the combination of high expansion rate and a large protoconch produces a shell with an extremely small number of whorls. Because of the correlation between the number of whorls and shell height, shells with an exceptional number of whorls possess an extraordinarily high or flat spire. Hybrids can inherit a mosaic of characters that, as they play out during growth, lead to novel adult morphologies. These findings emphasize the importance of hybridization as a source of morphological variation and evolutionary novelty in land snails."}