{"doi": "https://doi.org/10.7882/az.2022.010", "year": 2022, "abstract": "ABSTRACT This study aimed to improve our understanding of the immediate response of 26 priority species of land snail that may have been severely impacted by the 2019/2020 megafire event in north-eastern New South Wales. Our study covered a range of ecosystem types over an area of approximately 20,400 km2. We searched 70 survey sites that differed in burn severity for all species of land snail visually on-site and by sifting leaf litter samples under a microscope in the laboratory. These survey sites were selected for representing pre-existing occurrence records of priority species at sites that differed in mapped fire severity classes as based on Fire Extent and Severity data available from public sources. We also surveyed unburnt sites for comparative purposes. We found that nearly all survey sites encompassed a patchwork of areas with different burn extent and severity and that more humid forest types were overall affected by lower fire extent and severity than surrounding more xeric forest types. Only one site with extreme fire extent and severity was surveyed. The survey covered 165 historical occurrence records, 96 of which (58%) were re-confirmed. We also found 55 new occurrence records, 11 of which were in burnt and 44 in unburnt sites. Burnt and unburnt sites showed slight, yet insignificant differences in the redetection rate of species, which was generally low (on average 50–65%). Our data does not reveal an association between the number of specimens found at sites and burn severity and extent (from unburnt to extreme burnt). While we infer that populations have declined in areas affected by more severe fires, we found proportions of the survey area to be affected by fires of lower severity, which likely did not substantially affect the size of local land snail populations. Based on this, we conclude that initial concerns that the bushfires had led to a substantial deterioration of the conservation status of land snails are not generally corroborated. Instead, we have assessed just 3 species (10% of all studied species) as of conservation concern and 7 species (23%) as near threatened due to direct impacts of the 2019/2020 megafires. However, the paucity of occurrence records for many species and our limited knowledge of their ecology hampers a more detailed assessment of the potential fire impacts on many species, including possible on-going threats. Long-term monitoring and research are critical to ensure effective management especially of narrow range endemics."}