{"doi": "https://doi.org/10.3923/pjbs.2022.765.775", "year": 2022, "abstract": "&lt;b&gt;Background and Objective:&lt;/b&gt; Studying the population dynamic of the invasive terrestrial snails as agricultural pests, is essential for designing pest control program to reduce the economic losses to commercial field crops, vegetables and fruits. The population dynamic had been estimated for the three terrestrial snails &lt;i&gt;Theba pisana &lt;/i&gt;(Müller, 1774) (Helicidae), &lt;i&gt;Eobania vermiculata &lt;/i&gt;(Müller, 1774) (Helicidae) and &lt;i&gt;Monacha obstructa&lt;/i&gt; (Pfeiffer, 1842) (Hygromiidae) on orange, apple and mango trees in horticultural fields in two locations. These locations are Nobaria City, Beheira Governorate and Mansouria Village, Giza Governorate. This study carried out during the two consecutive activity seasons September, 2018/August, 2019 and September, 2019/August, 2020. &lt;b&gt;Materials and Methods:&lt;/b&gt; The population dynamic, incidence and infestation level of terrestrial snails had been recorded on economic host plants such as fruit trees and other field crops and vegetables. The correlations between climatic factors and the population density of land snails were interpreted by statistical analysis for the two seasons. &lt;b&gt;Results:&lt;/b&gt; The population density of terrestrial snails increased gradually after winter to reach its maximum density during spring, while the lowest density was recorded in August. The incidence and infestation level of terrestrial snails varied according to the host plant, climatic factors and locality. &lt;i&gt;Eobania vermiculata&lt;/i&gt; were the dominant land snail species in Beheira, while &lt;i&gt;Monacha obstructa&lt;/i&gt; infested the majority of the examined fruit trees in Giza. &lt;b&gt;Conclusion:&lt;/b&gt; Determining the activity and inactivity periods of land snails through the two seasons and their population dynamic will assist in designing effective control management program to decrease the number of pest and the economic losses of agricultural products."}