{"doi": "https://doi.org/10.3390/rs14153707", "year": 2022, "abstract": "Snail intermediate host monitoring and control are essential for interrupting the parasitic disease schistosomiasis. Identifying large-scale high-risk areas of snail spread after floods has been greatly facilitated by remote sensing imagery. However, previous studies have usually assumed that all inundation areas carry snails and may have overestimated snail spread areas. Furthermore, these studies only used a single environmental factor to estimate the snail survival risk probability, failing to analyze multiple variables, to accurately distinguish the snail survival risk in the snail spread areas. This paper proposes a systematic framework for early monitoring of snail diffusion to accurately map snail spread areas from remote sensing imagery and enhance snail survival risk probability estimation based on the snail spread map. In particular, the flooded areas are extracted using the Sentinel-1 Dual-Polarized Water Index based on synthetic aperture radar images to map all-weather flooding areas. These flood maps are used to extract snail spread areas, based on the assumption that only inundation areas that spatially interacted with (i.e., are close to) the previous snail distribution regions before flooding are identified as snail spread areas, in order to reduce the misclassification in snail spread area identification. A multiple logistic regression model is built to analyze how various types of snail-related environmental factors, including the normalized difference vegetation index (NDVI), wetness, river and channel density, and landscape fractal dimension impact snail survival, and estimate its risk probabilities in snail spread area. An experiment was conducted in Jianghan Plain, China, where snails are predominantly linearly distributed along the tributaries and water channels of the middle and lower reaches of the Yangtze River. The proposed method could accurately map floods under clouds, and a total area of 231.5 km2 was identified as the snail spread area. The snail survival risk probabilities were thus estimated. The proposed method showed a more refined snail spread area and a more reliable degree of snail survival risk compared with those of previous studies. Thus, it is an efficient way to accurately map all-weather snail spread and survival risk probabilities, which is helpful for schistosomiasis interruption."}