{"doi": "https://doi.org/10.1016/j.envpol.2022.119691", "year": 2022, "abstract": "The glass clover snail, Monacha cartusiana (M. cartusiana) is one of the most seriously impacting economic animal pests spreading across Egypt which inflicts severe damages to the agriculture. A green route is developed by deploying an abundant Rosemary plant leaves aqueous extract to synthesize ZnO and F-doped ZnO (F-ZnO) nanoparticles (NPs) that display high molluscicidal activities against the M. cartusiana land snails via leaf dipping and contact techniques. The effect of lethal concentrations, that kills 50% of exposed snails (LC50) value of the treatments, is examined on the activity of alkaline phosphatase (ALP), aspartate aminotransferase (AST), alanine aminotransferase (ALT), enzymes, total protein (TP), total lipids (TL) and cholesterol level of snails, including the histopathological evaluation of the digestive gland and foot of M. Cartusiana. Their molluscicidal activity as poisonous baits under field conditions is also evaluated and compared to the recommended molluscicide, Neomyl. The results show that F- doping dramatically improves the snail control capability of ZnO NPs, and promotes a considerable increase in both ALT and AST enzymes with an enhancement of TL and Cholesterol levels, but a significant decrease in TP content and ALP activity in treated snails compared to the control group. The LC50 values are found to be 1381.55 and 2197.59 ppm using the leaf dipping for F-ZnO and ZnO, while 237.51 and 245.90 ppm can be achieved using the contact technique, respectively. The greenly synthesized F-ZnO and ZnO NPs induce severe histological alterations in the digestive gland and foot of M. cartusiana, including a complete destruction of the digestive tubules. The histological evaluation of the foot of M. cartusiana exposed to ZnO, shows a rupture of the epithelial layer of the foot sole, while F- ZnO NPs causes the folds of the foot becoming deeper and the rupture of epithelial layer. Our field experiments further demonstrate that F-ZnO achieves 60.08% reduction, while ZnO attains 56.39% diminution in snail population compared to the commercial, Neomyl (69.55%), exhibiting great potentials in controlling the harmful land snail populations."}