{"doi": "https://doi.org/10.1111/geb.13517", "year": 2022, "abstract": "Abstract Aim We document realized and potential global species ranges based on empirically vetted species concepts in conjunction with global climate databases and climate suitability modelling. From this we investigate the nature of dispersal barriers and illustrate how they generate ecological uniqueness. Location Holarctic. Methods Fifty‐two small body‐size (i.e. &lt; 5 mm) land snail taxa within the genera Euconulus , Pupilla and Vertigo were considered. These represent ~10% of all small body‐size Holarctic land snails and are among the most proficient known passive dispersers. Their potential climatic ranges were determined using Maxent modelling based on 9205 occurrence records. From these we inferred the location, width and nature of isolating barriers and tested for their effects on regional species pool richness and turnover. Results Use of unvetted traditional taxonomic concepts and unverified occurrence records would have created up to threefold higher or lower estimates of species‐specific climatic tolerances than the actual values. Modelling must thus only use high quality occurrence data. All but one taxon were shown at a global scale to possess multiple isolated areas of appropriate climate. While oceans represented the most common barrier (37%), intra‐continental barriers were in total almost twice as frequent (inappropriate climate – 29%, habitat/history – 27% and the Greenland ice sheet – 7%). These barriers restricted taxa to only a subset of their potential range, with European taxa possessing approximately twice the global occupancy rates as North American ones (median scores of 62 vs. 34%). As a result, regional taxa pools were three times smaller than their potential sizes, with 50% change in composition occurring over ~2600‐km distances. Main conclusions Even for these readily dispersing taxa, isolation barriers prevented species from saturating their potential global range, reduced the size of regional species pools by 2/3, and generated ecological uniqueness between them."}