{"doi": "https://doi.org/10.1071/is21075", "year": 2022, "abstract": "Figuladra is a poorly understood genus of camaenid land snail endemic to subtropical eastern Australia, comprising species that inhabit either dry rainforests in the coastal hinterland or dry sclerophyll forests further inland. Given that the genus occurs in areas that have seen extensive land clearing, such as the inland brigalow scrub (savannah) and coastal vine thickets (dry rainforest), resolution of this genus is required to inform conservation efforts within these critical landscapes. Here we use an integrative approach based on comparative analyses of mitochondrial DNA sequences and key morphological features to review the systematic relationships within the group. Specifically, we performed Maximum Likelihood and Bayesian analyses of concatenated DNA sequences of two partial mitochondrial genes (16S and COI) to reconstruct the phylogenetic relationships of Figuladra. We subsequently examined features of the reproductive system that are considered to be useful in diagnosing genera (whole genitalia) and species (penial architecture) within the Camaenidae. Based on patterns of molecular differentiation and an assessment of the anatomy, we propose a more restrictive definition of Figuladra and describe two new monotypic genera for species that were previously assigned to Figuladra; Euryladra gen. nov. for Varohadra incei mattea Iredale, 1933 and Brigaladra gen. nov. for Varohadra volgiola Iredale, 1933. These two new genera differ from Figuladra sensu stricto in exhibiting distinctive epiphallic coiling patterns and anatomical differences of the penis–epiphallus configuration. The study shows that these three genera, and allied taxa, reveal contrasting patterns of diversity and distribution in two neighbouring habitat types: high levels of diversity and endemism in fire-sensitive seasonal subtropical forests juxtaposed against low diversity in large intervening areas of regularly burnt savannah and open woodlands."}