{"doi": "https://doi.org/10.4236/ojas.2022.123041", "year": 2022, "abstract": "To contribute to the diversification of protein sources, the conservation and preservation of the Giant African Land Snails (Archachatina marginata), a study was carried out between March and July 2019 at the Helvy Farms-WVED Cameroon located at Station Bamenda to investigate the effect of three calcium sources on their growth performance and carcass characteristics. 180 juvenile snails aged 4 months initially weighing between 24.2 and 28.5 g, shell length ranging between 40.25 - 48.35 mm, and shell diameter of between 14.08 - 18.44 mm were randomly allotted to 3 treatments containing each a different calcium source (crushed snail shell, eggshell and agricultural limestone) and a control treatment constituted of natural plant feeding materials of the snail. There were 45 snails per treatment, constituted of three replicates with 15 snails per replicate. Each replicate was housed in well-constructed surface trench pens equipped with drinking and feeding troughs. The basal diet made up of feedstuffs like pawpaw leaves and watermelons was provided ad libitum. The initial weights of the snails were recorded at the start of the experiment followed by weekly weight measurements, while the snail length and width were measured with a digital caliper of 0.05 mm accuracy. The snails were monitored for a period of 21 weeks and data was collected for 20 weeks after a 1 week adaptation period. The results showed that the weight gain (g) of snails for diets containing calcium sources in the supplemental diets were all significantly higher (P < 0.05) than the corresponding values recorded for the control diet with natural plant material. It was observed that the shell length (0.34 ± 0.02), shell width (0.16 ± 0.02), weight gain (13.13 ± 0.03) and feed conversion efficiency (1.977 ± 0.11) were highest in snails fed snail shell diet as calcium source compared with snails from other treatments. These values were however not significantly higher than corresponding values for the other two supplemental diets containing eggshell or agricultural limestone. It can be deduced that the snail shell is an important calcium source for growing snails and can be adopted and used in the diets of snails. This will amount to some good methods of recycling in snail production."}