{"doi": "https://doi.org/10.3897/zookeys.1119.85400", "year": 2022, "abstract": "Thailand is located at the crossroads of several biogeographical regions, and boasts a high level of biodiversity, especially among the malacofauna. The most recent checklist of land snail species in Thailand was compiled more than twenty years ago, and so this checklist needs revision and the addition of newly discovered taxa. This study updates the taxonomy and species list of the operculated land snail family Pupinidae from Thailand. This snail family is diverse and abundant, and can be found in various natural habitats in Southeast Asia. Although the taxonomy of some Southeast Asian pupinid genera has been reviewed, studies of Pupina Vignard, 1829, which contains the highest number of species, and a lesser-known genus Pupinella Gray, 1850 are still lacking. Herein we present an annotated checklist with an up-to-date systematic framework of the Pupinidae in Thailand based on both field investigations and literature surveys, and include the taxonomic treatment of all Pupina and Pupinella species from mainland Southeast Asia. This annotated checklist contains 30 nominal species and two subspecies from seven genera currently known to occur in Thailand. We describe two species of Pseudopomatias (P.doiangkhangensis Jirapatrasilp, sp. nov. and P.pallgergelyi Jirapatrasilp, sp. nov.), five species and one subspecies of Pupina (P.bensoni Jirapatrasilp, sp. nov., P.bilabiata Jirapatrasilp, sp. nov., P.godwinausteni Jirapatrasilp, sp. nov., P.latisulci Jirapatrasilp, sp. nov., P.stoliczkai Jirapatrasilp, sp. nov., and P.dorriisanensis Jirapatrasilp, ssp. nov.) as new to science. New records of Coptocheilussumatranus, Pupinellamansuyi, and Rhaphaulustonkinensis are also reported from Thailand. The mainland Southeast Asian Pupina species are classified into three species groups (Pupinaartata group, Pupinaarula group, and Pupinaaureola group) based on the distinction of shell teeth and canals, and operculum. Three species formerly in Pupina from Vietnam are allocated to Pupinella (P.illustriscomb. nov., P.sonlaensiscomb. nov., and P.thaitranbaiicomb. nov.) due to the presence of a funnel-like anterior canal."}