{"doi": "https://doi.org/10.1111/jbi.14531", "year": 2022, "abstract": "Abstract Aim Were postglacial recolonizations facilitated by persistence close to the colonized areas rather than by dispersal ability allowing for colonization from distant sources? This question is particularly relevant for organisms with low active dispersal abilities and lacking specialized propagules. Here we identified glacial refugia of four Central European land snail species, including one for which a northern glacial refugium in the region was indicated by indirectly dated fossils. Location Central Europe and the Balkans. Taxon Pulmonate land snails: Monachoides incarnatus (Hygromiidae) and Helix pomatia , Helix thessalica and Caucasotachea vindobonensis (Helicidae). Methods We used continuous phylogeographic analysis of mitochondrial sequence data to trace the origin of postglacially expanding lineages. We assessed the credibility of results from our focal species, M. incarnatus , by comparison to three other broadly sympatric land snail species. In addition, we performed direct radiocarbon dating of fossil shells to verify the presumed glacial presence of M. incarnatus on the territories of Czechia and Slovakia and to test the reliability of the available fossil data. Results In three of the four species, the molecular data supported refugia located south of the Pannonian Basin, from the south‐eastern Alps to the south‐western Carpathians, but not more northerly. The direct radiocarbon dating resulted in younger dates than previously assumed. However, the molecular data also revealed unexpected, yet substantial postglacial southward expansions of M. incarnatus and C. vindobonensis into the Balkans. Main Conclusions Neither the phylogeographic analyses nor the direct radiocarbon dating provided evidence for the glacial survival of studied land snail species in Central Europe. The refugia located adjacent to the Pannonian Basin were the most important source of postglacial expansions to Central Europe, but were also the source of the expansion southwards. Both climatic factors and biological interactions might explain why such southward expansions seem rather rare in Europe."}