{"doi": "https://doi.org/10.55431/jco.2022.35.90-95", "year": 2022, "abstract": "&#x0D; Abstract Snails preyed upon by the Grenada Hook-billed Kite (Chondrohierax uncinatus mirus) were collected from two nesting sites in different regions and habitats on Grenada, with the aim of better understanding the diet of this endemic and endangered subspecies. Apart from the large snail Megalobulimus oblongus, which was present in the environment but not consumed by the kites, all five species previously reported in the literature (Bulimulus wiebesi, Plekocheilus glaber, Drymaeus binominis, Orthalicus zebra, and Pleurodonte perplexa) were documented as prey. Land snail species occur in variable numbers according to habitat type and localized environmental conditions, illustrating the kite’s ability to exploit distinct areas of the island. Land snails consumed by the kite included both arboreal and ground-dwelling species, representing all the medium-sized (20–40 mm) species occurring on Grenada. Variation in snail species proportions were evident when comparing assemblages collected beneath nests to those scattered in the immediate vicinity of nests, suggesting seasonal factors or species selection for feeding young may influence the kite’s food habits.&#x0D; &#x0D; &#x0D; Keywords Chondrohierax uncinatus, diet, Grenada, Hook-billed Kite, snail consumption&#x0D; &#x0D; &#x0D; Resumen Variabilidad de la dieta de Chondrohierax uncinatus mirus • Se recolectaron caracoles depredados por Chondrohierax uncinatus mirus en dos sitios de nidificación ubicados en diferentes regiones y hábitats de Granada, con el objetivo de comprender mejor la dieta de esta subespecie endémica y en peligro de extinción. A excepción del caracol de gran tamaño Megalobulimus oblongus, que estaba presente en el entorno pero que no fue consumido por los gavilanes, se confirmaron como presas las cinco especies anteriormente citadas en la literatura (Bulimulus wiebesi, Plekocheilus glaber, Drymaeus binominis, Orthalicus zebra y Pleurodonte perplexa). Las especies de caracoles terrestres se encuentran en números variables según el tipo de hábitat y las condiciones ambientales locales, lo que ilustra la capacidad de esta rapaz para explotar distintas áreas de la isla. Los moluscos terrestres consumidos por esta aves incluyen especies tanto arborícolas como terrestres, que representan todos los taxones de tamaño mediano (20–40 mm) que se encuentran en Granada. La variación en las proporciones de las especies de caracoles fue evidente al comparar los grupos recolectados bajo los nidos con los dispersos en sus inmediaciones, lo que sugiere que factores estacionales o la selección de especies para alimentar a las crías pueden influir en los hábitos alimentarios del gavilán.&#x0D; &#x0D; &#x0D; Palabras clave Chondrohierax uncinatus, consumo de caracoles, dieta, Granada&#x0D; &#x0D; &#x0D; Résumé Variabilité du régime alimentaire du Milan bec-en-croc de Grenade (Chondrohierax uncinatus mirus) • Les escargots consommés par le Milan bec-en-croc de Grenade (Chondrohierax uncinatus mirus) ont été collectés sur deux sites de nidification situés dans des environnements distincts de façon à mieux documenter le régime alimentaire de ce rapace endémique et menacé. En dehors du très gros Megalobulimus oblongus, présent dans l’environnement mais non consommé par le milan, les cinq espèces précédemment rapportées dans la littérature ont été retrouvées (Bulimulus wiebesi, Plekocheilus glaber, Drymaeus binominis, Orthalicus zebra, Pleurodonte perplexa). Les espèces d’escargots terrestres sont présentes en nombre variable selon le type d’habitat et les conditions environnementales locales, illustrant la capacité du milan à exploiter des zones distinctes de l’île. Les mollusques terrestres dont se nourrit le milan comprennent des espèces arboricoles ou vivant au sol, représentant tous les taxons de l’île dont la longueur de coquille est comprise entre 20 et 40 mm. Des variations dans les proportions des espèces d’escargots étaient évidentes en comparant les assemblages collectés sous les nids à ceux présents dans leur voisinage immédiat, ce qui suggère que des facteurs saisonniers ou la sélection des espèces pour l’alimentation des jeunes peuvent influencer les habitudes alimentaires du milan.&#x0D; &#x0D; Mots clés Chondrohierax uncinatus, consommation d’escargots, Grenade, Milan bec-en-croc, régime alimentaire"}