{"doi": "https://doi.org/10.1016/j.palaeo.2022.111309", "year": 2023, "abstract": "The carbon isotopic composition of land snail shells (δ13Cshell) potentially reflects changes in vegetation composition and thus precipitation. To better assess the response of δ13Cshell to East Asian monsoon (EAM) precipitation in different regions, we investigated the δ13C of modern snail shells and the corresponding surface soil and vegetation in Hainan Island, in the tropical monsoon region of China. This region spans a large mean annual rainfall gradient (1250–2300 mm), but it has a very small range of mean annual temperature (∼2 °C). We found that the most depleted δ13Cshell value (−18.5‰) reported in this study is more negative than previously reported in the literature, and that δ13Cshell in Hainan Island mainly reflects the δ13C of C3 plants, indicating the C3 dietary preference of snails. After confirming that δ13Cshell is a reliable precipitation proxy in Hainan Island, we produced a new general equation between δ13Cshell and precipitation, combining our data from Hainan Island with that from previous studies in the EAM region: δ13Cshell = −0.0025 (±0.0002) MAP – 9.0841 (±0.23) (n = 131, r = −0.73, p < 0.01). A comparison of the slope of the linear equation for Hainan Island (δ13Cshell = −0.003 (± 0.0007) MAP - 7.5619 (± 1.27), n = 18, r = −0.74, p < 0.01) with that of Bao et al. (2019), with a larger temperature range (>10 °C), enabled us to validate that temperature in the EAM region has little effect on δ13Cshell compared to precipitation. We also conducted a theoretical evaluation of the effect of temperature on δ13Cshell using a flux balance model, which confirmed that the δ13Cshell–precipitation proxy is insensitive to temperature variations, considering temperature effects on the fractionation coefficient and the δ13C of C3 plants, where C3 plants are the dominant plant type. Our results potentially enable the quantitative reconstruction of paleo-precipitation via the δ13Cshell of snail fossils in the sedimentary deposits of the EAM region."}