{"doi": "https://doi.org/10.56899/151.05.14", "year": 2022, "abstract": "The diversity of land snails in Leyte Island has not been examined over the past few years. To address this, a survey of macro land snails (&gt; 5 mm in shell height and diameter) in selected forest fragments of Leyte was conducted. A total of 120 quadrats (10 x 10 m) were set in three sampling sites (Inopacan, Baybay, and Maasin) that varies in area size – with Baybay being the largest fragment, followed by Inopacan and Maasin. From a total of 592 individuals, 22 macro land snail species and five families were identified. The macro land snail assemblage was dominated by endemic eupulmonates (Order Stylommatophora) and caenogastropods (Order Architaenioglossa). Among eupulmonates, Family Camaenidae had the most species (10), followed by Trochomorphidae and Achatinidae (two each), and Helicarionidae (one). For caenogastropods, all seven species were under Family Cyclophoridae. Cyclophorus appenidiculatus was the most abundant, representing 16.65% of the total number of individuals. Lissachatina fulica, an invasive land snail, was also documented in all sites. A β-dominated community assemblage was revealed by species accumulation curves with sampling efficiency using a completeness ratio of 1, which indicates a highly efficient sampling method. Detrended correspondence analysis indicated high similarity in species composition among study sites, with two unique species (Subulona cylindracea and Hypselostyla boholensis) recorded in Maasin and two incidental records (Obba bigonia and Helicobulinus sarcinosa). This study yielded 15 new records of macro land snail species during the sampling. There were five species (Hemiglypta semiglobosa, Amphidromus maculiferus, Leptopoma perlucidum, Chloritis leytensis, and Obba bigonia) that were documented on earlier records on the island, but 33 of the previously recorded macro land snail species were not encountered in the study. The community ecology patterns were also documented in the fragmented forests of Leyte, which is very important in local malacofaunal conservation and management."}