{"doi": "https://doi.org/10.32718/nvlvet-a9707", "year": 2022, "abstract": "Heliculture (also sometimes called heliculture or simply snail farming) is the human activity of collecting, breeding, and growing edible species of land snails for food and cosmetic purposes. The meat and caviar of snails are eaten, and the mucus is used as a cosmetic. Breeding snails in artificial conditions is a profitable business that few people know about and which can bring a lot of pleasure and a good income. In our country, snails are exotic, and in many European countries this product is common and often eaten. The most famous species of edible land snail can be considered the grape snail Helix pomatia, also sometimes called the Burgundy snail. This species, however, is not suitable for commercial breeding. The two most popular species for commercial breeding are Cornu aspersum, also known as Helix aspersa muller, and Helix aspersa maxima. Intensive fishing of the mollusk Helix pomatia in Ukraine has led to the fact that the world's natural resources have been drastically reduced, which is why this type of mollusk needs careful attention. A number of scientists and farmers prove the prospects of obtaining extracts from the mucus of terrestrial molluscs and the production of medicinal and cosmetic preparations based on them. However, the population of this species in natural conditions has sharply decreased, in connection with which there is a need for artificial breeding of terrestrial molluscs. It is necessary to take into account that snails are a specific product that must be constantly improved and made competitive. It is for these purposes to carry out large-scale mating and breeding of snails with the aim of further processing of caviar and mucus for pharmaceuticals and cosmetology. It is necessary to have sufficient experience in this field and a good organization of work, which will allow the producer to offer a wide range of snail meat, both ready-made products for food purposes, and stock of mother herds for breeding by the next generation of starting farms."}