{"doi": "https://doi.org/10.32011/txjsci_74_1_note2", "year": 2022, "abstract": "Microbial communities from animal gastrointestinal tracts play diverse and important roles in many processes (Kostic et al. 2013; Sommer et al. 2016; Kerwin et al. 2019). Gut microbiomes are sensitive to numerous aspects of a species’ life history including habitat, diet, and development (Colman et al. 2012; Llewellyn et al. 2016). While gut microbiomes are known from across the animal kingdom, few examinations of invertebrates have been made (Petersen &amp; Osvatic 2018); this trend applies to mollusks and gastropods specifically as well (Newton et al. 2013). Gastropods are a diverse group of invertebrates and one of the few animal taxa that successfully colonized terrestrial, aquatic, and marine environments. Few land snail gut microbiomes have been studied besides those of the invasive giant African snail Achatina fulica, thus limiting our understanding of the complex interactions between these organisms and their flora (e.g., Chalifour &amp; Li 2021; Jackson et al. 2021). In an effort to increase our knowledge of terrestrial gastropod microbiomes, we undertook a descriptive and comparative analysis of gut microbes from two species of polygyrid snails.Family Polygyridae comprises nearly 300 species of land snail found across North America (Perez et al. 2014). Polygyrids are some of the most commonly encountered and conspicuous snails found across their range (Pilsbry 1940; Emberton 1994). Polygyrids are herbivores and detritivores that often favor calcium-rich environments including rock outcrops (Walsh &amp; Coles 2002; Dourson 2009; Martin &amp; Bergey 2013). Forty-one species of polygyrid snail are known from Texas (Perez et al. 2020); three of those species can be found in dry urban areas in the lower Rio Grande Valley of south Texas (Perez et al. 2021). This study focused on two of the south Texas polygyrids, Polygyra cereolus (Mühlfeld, 1816) and Praticolella mexicanaPerez, 2011 (Figure 1). Polygyra cereolus is a small land snail native to Florida with a flattened discoid shell (height 3.5–4.5 mm, width 12–15 mm). The shell is brownish with fine ribs and the aperture has a single parietal tooth. Praticolella mexicana is a Mexico and south Texas native that possesses a small (height 7–8 mm, width 10–11 mm) brown shell with white pigmentation. Shells of Pr. mexicana have a smaller height/width ratio compared to other similar species in the genus (Perez 2011). Both species have been widely introduced across the globe, presumably in shipments of ornamental plants and building materials (Perez 2011; Charles &amp; Lenoble 2020). Given their similar life histories as colonizers, presumed dietary intakes, and overlapping distributions in south Texas, we predicted that the gut microbiomes from both species would not significantly differ in terms of community and taxonomic structure.Eight Polygyra cereolus were collected from a single location adjacent to the Bronc Trail on the campus of the University of Texas Rio Grande Valley (UTRGV), Edinburg, Texas. An additional seven Praticolella mexicana were collected from a residential backyard in McAllen, Texas. Snails were stored in 95% ethanol, then the stomach and intestine of each snail was dissected out, rinsed in sterile water, and dissolved in CTAB buffer (1% CTAB, 100 mm Tris-HCl, 20 mM EDTA, 1.4 M NaCl, pH 8.0) with proteinase K (0.4 mg/sample) at 60º C. DNA extraction utilized portions of the E.Z.N.A Mollusk DNA kit (Omega Biotek, Norcross, GA). Samples were mixed with one volume of BL buffer, then with one volume 100% ethanol, and transferred to HiBind columns; column washing and DNA elution followed the manufacturer’s protocol. DNA samples were sent to Molecular Research LP (Shallowater, TX) for library construction and sequencing of the 16S rDNA gene V4 region using the 516/806 primer set (Caporaso et al. 2011) and Illumina technology.Molecular Research LC (Shallowater, TX) performed all quality control on the sequencing output using their proprietary pipeline. Briefly, sequences were depleted of primers and short sequences less than 150bp and sequences with ambiguous base calls were removed. Sequences were quality filtered using a maximum expected error threshold of 1.0, dereplicated, and denoised; unique sequences identified with sequencing or PCR point errors were removed followed by chimera removal and end trimming. Operational taxonomic units (OTUs) were assembled using the de novo assembly function in Geneious Prime 2021.2.2 (Biomatters Ltd., San Diego, CA) with no more than 1% gaps per read, at least 100 bp overlap between reads, and a minimum 98% overlap identity. Final OTUs were taxonomically classified against the NCBI prokaryotic 16S reference database National Center for Biotechnology Information 2021) using Geneious Prime. Sequence classification used the “high sensitivity/medium” setting with 100 bp overlap and minimum 97% overlap for reporting the lowest possible taxonomic assignment at the phylum and family levels (Schloss &amp; Handelsman 2005; Johnson et al. 2019). Beta diversity was assessed between snail species through pairwise generalized UniFrac distances (Lozupone &amp; Knight 2005; Chen et al. 2012) matrices in QIIME2 (Bolyen et al. 2019) and compared using PERMANOVA at P &lt; 0.01 (Anderson 2001). Significant taxonomic differences between snail species were identified in ALDEx2 (Fernandes et al. 2014) for effect sizes ≥ 1.0 and estimated P-values &lt; 0.1 (Welch’s t-tests controlled for Benajmini-Hochberg false-discovery rates [Welch 1947; Benjamini &amp; Hochberg 1995]).Illumina sequencing produced an average of 28,426 reads per individual snail sample and 1,207 OTUs were found across all samples. PERMANOVA analysis of generalized UniFrac distances suggested that the bacterial communities of the two snails were significantly different (F = 3.82, P &lt; 0.01). The relative abundances of bacterial phyla and families for each snail species are shown in Table 1 and Table 2 respectively. Proteobacteria was the most abundant phylum in both Po. cereolus and Pr. mexicana; four additional bacterial phyla were present at abundances of ≥ 1% in both species. Of the phyla with abundances ≥ 1%, Acidobacteria and Tenericutes were significantly more abundant in Po. cereolus and Actinobacteria and Bacteroidetes were more abundant in Pr. mexicana. At the family level and ≥ 1% abundance, the Po. cereolus microbiome contained significantly more Blastocatellaceae and Legionellaceae, while Pr. mexicana had higher abundances of Aurantimonadaceae, Phyllobacteriaceae, Sphingobacteriaceae, Sphingomonadaceae, Trueperaceae, and Weeksellaceae.The gut microbiomes from both snails were consistent with terrestrial snails whose life histories involve interactions with plants and the rhizosphere in a warm climate. Many of the abundant (≥ 1%) microbial families represented photosynthetic aerobic soil bacteria (Bay et al. 2021). For example, Blastocatellaceae and Truperaceae were indicative of thermophilic taxa and Chitinophagaceae suggested an important fungal component to the environment and the snails’ diet (Albuquerque et al. 2005; Foesel et al. 2013; Medina-Sauza et al. 2019). Caulobacteraceae and Sphingomonadaceae are also chitin-degrading components of soil biofilms (Wieczorek et al, 2019). Three families likely represented enteric microbes: Enterobacteriaceae, Truperaceae, and Verrucomicrobiaceae. Bacteria in Enterobacteriaceae and Truperaceae specifically are aerobic sugar digesters consistent with environments and animal diets rich in cellulose and chitin (Albuquerque et al. 2005; Degelmann et al. 2009). While Bacteroidetes were more abundant in Pr. mexicana and can occur in gut microbiomes, the families we identified were non-enterics. We attributed our significant differences in bacterial communities to environmental differences between the two sites. The Bronc Trail is a 1.58 km covered walkway on the UTRGV campus; landscaping including grass and ornamentals constitute the adjacent ground cover. The backyard habitat is a traditional lawn partially shaded by native trees. The families that were significantly different were predominantly or exclusively environmental microbes, suggesting that the two snail species have similar enteric bacterial gut flora and similar diets.Three taxonomic groups from the gut microbiome of Po. cereolus that showed significantly higher abundance were notable, Tenericutes, Blastocatellaceae, and Legionellaceae. Tenericutes are often found in snail gastrointestinal compartments (Pawar et al. 2012; Chalifour &amp; Li 2021). Preliminary phylogenetic analyses of the Po. cereolus Tenericutes sequences suggest that the majority represent Mycoplasma spp. (data not shown). Mycoplasmas are found in a variety of invertebrate hosts including snails (Chen et al. 2021; North &amp; Minton 2021), and their differential abundance in the two snail species studied may speak to differences in resistance to microbial infection or exposure to infection through foreign introductions. The second group, Blastocatellaceae (Acidobacteria), is known primarily from desert soils in Africa (e. g. Foesel et al. 2013; Huber et al. 2014), while uncultured putative lineages from the family are found globally (NCBI 2021). One explanation for their abundance in south Texas may be that members of the family are carried to the Rio Grande Valley by the annual African dust clouds that occasionally reach the southwestern United States (Bozlaker et al. 2019). Another explanation may be that the semi-arid climate and geography of the Valley support Blastocatellaceae diversity. Finally, bacterial taxa in Legionellaceae are generally found in water, including industrial sources, and soil (Atlas 1999). We predict that the high observed abundance of Legionellaceae in snails from the UTRGV campus is due to grounds maintenance, where the bacteria are introduced to the landscape through watering from hoses and tanks (Thomas et al. 2014). Future research should aim to determine the origin and diversity of these three groups to in Rio Grande Valley snails to better understand why they are significantly more abundant in Po. cereolus.All junior authors contributed equally to the project as Gannon University BIOL 374 students in 2021. Funding for this project came from the GU Department of Biology and a GU faculty research grant to RLM. We thank Kathryn Perez for providing the specimens and the editor for valuable comments."}