{"doi": "https://doi.org/10.1016/j.quageo.2022.101417", "year": 2023, "abstract": "The loess-paleosol sequence on the Chinese Loess Plateau provides a unique archive that records climate change in East Asia in the Quaternary, yet absolute dating of the loess deposits is challenging due to the lack of directly datable materials. Fossil land snail shells, which are made from aragonite, are widely preserved in the loess deposits and have long been used to reconstruct past environmental changes. U-series dating of fossil land snail shells has the potential to provide a route for absolute dating of the loess deposits but remains largely unexplored. In this study, we present the first systematic investigation on the U-series isotope geochemistry as well as the early diagenetic imprints of fossil land snail shells (Cathaica sp.) from the Mangshan loess-paleosol sequence in Henan province, central China. Several geochemical techniques, including Raman microscopy, SEM, LA-ICPMS, LA-MC-ICPMS, solution-MC-ICPMS, and AMS 14C dating, were employed to investigate the mineralogy, chemical and isotopic compositions of both modern and fossil snail shells to micrometer level. Our results show that the fossil Cathaica sp. shells are overall characterized by a higher degree of porosity and elevated contents of organic matter compared to live-collected shells of the same species. The layers with higher porosity and organic matter content in the fossil Cathaica sp. shell are also found to be enriched in Na, Mg, Mn, Ba, and U, indicating diffusion and adsorption of these elements by specific surface binding sites of either aragonitic lattice or organic compounds of the fossil shell. Combining in-situ measurements using LA-MC-ICPMS with solution U-series determination, we further demonstrate that fossil Cathaica sp. shell is relatively homogeneous regrading both [234U/238U] and [230Th/238U] values although the distribution of U in the fossil shell is sample-specific. The comparison of different dating results suggests that the calculated apparent closed system U–Th ages are all systematically younger (∼6000 to 13,000 years) than the corresponding shell 14C ages and quartz SAR (single-aliquot regenerative-dose) ages from the Mangshan section. We suggest that the underestimation of U–Th ages of fossil Cathaica sp. shells is very likely caused by diagenetic uptake of U that started immediately after the burial of the shell and effectively ceased when the fossil shell was isolated from the pore waters due to persistent deposition of eolian dust at the Mangshan section. Our work on both modern and fossil Cathaica sp. shells thus provides detailed morphological and geochemical characterization for the diagenetic alteration of fossil snail shells and suggests that U-series dating of fossil land snail shells may provide age constraints for dust deposits in the semi-arid region although the timing of early diagenetic U-uptake by the fossil shells need to be better quantified for reliable age determination."}