{"doi": "https://doi.org/10.32718/nvlvet10825", "year": 2022, "abstract": "Farmers claim that keeping snails is straightforward, and feeding and caring for them does not require special financial costs. However, all living things are susceptible to infection and often experience mild or severe ailments. Apparent signs of snail disease are visible to the naked eye. They are manifested in atypical behavior, lack of growth and development, and untidy appearance. Therefore, the purpose of this work was to identify diseases of snails and clarify the causes of these diseases. We used: the method of sequential washing, the Fülleborn method, as well as general observations of the behavior of mollusks, their general survey, analysis of the diet, and the temperature-humidity mode of maintenance. It has been established that most diseases of snails occur due to non-compliance with the maintenance regime (crowding, non-compliance with temperature and humidity, lack of general cleaning of the farm) and an unbalanced diet. When researching helminthiasis, it was established that nematodes in different stages of development could be detected more often in snails of the natural population than in mollusks of the artificial breeding type. This is because, on the farm, you can create all the favorable conditions for growing, feeding, and keeping these creatures. The following factors should be considered: if comfortable conditions are not created on the farm, the mollusks can get sick from hypothermia or lack of moisture. The fact that the snail burrows into the soil often and for a long time may indicate improper conditions. Uncomfortably close contact with a rough substrate can lead to malaise and hibernation. The lack of a balanced diet is one of the main factors in the occurrence of snail diseases. The diet should always include fresh vegetables and fruits, protein supplements from meat and cereals, calcium-containing sprinkles from eggshells, and ready-made concentrates. Diseases carried by snails can be related to fungal diseases and intestinal infections. They get to mollusks with food. Therefore, it is necessary to constantly monitor the conditions of keeping, feeding, and condition of snails."}