{"doi": "https://doi.org/10.1016/j.quascirev.2023.108030", "year": 2023, "abstract": "Fragments of land snail (Achatinidae) shell were found at Border Cave in varying proportions in all archaeological members, with the exception of the oldest members 5 WA and 6 BS (>227,000 years ago). They were recovered in relatively high frequencies in Members 4 WA, 4 BS, 1 RGBS and 3 WA. The shell fragments present a range of colours from lustrous beige to brown and matt grey. The colour variability can occur when shell is heated. This possibility was explored here through experimental heating of giant land snail shell fragments (Achatinidae, Metachatina kraussi - brown lipped agate snail) in a muffle furnace from 200 to 550 °C for different lengths of time. Colour change, weight loss, and shattering of the heated samples were recorded. Transformation of aragonite into calcite and the occurrence of organic material was investigated by means of Infrared and Raman spectroscopy. Scanning electron microscopy was also used on selected specimens to help identify heat-induced transformation as opposed to taphonomic alteration. The identification on archaeological fragments of features produced by experimentally heating shells at high temperatures or for long periods has led us, after discarding alternative hypotheses, to conclude that large African land snails were systematically brought to the site by humans, roasted and consumed, starting from 170,000 years ago and, more intensively between 160,000 and 70,000 years ago. Border Cave is at present the earliest known site at which this subsistence strategy is recorded. Previous research has shown that charred whole rhizomes and fragments of edible Hypoxis angustifolia were also brought to Border Cave to be roasted and shared at the site. Thus, evidence from both the rhizomes and snails in Border Cave supports an interpretation of members of the group provisioning others at a home base, which gives us a glimpse into the complex social life of early Homo sapiens."}