{"doi": "https://doi.org/10.3853/j.2201-4349.75.2023.1824", "year": 2023, "abstract": "The 2019–2020 megafires in eastern Australia have devastated large parts of the known distributional range of the minute land snail Paralaoma annabelli, prompting conservation concerns for this species. However, this species is poorly defined thus hampering its accurate identification and the delineation of its distribution. Most crucially, it has been questionable if and how P. annabelli could be distinguished from another Australian congener, Paralaoma morti. This systematic ambiguity posed a problem in assessing the impact of the 2019–2020 wildfires in Australia on this species. Herein, we demonstrate, based on comparative morphometrics as well as analyses of mitochondrial and nuclear DNA, that P. annabelli is indeed distinct from a second widespread species of Paralaoma, which is identified as P. morti by some workers. Yet, sequences of P. morti cluster closely with non-Australian sequences of the globally distributed species P. servilis. Therefore, the taxonomic status of P. morti in relation to P. servilis remains to be investigated. Our comparative morphological analyses revealed that P. annabelli is significantly smaller than P. morti, has a significantly flatter shell, more elongated aperture, lower spire, and tighter coiling whorls. With the revised diagnosis of P. annabelli, we have delineated its distribution in New South Wales based on the examination of all available museum samples. We show that P. annabelli is primarily found at higher elevations in the Great Dividing Range while P. morti is widespread in eastern Australia. In addition, molecular phylogenetic analyses reveal that the genera Pseudiotula, Iotula, Trocholaoma and Miselaoma, all described based only on shell characteristics, form a single clade with the abovementioned species of Paralaoma. This reveals the inadequacies of a purely shell-based taxonomy in punctids and highlights the need for a more integrative approach to punctid systematics."}