{"doi": "https://doi.org/10.1016/j.scitotenv.2023.162677", "year": 2023, "abstract": "In fire-prone regions, fire is a major natural disturbance which shapes ecosystem function and community composition. Fire has a direct and dramatic effect on soil fauna and, especially, on non-mobile species such as land snails. The factors that make the Mediterranean Basin a fire-prone region may also lead to the appearance after fires of certain functional traits related to ecological and physiological characteristics. Knowledge of how community structure and function change along the post-fire succession will be useful for understanding the processes that drive biodiversity patterns in burnt areas and for implementing appropriate biodiversity management strategies. Here, we examine long-interval taxonomic and functional changes occurred in a snail community four and 18 years after a fire in the Sant Llorenç del Munt i l'Obac Natural Park (NE Spain). Our field-based study demonstrates that the land snail assemblage responds both taxonomically and functionally to fire and that there was a clear replacement of dominant species from the first to the second sampling period. Variation in community composition between different post-fire ages can be attributed to snail species traits and successional changes in post-fire habitat conditions. At taxonomic level, there was great variation in snail species turnover between both periods, being the development of the understorey vegetation structure the main driver of this variation. The replacement of functional traits between times since fire suggests that xerophilic and mesophilic preferences play an important role after fire and are largely determined by the complexity of post-fire microhabitats. Our analysis indicates that immediately after a fire there is a time-window of opportunity that attracts species specializing in early successional habitats, which thereafter are replaced due to the changing conditions resulting from succession. Consequently, knowing the functional traits of species is important for determining the impacts of disturbances on the taxonomic and functional communities."}