{"doi": "https://doi.org/10.1016/j.ympev.2023.107731", "year": 2023, "abstract": "The stylommatophoran land-snail genus Corilla is endemic to Sri Lanka and India’s Western Ghats. On the basis of habitat distribution and shell morphology, the 10 extant Sri Lankan species fall into two distinct groups, lowland and montane. Here, we use phylogenetic analyses of restriction-site-associated DNA sequencing (RADseq) data and ancestral-state reconstructions of habitat association and shell morphology to clarify the systematics and evolution of Sri Lankan Corilla. Our dataset consists of 9 species of Corilla. Phylogenetic analyses were based on 88 assemblies (9,604–4,132,850 bp) generated by the RADseq assembler ipyrad, using four parameter combinations and different levels of missing data. Trees were inferred using a maximum likelihood (ML) approach. Ancestral states were reconstructed using maximum parsimony (MP) and ML approaches, with 1 binary state character analysed for habitat association (lowland vs montane) and 6 binary state characters analysed for shell morphology (shape, colour, lip width, length of upper palatal folds, orientation of upper palatal folds and collabral sculpture). Over a wide range of missing data (40–87 % missing individuals per locus) and assembly sizes (62,279–4,132,850 bp), nearly all trees conformed to one of two topologies (A and B), most relationships were strongly supported and total branch support approached the maximal value. Apart from the position of Corilla odontophora ‘south’, topologies A and B showed similar, well-resolved relationships at and above the species level. Our study agrees with the shell-based taxonomy of C. adamsi, C. beddomeae, C. carabinata, C. colletti and C. humberti (all maximally supported as monophyletic species). It shows that C. erronea and C. fryae constitute a single relatively widespread species (for which the valid name is C. erronea) and that the names C. gudei and C. odontophora each apply to at least two distinct, yet conchologically-cryptic species. The MP and ML ancestral-state reconstructions yielded broadly similar results and provide firm evidence that diversification in Sri Lankan Corilla has involved evolutionary convergence in the shell morphology of lowland lineages, with a pale shell and wide lip having evolved on at least two separate occasions (in C. carabinata and C. colletti) from montane ancestors having a dark, narrow-lipped shell."}