{"doi": "https://doi.org/10.21203/rs.3.rs-2752635/v1", "year": 2023, "abstract": "Abstract The silvana -beds are the main component of the Upper Freshwater Molasse (“Obere Süßwassermolasse” or OSM) in southern Germany, Austria and Switzerland, named after the land snail Palaeotachea silvana (Klein, 1853). After initial disputes in the literature, in the 1920’s, malacologist Wilhelm Wenz better defined the silvana -beds lithology and its three informal subunits based on terrestrial gastropods. The silvana -beds mainly consist of limestone, marl and clay, eventually with sandy components. Despite remaining an informal stratigraphical unit, the silvana -beds is a practical tool for stratigraphic determination in the field and for paleomalacology studies. Information about the land snail communities of the silvana -beds are scattered in the literature and museum collections. Therefore, here we compile all this information and conduct a detailed biogeographic comparison of these localities’ snail faunas, based on similarity indices. For that purpose, all communities (containing at least six terrestrial gastropod species, from a total of 28 localities) within the silvana -beds and the adjoining coeval Bad Urach volcanic region were analyzed, based on four similarity indices and follow-up cluster analyses. The land snail communities of the silvana -beds formed six clusters (defined by ca. 50% similarity) according to the Sørensen-Dice index, five clusters by the Kulczynski and Ochiai indices, and four ones by the Simpson index. Despite some differences in the resulting dendrograms, enough similarity in the clustering was found for a meaningful comparison. The resulting clusters can be largely explained by geographic position, as is the case of the two main groupings recovered, representing the German Bavarian and Baden-Württemberg states. Some inconsistencies in the composition of the clusters might be explained by different stratigraphic positions within the silvana -beds, distinct paleoenvironmental conditions influencing the faunal composition, or the absence of key species."}