{"doi": "https://doi.org/10.3390/tropicalmed8050259", "year": 2023, "abstract": "Flooding is the main natural factor in snail diffusion, and it has a negative impact on schistosomiasis transmission. There are few studies on the spread and migration of snails following a flood; therefore, we aimed to investigate the influence of flooding on snail diffusion and explore the characteristics and laws of snail diffusion in Jiangxi Province. By using a retrospective survey and cross-sectional survey, the data on snail spreading in Jiangxi Province from 2017 to 2021 were collected. The distribution, nature, and area of snail spread were systematically analyzed in combination with the hydrological situation, types of region, and types of flood. From 2017 to 2021, a total of 120 snail-spread environments were found, including in 92 hilly areas and in 28 lake areas. The areas caused by flood and by other means numbered 6 and 114, respectively. The proportions of recurrence, expansion, and first-time occurrences were 43.42%, 38.16%, and 18.42%, respectively, and the 14 new snail environments were only distributed in the hilly areas. With the exception of 2018, the ratio of snail-spread areas in the hilly region was higher than that in lake region in other years. The average density of live snails was 0.0184–1.6617 no./0.1 m2 and 0.0028–0.2182 no./0.1 m2 in the hilly region. Among the 114 environments affected by floods, 86 consisted of hilly environments, including 66 spreading environments affected by rainstorm floods, and 20 rainstorm debris flow environments. There were 28 lake areas, of which 10 were in the Jiangxi section of Yangtze River and were affected by rainstorm floods. Snail spread following flooding has a certain ‘lag effect,’ and = simple annual changes in hydrological characteristics have little effect on the diffusion of snails or on their density = in the affected environment, but it is more closely related to local floods. The hilly environments are more susceptible to floods than the lake region, and the risk of snail spread is much higher in the hilly than in the lake region."}