{"doi": "https://doi.org/10.1111/jbi.14601", "year": 2023, "abstract": "Abstract Aim Oceanic islands provide an excellent opportunity to study the mode and tempo of phenotypic evolution of terrestrial organisms. Many studies have focused on oceanic islands far from the mainland. Oceanic islands near the mainland may provide distinct perspectives on phenotypic evolution, but a comprehensive understanding is still lacking. To address this gap, this study aimed to reveal when a land snail species inhabiting a volcanic archipelago within 40 km of the mainland diverged and how their shell colours evolved. Location Southern Izu Peninsula and five Izu Islands (Oshima, Toshima, Niijima, Shikine and Kozu), Japan. Taxon Euhadra peliomphala simodae. Methods Double‐digest restriction site‐associated DNA sequencing (ddRAD‐seq) was conducted using 117 individual snails. Molecular phylogenetic and population genomic analyses were performed, including approximation Bayesian computation (ABC). We then examined whether the island area, elevation, distance from the surrounding landmasses and historical event (bottleneck) explain the shell colour diversity on each island using a phylogenetic generalised linear mixed model (PGLMM). Results Snails could be genetically categorised according to the island they inhabited, and on Niijima, their genetic structure was further divided within the island. The divergence times among the extant populations of the snail dated back to 2.1 million years ago (Ma), which is older than that of other animals occurring in this region. Additionally, island elevation positively affected shell colour diversity, and populations with similar shell colour profiles were phylogenetically different. Main conclusions Island land snails diversified early in the ecosystem of the Izu Islands. This suggests that proximity to the mainland, immobility and the physiological tolerance of passive dispersal in land snails were the main causes of early diversification. Moreover, our study proposes that environments covarying with elevation would determine shell colour diversity on each island through natural selection."}