{"doi": "https://doi.org/10.2478/aoas-2023-0064", "year": 2023, "abstract": "Abstract The aim of this study was to assess the changes occurring as a result of boiling (100°C, 1 h) small brown snail ( Cornu aspersum aspersum ) meat in relation to its proximate composition, calcium, phosphorus and cholesterol content, as well as the profile of fatty acids and nutritional quality indices of the lipids. This species of snail was selected for research because it is currently of the greatest economic importance among edible terrestrial snails. It was hypothesized that the cooking effect may be different for foot and visceral sac. Samples for the research were collected from 6 populations bred on experimental fields of the National Research Institute of Animal Production in Balice (Poland). The foot and the visceral sac, the edible parts of the snail species under investigation, were analysed separately, raw and boiled in water. The results were then compared to analogous studies carried out by other authors on beef, pork and poultry. It was found that in the visceral sac of Cornu aspersum aspersum the shares of dry matter, crude protein, fat, ash, calcium and phosphorus were greater than those in the foot (P&lt;0.05), both in the raw and boiled material, whereas the cholesterol content was higher in the foot (P&lt;0.05). Generally, especially in the foot, the heat treatment elevated the levels of the afore-mentioned quantities, yet the increases were not always statistically significant. Boiling the snail meat caused moderate changes in the fatty acid composition. The profile of the fatty acids and the nutritional quality indices of the foot fat were more advantageous than those in the visceral sac. In both parts of the snail carcass, the polyunsaturated fatty acids / saturated fatty acids (PUFA/SFA) ratio substantially exceeded the minimum value of 0.45 recommended by the British Department of Health. However, the n-6/n-3 ratio was too high, exceeding the maximum recommended level of 4.0 twofold and as much as threefold in the case of the foot and the visceral sac, respectively. In the foot, due to boiling, an increase of the share of SFA and monounsaturated fatty acids (MUFA) was observed, while PUFA, n-6 and n-3 decreased. In the visceral sac, the changes were less pronounced with a slight decrease of the share of SFA and PUFA, and an increase of MUFA. Therefore, in the foot, boiling worsened the PUFA/SFA ratio, the nutritive value index (NVI = (C18:0 + C18:1) / C16:0) and dietary fatty acids having a desirable neutral and hypocholesterolemic effect in humans (DFA = Σ MUFA + Σ PUFA + C18:0), but in the visceral sac these indices practically did not change. On the whole, the trends of the changes in terms of chemical composition due to boiling found in the small brown snail meat are similar to those after heat treatment of meat from popular farm animals, but the ranges of the changes differ."}