{"doi": "https://doi.org/10.51168/sjhrafrica.v4i9.610", "year": 2023, "abstract": "Background: The African Giant Snail is considered one of the 100 species most harmful and exotic invaders in the world. Methodology: A bibliographic review was carried out in January 2021. References were searched in Pubmed, Medline, and Scelo databases. The Google Scholar search engine was used. The keywords: \"communicable diseases\", \"Achatina fulica\", \"African giant snail\", \"exotic invader species\", \"prevention\", and \"communicable diseases\", were used in the search strategy. Relevant literature or articles recently in English, Spanish, or Portuguese in full text were considered as selection criteria. The analysis of quality, reliability, and methodological validity of the chosen articles allowed us to carry out an adequate review and the selection of 26 bibliographic sources. Results: The Achatina fulica measures up to 30 cm. It is an oviparous hermaphrodite and deposits 100 to 200 eggs the first year and then between 500 and 1200. It has a brownish-black body and a reddish-brown conical shell with vertical lines. It serves as an intermediate host of parasites, bacteria, viruses, and fungi that cause illnesses in humans. The main control measures include the prevention of contact and the mechanical destruction of this vector. Conclusion: African Giant snail, disseminated to almost all the tropical regions of the world, produces big damage to agriculture, the flora, the fauna, and human health; the most effective method for its control is the manual gathering of the snail and its eggs for its later destruction, however, most of the population ignores the appropriate forms the eradication and it maintains a low perception of risk. Recommendation: This article sought to offer summarized information and recent that allows the medical students to identify the African giant snail and to carry out promotion actions and prevention in the communities that serve them as educational scenarios."}