{"doi": "https://doi.org/10.1080/07924259.2023.2241848", "year": 2023, "abstract": "ABSTRACTSize class dependent variations of growth and fecundity of three small land snails, Allopeas gracile (Hutton 1834) (Gastropoda: Subulinidae), Succinea daucina (Pfeiffer, 1855) (Gastropoda: Succineidae) and Glessula gemma (Reeve 1850) (Gastropoda: Subulinidae) were assessed in the laboratory condition. The field collected snails were segregated according to the size (shell length, in mm), and the frequency distribution of each size class was estimated. Subsequently, each size class was reared in the laboratory with continuous monitoring for the deposition of the eggs in the rearing terrarium for a period of six weeks using three replicates per size class. The growth rate of each species was highest in the smallest size class and declined gradually with the increment of shell length. The shell lengths of A. gracile and S. daucina at sexual maturity were 4–5 mm and 6–7 mm, respectively, and fecundity was positively linked with the size (shell length). G. gemma did not oviposit, except that the large size-class had given few small offspring. The results showed that growth and reproduction of three species varied significantly with size classes, which reflects the ability for these snails to colonize and establish in favourable habitats in short time period.KEYWORDS: Land snailsize classlife history traitsshell lengthfecundity AcknowledgmentsWe thank the esteemed reviewers for the critical comments that helped in the enhancement of the manuscript in the present form. We are grateful to the Head, Department of Zoology, University of Calcutta, Kolkata, India, for the facilities provided including DST-FIST and DRS-SAP UGC, in carrying out this work. HB acknowledges the Principal, Ramnagar College, Depal, West Bengal, India, for the facility provided in executing research activities. The Director, Zoological Survey of India is acknowledged for the kind help rendered in identification of the snail specimens. The first author GN, acknowledges UGC for the financial assistance through the sanction number Sr. No. 2121430436, Ref. No: 21/12/2014(ii) EU-V, Roll No: 347069, dated 08/06/2015.Disclosure statementAs author(s) of this article, we declare that we do not have any conflict of interest.Contribution of the authorsConceptualization- GA, field collection- GA, GN, SB, SP and HB, execution of the experiment- GN, SB, SP and HB, data analysis- GN and GA, drafting of the manuscript- GN and GA.Data availability statementThe data used in this manuscript will be made available upon authentic and reasonable request.Additional informationFundingGN acknowledges the financial assistance of UGC, India through the fellowship sanction no. Sr. No. 2121430436, Ref. No: 21/12/2014(ii) EU-V, Roll No: 347069, dated 08/06/2006 in carrying out a part of this research work."}