{"doi": "https://doi.org/10.18061/bssb.v2i2.8873", "year": 2023, "abstract": "The Pacificellinae are a group of small, high-spired land snails distributed on islands across the Pacific. Some species are endemic to particular island groups, but others have wide geographic distributions, several of which have been attributed to anthropogenic transport between islands before western contact. We used DNA sequence data (COI, 16S, ITS2, 28S) from recently collected and historical specimens to estimate a phylogeny of the Pacificellinae, with a focus on Hawaiian species. Phylogenetic analyses support recognizing Lamellidea and Pacificella as distinct genera and indicate that the genus group Tornatellinops should be regarded as a synonym of Lamellidea. The number of taxa defined by species delimitation analyses (ASAP, bPTP, mPTP) varies widely, with between 6 and 42 species estimated in the Hawaiian Islands. These candidate species hypotheses were evaluated in an integrative framework, including shell morphology, geography, and a multilocus phylogeny, to revise the taxonomy of Hawaiian pacificellines. Four Lamellidea species and two Pacificella species are recognized from the Hawaiian Islands, including two widespread species introduced to Hawaiʻi from the South Pacific. Lamellidea peponum in Hawaiʻi shows little genetic divergence from Polynesian specimens previously referred to L. oblonga, and the name L. oblonga is now regarded as a junior synonym. Lamellidea polygnampta is recognized here from across the Hawaiian Islands, L. cylindrica from the island of O‘ahu, and the lowland species, L. extincta, from the main Hawaiian Islands and the Northwestern Islands. The only Pacificella specimens found in Hawai‘i in modern surveys are more closely related to specimens of P. variabilis from Polynesia than to historical specimens of P. baldwini, indicating that the only Pacificella species now found in the main Hawaiian Islands appears to be introduced. Pacificellines have declined in abundance in Hawai‘i over the last century and the two species L. extincta and P. baldwini, formerly present across the Hawaiian Islands, are now either critically endangered or extinct."}