{"doi": "https://doi.org/10.58837/chula.the.2016.1923", "year": 2023, "abstract": "Taxonomy of Laos’ s terrestrial pulmonate snails has been carried out from 2013 to 2014 As from the previous records, 76 recognized species have been reported and published. There are 315 localities from 16 provinces dividing from three main geographic areas: the north montane forest, the central limestone karsts and the south deciduous forest. All those three areas have been intensively surveyed in the present study. All specimens were photographed prior to preserve in 70% ethanol. Shell morphology, soft parts anatomy especially the reproductive organs were used for identification. One hundred and twelve species that belong to 50 genera from 17 families were identified and updated. These included with the 76 previous recorded species, three new recorded families with ten genera were classified and incorporated in the total faunal record. Thirty six species were reported in Laos for the first time. Ten newly described species from four families (Camaenidae, Diapheridae, Streptaxidae, and Vertiginidae) were published. There are four snail types as classified from habitat and some distinct behaviour: 1) Ground dwellers 2) Tree dwellers 3) Carnivores and 4) Microsnails. The ground dweller Ariophantidae is quite dominant family which occurs in three regions. Cryptozona siamensis and Hemiplecta distincta are the best representatives. The microsnails family Vertiginidae are unique living on limestone habitats, were found mainly in the north and central of Laos. The fourteen species of tree snails Amphidromus were found also in three regions but slightly different in species composition. The two newly described, Amphidromus (Amphidromus) syndromoideus and A. (syndromus) xiengkhaungensis are from the north and central areas. The unique carnivorous Streptaxidae and Diapheridae perform high endemism. The total 10 species and the four newly described species, Perrottetia unidentata, P. megadentata, Indoartemon diodonta and Sinoennea euryomphala were collected mainly from limestone habitats of the north and the central areas. The total 112 species were very low compared to the large areas and the records from the nearby countries. The more critical surveys especially in rainy season might answer this question. The phylogenetic relationship using cladistics analysis of 29 morphological characters in 8 species of 5 genera of the Ariophantidae performs the great congruence with morphological identification and exhibited monophyletic relationship. The genera Macrochlamys and Sarika showed a very close relationship by 69% bootstrap support. As from the analysis, the genus Sarika seemed to belong to the subfamily Macrochlamydinae."}