{"doi": "https://doi.org/10.1080/13235818.2023.2258421", "year": 2023, "abstract": "ABSTRACTThe production performance of two heliciculture farming systems (open field and net-covered greenhouse) and two densities per production cycle (125 and 250 snails m−2) of the main land snail bred in Greece (Cornu aspersum maximum), was compared using breeding indicators and evaluation of the commercial product. Over 50% of the snails in all treatments reached adulthood in 45 days with most snails reaching maturity (95% on average) by the end of the experiment (56 days) irrespective of the farming density. Mortality rate and nematode egg counts (EPG) were relatively low in both farming systems indicating optimal (density and environmental) farming conditions. Open field treatments resulted in heavier snails and higher weight gain at the end of the experiment compared to the greenhouse treatments. Snail fillet mass exhibited lowest values in the open high-density field and highest in the low-density net-covered greenhouse treatment. Τhe combination of low density with net-covered greenhouse yielded the best results for the highest snail fillet mass. The results of the present study could assist snail farmers adopt suitable breeding methods leading to increased production and better-quality commercial products with lower mortality and improved welfare.KEYWORDS: Land snailCornu aspersum maximumsnail fillet masswelfare AcknowledgementsThis research was co-financed by Greece and the European Union (European Social Fund, ESF) through the Operational Programme ‘Human Resources Development, Education and Lifelong Learning’ in the context of the project ‘Strengthening Human Resources Research Potential via Doctorate Research’ (MIS-5000432), implemented by the State Scholarships Foundation (ΙΚΥ). We would like to thank the reviewers for taking the necessary time and effort to review the manuscript. We sincerely appreciate all the valuable comments and suggestions, which helped us to improve the quality of the manuscript.Disclosure statementNo potential conflict of interest was reported by the author(s).Conflicts of interestThe authors declare no conflicts of interest.Additional informationFundingThis work was supported by State Scholarships Foundation: [Grant Number MIS-5000432]."}