{"doi": "https://doi.org/10.7717/peerj.15827", "year": 2023, "abstract": "Background Mucus derived from many land snails has been extensively utilised in medicine and cosmetics, but some biological activities of the mucus need to be well documented. Nevertheless, most mucus is obtained from land snails, while mucus from freshwater snails has yet to be attended. Methods This study aims to determine and compare mucus’s antioxidant and anti-inflammatory activities from the land snail Lissachatina fulica and the freshwater snail Pomacea canaliculata . ABTS, DPPH, reducing power and total antioxidant activity assays were used to evaluate the antioxidant capacity. Inhibition of nitric oxide production in lipopolysaccharide-activated RAW 264.7 cells was performed to determine the anti-inflammatory activity. Additionally, the histochemical analysis of mucous cells in each snail foot was conducted to compare the distribution of mucous cells and types of mucins using periodic acid-Schiff and Alcian blue staining. Results Mucus from L. fulica and P. canaliculata exhibited antioxidant and anti-inflammatory activities in different parameters. L. fulica mucus has higher total antioxidant (44.71 ± 2.11 mg AAE/g) and nitric oxide inhibitory activities (IC 50 = 9.67 ± 0.31 µg/ml), whereas P. canaliculata mucus has better-reducing power activity (43.63 ± 2.47 mg AAE/g) and protein denaturation inhibition (IC 50 = 0.60 ± 0.03 mg/ml). Histochemically, both species’ dorsal and ventral foot regions contained neutral and acid mucins in different quantities. In the dorsal region, the neutral mucins level in L. fulica (16.64 ± 3.46%) was significantly higher than that in P. canaliculata (11.19 ± 1.50%), while the acid mucins level showed no significant difference between species. Levels of both mucins in the ventral foot region of L. fulica (15.08 ± 3.97% and 10.76 ± 3.00%, respectively) were significantly higher than those of P. canaliculata (2.25 ± 0.48% and 2.71 ± 0.56%, respectively). This study revealed scientific evidence of the biological capacity of mucus from L. fulica and P. canaliculata as well as provided helpful information on the region of the foot which produces effective mucus."}