{"doi": "https://doi.org/10.1111/jbi.14740", "year": 2023, "abstract": "Abstract Aim Island biological communities are considered to comprise non‐random assemblages from surrounding source pools, but whether they converge towards predictable structural properties remains unclear. Here, we (i) test whether insular communities of land snails converge towards similar functional and/or taxonomic properties and (ii) evaluate whether island functional diversity is determined by island biogeographical characteristics such as area and distance to the pool as well as human‐related variables. Location Sixty‐six continental Aegean islands. Taxon Land snails. Methods We compiled a database of two morphological traits with functional significance (shell height and width) for 163 island species and 1529 species from the major species pools. We quantified inter‐specific morphological dissimilarity between pairs of islands (turnover), using a modified index of the mean nearest taxon distance. We tested for functional and taxonomic convergence using null models and assessing whether overall mean turnover among islands and pairwise island‐by‐island turnover were lower than expected by chance. We performed multiple regression analyses to test whether functional diversity metrics scale with island biogeographical characteristics and human‐related variables. Results Our analyses provide strong evidence that communities of land snails across the Aegean islands converge towards non‐random functional properties and taxonomic structure. At the island level, a wide range of different shell shapes is observed, indicating greater functional richness than expected by chance. Regression analyses showed that island area is the only efficient predictor of functional diversity, indicating that available ecological/resource space is of central importance in driving the assembly of different shell shapes. Main Conclusions Our findings, consistent with previous studies of other taxa from oceanic islands, highlight that island species communities are not randomly assembled and display convergence in their functional and taxonomic composition. Integrating functional diversity metrics within biogeographic analyses has the potential to further our understanding of island biodiversity patterns."}