{"doi": "https://doi.org/10.1071/is22049", "year": 2023, "abstract": "Norfolk Island harbours a rich land snail diversity dominated by the Microcystidae and Helicarionidae that are currently represented by 10 endemic genera and 27 accepted species and subspecies. We comprehensively revise the taxonomy of these taxa using comparative morphology and phylogenetic analyses of the mitochondrial genes COI and 16S. We demonstrate that most ‘helicarionid’ species belong to Microcystidae with only a single species of Helicarionidae present (Dendrolamellaria mathewsi). The Norfolk Island microcystids comprise five major clades. These clades may have independently colonised the Norfolk Island group; however, clarity may only be achieved in a broader phylogenetic context that incorporates the study of extralimital groups. Three clades have radiated in situ into multiple endemic species. Based on our findings, we recognise the previously accepted genera Iredaleoconcha, Nancibella and Roybellia as junior synonyms of Allenoconcha, and Mathewsoconcha and Quintalia as junior synonyms of Advena, based on the close phylogenetic relationships. Furthermore, we confirm the previous treatment of Lutilodix, Parcolena and Dolapex as junior synonyms of Fanulena and Belloconcha as a synonym of Advena, bringing the total number of Norfolk Island microcystid genera to five. Secondly, we provide revised descriptions for each of these genera. Thirdly, we remove Allenoconcha belli, A. mathewsi, A. monspittensis, A. perdepressa and A. royana from the synonymy with Allenoconcha basispiralis. We also remove Helix patescens from synonymy with Quintalia flosculus, treating this as a member of Allenoconcha, and resurrect Advena campbellii nepeanensis and Quintalia stoddartii intermedia as accepted subspecies. Based on comparative morpho-anatomy, we treat Allenoconcha mathewsi and A. monspittensis as junior synonyms of Allenoconcha royana, A. inopina as a junior synonym of Allenoconcha caloraphe, Fanulena fraternus as a junior synonym of F. amiculus, Advena campbellii charon as a synonym of Advena campbellii campbellii, Mathewsoconcha belli, M. compacta and M. norfolkensis as junior synonyms of Advena suteri, M. elevata as a junior synonym of Advena grayi, and M. microstriatum as a junior synonym of Advena phillipii. Lastly, we describe three new species, Allenoconcha evansorum sp. nov., A. margaretae sp. nov. and A. varmani sp. nov. In summary, we accept 27 microcystid species and subspecies all of which are endemic to the Norfolk Island group. We provide recent and historical distribution data for each species and demonstrate that seven species or subspecies are probably extinct. All species are well differentiated in terms of basal branch lengths in the phylogenetic tree, but this distinction is not consistently reflected in the external morphology. Some closely related sister-taxa are very similar in shell morphology whereas others exhibit highly distinctive shells. We hypothesise that these stark differences in shell morphology may result from adaptation to different ecological niches, yet we currently lack a detailed understanding of the underlying evolutionary mechanisms. ZooBank: urn:lsid:zoobank.org:pub:BEFC0F76-4405-4EE7-9060-B7D9FB84BCB1"}