{"doi": "https://doi.org/10.1002/ece3.10785", "year": 2023, "abstract": "Abstract The factors that influence population structure and connectivity are unknown for most terrestrial invertebrates but are of particular interest both for understanding the impacts of disturbance and for determining accurate levels of biodiversity and local endemism. The main objective of this study was to determine the historical patterns of genetic differentiation and contemporary gene flow in the terrestrial snail, Austrochloritis kosciuszkoensis (Shea &amp; O. L. Griffiths, 2010). Snails were collected in the Mt Buffalo and Alpine National Parks in Victoria, in a bid to understand how populations of this species are connected both within continuous habitat and between adjacent, yet separate environments. Utilising both mitochondrial DNA (mtDNA) and single nucleotide polymorphism (SNP) data, the degree of population structure was determined within and between sites. Very high levels of genetic divergence were found between the Mt Buffalo and Alpine snails, with no evidence for genetic exchange detected between the two regions, indicating speciation has possibly occurred between the two regions. Our analyses of the combined mtDNA and nDNA (generated from SNPs) data have revealed patterns of genetic diversity that are consistent with a history of long‐term isolation and limited connectivity. This history may be related to past cycles of changes to the climate over hundreds of thousands of years, which have, in part, caused the fragmentation of Australian forests. Within both regions, extremely limited gene flow between separate populations suggests that these land snails have very limited dispersal capabilities across existing landscape barriers, especially at Mt Buffalo: here, populations only 5 km apart from each other are genetically differentiated. The distinct genetic divergences and clearly reduced dispersal ability detected in this data explain the likely existence of at least two previously unnamed cryptic Austrochloritis species within a 30–50 km radius, and highlight the need for more concentrated efforts to understand population structure and gene flow in terrestrial invertebrates."}