{"doi": "https://doi.org/10.4236/ojas.2023.133026", "year": 2023, "abstract": "This study was conducted from June 2021 to January 2023 to assess the genetic diversity of giant African snails in the western highlands of Cameroon. A total of 652 snails were randomly collected from the wild in three localities in the western highlands (Bafang, Bafoussam, and Santchou). The study revealed significant variations in morphobiometric characteristics both between species and localities. The predominant shell coloration was brownish with yellow zigzag stripes (65%), while the dominant coloration for shell openings was whitish (48%). Regarding foot coloration, both brown with spotted black and black with spotted brown colorations were dominant (29%). The highest recorded live weight of snails (39.33 ± 34a) was found in the species Archachatina marginata. In terms of length measurements (in mm), the length of the right and left sides of the shell was higher in the A. fulica species (49.8 ± 19.7a mm and 40.07 ± 18a mm, respectively). Bafang exhibited the highest values for shell length (56 ± 11 mm) and shell width (46.52 ± 11.46a mm). A. fulica recorded the highest shell length (81.5 ± 27a mm), while A. marginata recorded the highest shell width (49.6 ± 12.1b mm), with the highest values observed in A. fulica from fulica having a slightly higher aperture width value (30 ± 10 mm) compared to A. marginata, while A. marginata had the highest value for aperture length measurement (54.5 ± 12 mm). A. fulica also exhibited the highest values for the length from apex to the first whorl and the length from left to right of the first whorl (43.2 ± 18a mm and 39 ± 19.8a mm, respectively). Strong and positive correlations were observed between the live weight of snails and body measurements regardless of species, except for the number of whorls, which showed very weak or negative correlations with other body measurements. The results of Hierarchical Cluster Analysis (HCA) revealed three distinct snail population types. These findings provide valuable insights into the phenotypic diversity of edible land snails in the western highlands of Cameroon and can be considered in improvement and conservation programs aimed at enhancing snail meat yield."}