{"doi": "https://doi.org/10.1016/j.palaeo.2023.111754", "year": 2023, "abstract": "The stable oxygen isotope composition (δ18O) of land snail shells has been used for decades to provide insight into past changes in δ18Oprecipitation, relative humidity, moisture source and several other paleoenvironmental parameters across diverse environments and ecosystems. Recently, carbonate clumped isotope values (Δ47) recorded from land snail shells have also been applied as a geothermometer. However, there is limited information available regarding the relationship between modern shell geochemistry and paleoenvironmental conditions for regions with contrasting climates, which is needed for further contextualization and validation of snail shell temperature proxies. Our study utilizes paired Δ47 and δ18Oshell measurements in terrestrial snail shells to reconstruct temperature (T47) and δ18Obody water composition, which are two key variables used for the study of regional and sub-regional paleoclimates and paleoecosystems. We examine shells from three geographical regions with distinct hydroclimates: Central Europe, the Canary Islands, and the Chinese Loess Plateau. To constrain the timing of shell growth, we compare snail shell isotope-derived climate parameters to independent environmental data, including mean annual, warm season, and rainy season temperatures, assuming snail shells mineralize during the optimal activity range of 15–25 °C. Our results indicate that values for samples from the Canary Islands are most consistent with year-round growth; Chinese Loess Plateau samples are most consistent with summer growth; and samples from Central Europe are most consistent with growth between spring and autumn. Calculated values of δ18O body water in snail shells were found to be enriched relative to the value of δ18Oprecipitation for the season of growth, with values ranging from ~1–5‰. Altogether, our data suggest that Δ47 and δ18O measurements from terrestrial snail shells represent a useful archive of environmental temperature and humidity. However, their application in the paleo-record requires careful consideration of the ecophysiology of the taxa, and the climate of the region."}