{"doi": "https://doi.org/10.3406/bspf.2013.14321", "year": 2013, "abstract": "Malacological studies using land-snail shells found on archaeological sites are very scarce in the Maghreb, although such remains are the main constituent of Holocene sites known locally as rammadiyet. In this paper, the open-air prehistoric sites studied belong to the Upper Capsian culture. The Capsian culture is one of the Epipalaeolithic cultures found in the Maghreb and is inherent to Tunisia and eastern Algeria. Capsian open-air sites are huge oval accumulations of ashes, a lot of land-snail shells and burned stones, flint material and faunal remains. The Capsian culture is divided into two subdivisions : Typical Capsian and Upper Capsian. The prehistoric sites examined in this research belong to Upper Capsian subdivisions. Different facies or ‘ regional varieties’ are known from Capsian sites. Chronologically, Capsian sites with their different facies, dated by 14C, give an age of between 10000 and 6000 BP. The Capsian groups are considered to have been the last hunter-gatherers in the Maghreb. Their way of life depended on gathering land snails, hunting wild animals and picking fruit. Standard malacological studies on rammadiyet vestiges are however still insufficient to detect the impact of land snails on the subsistence economy of Capsian communities. Our study includes simultaneously the identification of the land-snail shells (species), an attempt at determining their ages, and taphonomic analyses. It enables us to propose, for both the studied sites, a reconstruction of the contribution of land snails to the Capsian population''s food, and to try to identify the season the molluscs were collected. Our work concerned two series resulting from surveys carried out in 2005 in two stratified rammadiyet : El Oghrab and Aïn Oum Henda 1 (Meknassy, central Tunisia). Careful investigations were made regarding the stratigraphy as well as the material culture (lithic industry) and faunal remains from both sites. Faunal remains are scarce at the El Oghrab rammadiya and absent at the Aïn Oum Henda 1 rammadiya. For the malacofauna, we adopted a method of work that can be exploited for the study of collections resulting from other similar sites. After identification of the species, we quantified them by NISP (number of identified remains for each species), then calculated the minimum number of individuals (MNI). Some measurements (height and diameter) were noted for each shell. Fragments of shells were classified in different classes. A specific fragment typology was adopted (from Type 0 to Type 6). In this paper we present the results of analysis of series of malacofauna from both rammadiyet. We have highlighted the presence of nine species of land snails : Helix melanostoma, Helix sp., Eobania vermiculata, Otala lactea, Helicella ambilina, Helicella variabilis, Helicella sp., Leucochroa candidissima, Rumina decollata. Two land snail species prevail, Leucochroa candidissima and Helix melanostoma. This would seem to confirm a selection made by the human groups among the species available in their surrounding environment. This choice is also affected by the abundance of these two species in the environment of the sites depending on the season and palaeoenvironmental conditions. This selection is also manifested by the size of the land snails collected. The Capsian populations mostly collected adult gastropods and privileged the biggest individuals, which provided the most flesh. According to taphonomic studies and especially to the typology of shell fragments, the high percentage of broken shells is probably linked to trampling and not to the consumption method of these molluscs by humans. The trampling may be related to the nature of activities which took place on the site or to the topographic position of both rammadiyet (high up, near a small stream) in the Meknassy Basin. This was a stopping place for prehistoric humans coming from the region of Gafsa and the west (the Tebessa high plateaux) and moving either northwards or towards the Mediterranean coast. The important quantity of broken shells would seem to be the result of these successive passages of groups. The presence of a marine shell (Columbella rustica) shows another aspect of the behaviour of Capsian groups : we presume there were exchanges between the Capsian populations and coastal communities. The gathering and consumption of land snails at these sites seem to have been seasonal. We note changes in the amount of each species (NISP) and the composition of the species spectrum from different levels of the El Oghrab rammadiya. The gathering of land snails mainly occurred during the spring and autumn. This seasonality helps us to reconstitute the way of life of Capsian communities. These groups, the last hunter-gatherers in Tunisia and Algeria, survived mainly by gathering land snails and some occasional hunting activity. These results help to reconstitute environments and the Capsian culture but still require additional examination of material from other rammadiyet in Tunisia. The malacological species consumed by the prehistoric humans occupied a wetter environment than the current one. Nowadays these species of snails (Leucochroa candidissima, Helicella sp., Helix melanostoma) are extremely rare, even absent, indicating increased aridity in central Tunisia. When the Capsian communities disappeared and Neolithic Capsian-tradition groups appeared there was no change in the consumption of land snails. Capsian-tradition Neolithic populations continued to gather and consume terrestrial snails as well as some domestic fauna."}